OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
/* -----------------------------------------------------------------------------
 -- STAR MC1 Core Configuration
  ----------------------------------------------------------------------------- */

/*!
 * @addtogroup Core_Configuration STAR MC1 Core Configuration
 * @{
 */
/* -------  Start of section using anonymous unions and disabling warnings  ------- */
#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

#define __STAR_REV                0x0100U   /* Core revision r1p0 */
#define __SAUREGION_PRESENT       0U        /* SAU regions present */
#define __MPU_PRESENT             1U        /* MPU present */
#define __VTOR_PRESENT            1U        /* VTOR present */
#define __NVIC_PRIO_BITS          3U        /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0U        /* Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT             1U        /* FPU present */
#define __DSP_PRESENT             1U        /* DSP extension present */
#define __ICACHE_PRESENT          1U        /* Define if an ICACHE is present or not */
#define __DCACHE_PRESENT          1U        /* Define if an DCACHE is present or not */

#include "core_star.h"                /* Core Peripheral Access Layer */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */



/* -----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ----------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{

 */

/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif
/* Define the base address of the large memory block mapping */

#define FLASH_ADDR_BASE 0x08000000u
#define SRAM_BASE       0x30000000u

#define APB1_BASE       0x40000000u
#define APB2_BASE       0x40010000u
#define AHB1_BASE       0x40020000u
#define AHB1_1_BASE     0x40040000u
#define AHB2_BASE       0x50000000u
#define AHB3_BASE       0x60000000u
#define AHB3_1_BASE     0x64000000u
#define AHB3_2_BASE     0x68000000u
#define AHB3_3_BASE     0x6C000000u
#define AHB4_BASE       0x90000000u
#define AHB4_1_BASE     0xA0000000u


/* Define the mapping base address of the peripheral module */
#define TIM2_BASE        (APB1_BASE + 0x0000 )
#define TIM3_BASE        (APB1_BASE + 0x0400 )
#define TIM4_BASE        (APB1_BASE + 0x0800 )
#define TIM5_BASE        (APB1_BASE + 0x0C00 )
#define TIM6_BASE        (APB1_BASE + 0x1000 )
#define TIM7_BASE        (APB1_BASE + 0x1400 )
#define RTC_BKP_BASE     (APB1_BASE + 0x2800 )
#define WWDG_BASE        (APB1_BASE + 0x2C00 )
#define IWDG_BASE        (APB1_BASE + 0x3000 )
#define SPI2_BASE        (APB1_BASE + 0x3800 )
#define SPI3_BASE        (APB1_BASE + 0x3C00 )
#define UART2_BASE       (APB1_BASE + 0x4400 )
#define UART3_BASE       (APB1_BASE + 0x4800 )
#define UART4_BASE       (APB1_BASE + 0x4C00 )
#define UART5_BASE       (APB1_BASE + 0x5000 )
#define I2C1_BASE        (APB1_BASE + 0x5400 )
#define I2C2_BASE        (APB1_BASE + 0x5800 )
#define CRS_BASE         (APB1_BASE + 0x6C00 )
#define PWR_BASE         (APB1_BASE + 0x7000 )
#define DBGMCU_BASE      (APB1_BASE + 0x7080 )
#define DAC_BASE         (APB1_BASE + 0x7400 )
#define UART7_BASE       (APB1_BASE + 0x7800 )
#define FLEXCAN1_BASE    (APB1_BASE + 0xC000 )

#define SYSCFG_BASE      (APB2_BASE + 0x0000 )
#define EXTI_BASE        (APB2_BASE + 0x0400 )
#define LPUART_BASE      (APB2_BASE + 0x0800 )
#define ADC1_BASE        (APB2_BASE + 0x2400 )
#define ADC2_BASE        (APB2_BASE + 0x2800 )
#define TIM1_BASE        (APB2_BASE + 0x2C00 )
#define SPI1_BASE        (APB2_BASE + 0x3000 )
#define TIM8_BASE        (APB2_BASE + 0x3400 )
#define UART1_BASE       (APB2_BASE + 0x3800 )
#define UART6_BASE       (APB2_BASE + 0x3C00 )
#define COMP_BASE        (APB2_BASE + 0x4000 )
#define FLEXCAN2_BASE    (APB2_BASE + 0x8000 )
#define LPTIM_BASE         (APB2_BASE + 0xD000 )
#define MDS_BASE         (APB2_BASE + 0xFC00 )

#define DMA1_BASE        (AHB1_BASE + 0x0000 )
#define DMA2_BASE        (AHB1_BASE + 0x0400 )
#define RCC_BASE         (AHB1_BASE + 0x1000 )
#define FLASH_BASE       (AHB1_BASE + 0x2000 )
#define CRC_BASE         (AHB1_BASE + 0x3000 )
#define ENET_BASE        (AHB1_BASE + 0x8000 )
#define CORDIC_BASE      (AHB1_BASE + 0xA000 )

#define GPIOA_BASE       (AHB1_1_BASE + 0x0000 )
#define GPIOB_BASE       (AHB1_1_BASE + 0x0400 )
#define GPIOC_BASE       (AHB1_1_BASE + 0x0800 )
#define GPIOD_BASE       (AHB1_1_BASE + 0x0C00 )
#define GPIOE_BASE       (AHB1_1_BASE + 0x1000 )
#define GPIOF_BASE       (AHB1_1_BASE + 0x1400 )
#define GPIOG_BASE       (AHB1_1_BASE + 0x1800 )
#define GPIOH_BASE       (AHB1_1_BASE + 0x1C00 )
#define GPIOI_BASE       (AHB1_1_BASE + 0x2000 )

#define USB_BASE         (AHB2_BASE + 0x0000 )

#define FSMC_BANK0_BASE  (AHB3_BASE + 0x0000 )

#define FSMC_BANK1_BASE  (AHB3_1_BASE + 0x0000 )

#define FSMC_BANK2_BASE  (AHB3_2_BASE + 0x0000 )

#define FSMC_BANK3_BASE  (AHB3_3_BASE + 0x0000 )

#define QSPI_M_BASE      (AHB4_BASE + 0x0000 )

#define FSMC_BASE        (AHB4_1_BASE + 0x0000 )
#define QSPI_BASE        (AHB4_1_BASE + 0x1000 )
/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 *  @{
 */

