OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ADC_ANYCFG_CHANYSELH12_SHIFT            (20)
#define ADC_ANYCFG_CHANYSELH12_MASK             (0x01U << ADC_ANYCFG_CHANYSELH12_SHIFT)
#define ADC_ANYCFG_CHANYSELH12(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH12_SHIFT)) & ADC_ANYCFG_CHANYSELH12_MASK)

#define ADC_ANYCFG_CHANYSELH11_SHIFT            (19)
#define ADC_ANYCFG_CHANYSELH11_MASK             (0x01U << ADC_ANYCFG_CHANYSELH11_SHIFT)
#define ADC_ANYCFG_CHANYSELH11(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH11_SHIFT)) & ADC_ANYCFG_CHANYSELH11_MASK)

#define ADC_ANYCFG_CHANYSELH10_SHIFT            (18)
#define ADC_ANYCFG_CHANYSELH10_MASK             (0x01U << ADC_ANYCFG_CHANYSELH10_SHIFT)
#define ADC_ANYCFG_CHANYSELH10(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH10_SHIFT)) & ADC_ANYCFG_CHANYSELH10_MASK)

#define ADC_ANYCFG_CHANYSELH9_SHIFT             (17)
#define ADC_ANYCFG_CHANYSELH9_MASK              (0x01U << ADC_ANYCFG_CHANYSELH9_SHIFT)
#define ADC_ANYCFG_CHANYSELH9(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH9_SHIFT)) & ADC_ANYCFG_CHANYSELH9_MASK)

#define ADC_ANYCFG_CHANYSELH8_SHIFT             (16)
#define ADC_ANYCFG_CHANYSELH8_MASK              (0x01U << ADC_ANYCFG_CHANYSELH8_SHIFT)
#define ADC_ANYCFG_CHANYSELH8(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH8_SHIFT)) & ADC_ANYCFG_CHANYSELH8_MASK)

#define ADC_ANYCFG_CHANYSELH7_SHIFT             (15)
#define ADC_ANYCFG_CHANYSELH7_MASK              (0x01U << ADC_ANYCFG_CHANYSELH7_SHIFT)
#define ADC_ANYCFG_CHANYSELH7(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH7_SHIFT)) & ADC_ANYCFG_CHANYSELH7_MASK)

#define ADC_ANYCFG_CHANYSELH6_SHIFT             (14)
#define ADC_ANYCFG_CHANYSELH6_MASK              (0x01U << ADC_ANYCFG_CHANYSELH6_SHIFT)
#define ADC_ANYCFG_CHANYSELH6(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH6_SHIFT)) & ADC_ANYCFG_CHANYSELH6_MASK)

#define ADC_ANYCFG_CHANYSELH5_SHIFT             (13)
#define ADC_ANYCFG_CHANYSELH5_MASK              (0x01U << ADC_ANYCFG_CHANYSELH5_SHIFT)
#define ADC_ANYCFG_CHANYSELH5(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH5_SHIFT)) & ADC_ANYCFG_CHANYSELH5_MASK)

#define ADC_ANYCFG_CHANYSELH4_SHIFT             (12)
#define ADC_ANYCFG_CHANYSELH4_MASK              (0x01U << ADC_ANYCFG_CHANYSELH4_SHIFT)
#define ADC_ANYCFG_CHANYSELH4(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH4_SHIFT)) & ADC_ANYCFG_CHANYSELH4_MASK)

#define ADC_ANYCFG_CHANYSELH3_SHIFT             (11)
#define ADC_ANYCFG_CHANYSELH3_MASK              (0x01U << ADC_ANYCFG_CHANYSELH3_SHIFT)
#define ADC_ANYCFG_CHANYSELH3(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH3_SHIFT)) & ADC_ANYCFG_CHANYSELH3_MASK)

#define ADC_ANYCFG_CHANYSELH2_SHIFT             (10)
#define ADC_ANYCFG_CHANYSELH2_MASK              (0x01U << ADC_ANYCFG_CHANYSELH2_SHIFT)
#define ADC_ANYCFG_CHANYSELH2(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH2_SHIFT)) & ADC_ANYCFG_CHANYSELH2_MASK)

#define ADC_ANYCFG_CHANYSELH1_SHIFT             (9)
#define ADC_ANYCFG_CHANYSELH1_MASK              (0x01U << ADC_ANYCFG_CHANYSELH1_SHIFT)
#define ADC_ANYCFG_CHANYSELH1(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH1_SHIFT)) & ADC_ANYCFG_CHANYSELH1_MASK)

#define ADC_ANYCFG_CHANYSELH0_SHIFT             (8)
#define ADC_ANYCFG_CHANYSELH0_MASK              (0x01U << ADC_ANYCFG_CHANYSELH0_SHIFT)
#define ADC_ANYCFG_CHANYSELH0(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH0_SHIFT)) & ADC_ANYCFG_CHANYSELH0_MASK)

#define ADC_ANYCFG_CHANYNUM_SHIFT               (0)
#define ADC_ANYCFG_CHANYNUM_MASK                (0xFU << ADC_ANYCFG_CHANYNUM_SHIFT)
#define ADC_ANYCFG_CHANYNUM(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYNUM_SHIFT)) & ADC_ANYCFG_CHANYNUM_MASK)

/*!
 * @brief ADC_ANY_CR Register Bit Definition
 */

#define ADC_ANYCR_EOCALIE_SHIFT                 (21)
#define ADC_ANYCR_EOCALIE_MASK                  (0x01U << ADC_ANYCR_EOCALIE_SHIFT)
#define ADC_ANYCR_EOCALIE(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_EOCALIE_SHIFT)) & ADC_ANYCR_EOCALIE_MASK)

#define ADC_ANYCR_ADCAL_SHIFT                   (20)
#define ADC_ANYCR_ADCAL_MASK                    (0x01U << ADC_ANYCR_ADCAL_SHIFT)
#define ADC_ANYCR_ADCAL(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_ADCAL_SHIFT)) & ADC_ANYCR_ADCAL_MASK)

#define ADC_ANYCR_JTRGEDGE_SHIFT                (16)
#define ADC_ANYCR_JTRGEDGE_MASK                 (0x3U << ADC_ANYCR_JTRGEDGE_SHIFT)
#define ADC_ANYCR_JTRGEDGE(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JTRGEDGE_SHIFT)) & ADC_ANYCR_JTRGEDGE_MASK)

#define ADC_ANYCR_JTRGSHIFT_SHIFT               (13)
#define ADC_ANYCR_JTRGSHIFT_MASK                (0x7U << ADC_ANYCR_JTRGSHIFT_SHIFT)
#define ADC_ANYCR_JTRGSHIFT(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JTRGSHIFT_SHIFT)) & ADC_ANYCR_JTRGSHIFT_MASK)

#define ADC_ANYCR_JTRGEN_SHIFT                  (7)
#define ADC_ANYCR_JTRGEN_MASK                   (0x01U << ADC_ANYCR_JTRGEN_SHIFT)
#define ADC_ANYCR_JTRGEN(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JTRGEN_SHIFT)) & ADC_ANYCR_JTRGEN_MASK)

#define ADC_ANYCR_JADST_SHIFT                   (6)
#define ADC_ANYCR_JADST_MASK                    (0x01U << ADC_ANYCR_JADST_SHIFT)
#define ADC_ANYCR_JADST(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JADST_SHIFT)) & ADC_ANYCR_JADST_MASK)

#define ADC_ANYCR_JAUTO_SHIFT                   (5)
#define ADC_ANYCR_JAUTO_MASK                    (0x01U << ADC_ANYCR_JAUTO_SHIFT)
#define ADC_ANYCR_JAUTO(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JAUTO_SHIFT)) & ADC_ANYCR_JAUTO_MASK)

#define ADC_ANYCR_JEOSIE_SHIFT                  (4)
#define ADC_ANYCR_JEOSIE_MASK                   (0x01U << ADC_ANYCR_JEOSIE_SHIFT)
#define ADC_ANYCR_JEOSIE(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JEOSIE_SHIFT)) & ADC_ANYCR_JEOSIE_MASK)

#define ADC_ANYCR_JEOCIE_SHIFT                  (3)
#define ADC_ANYCR_JEOCIE_MASK                   (0x01U << ADC_ANYCR_JEOCIE_SHIFT)
#define ADC_ANYCR_JEOCIE(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JEOCIE_SHIFT)) & ADC_ANYCR_JEOCIE_MASK)

#define ADC_ANYCR_JEOSMPIE_SHIFT                (2)
#define ADC_ANYCR_JEOSMPIE_MASK                 (0x01U << ADC_ANYCR_JEOSMPIE_SHIFT)
#define ADC_ANYCR_JEOSMPIE(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JEOSMPIE_SHIFT)) & ADC_ANYCR_JEOSMPIE_MASK)

#define ADC_ANYCR_JCEN_SHIFT                    (1)
#define ADC_ANYCR_JCEN_MASK                     (0x01U << ADC_ANYCR_JCEN_SHIFT)
#define ADC_ANYCR_JCEN(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JCEN_SHIFT)) & ADC_ANYCR_JCEN_MASK)

#define ADC_ANYCR_CHANYMDEN_SHIFT               (0)
#define ADC_ANYCR_CHANYMDEN_MASK                (0x01U << ADC_ANYCR_CHANYMDEN_SHIFT)
#define ADC_ANYCR_CHANYMDEN(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_CHANYMDEN_SHIFT)) & ADC_ANYCR_CHANYMDEN_MASK)

/*!
 * @brief ADC_ADCFG2 Register Bit Definition
 */

#define ADC_ADCFG2_TROVSM_SHIFT                  (26)
#define ADC_ADCFG2_TROVSM_MASK                   (0x01U << ADC_ADCFG2_TROVSM_SHIFT)
#define ADC_ADCFG2_TROVSM(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_TROVSM_SHIFT)) & ADC_ADCFG2_TROVSM_MASK)

