OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define CRS_CFGR_SYNCSRC_SHIFT                  (28)
#define CRS_CFGR_SYNCSRC_MASK                   (0x3U << CRS_CFGR_SYNCSRC_SHIFT)
#define CRS_CFGR_SYNCSRC(x)                     (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_SYNCSRC_SHIFT)) & CRS_CFGR_SYNCSRC_MASK)

#define CRS_CFGR_SYNCDIV_SHIFT                  (24)
#define CRS_CFGR_SYNCDIV_MASK                   (0x7U << CRS_CFGR_SYNCDIV_SHIFT)
#define CRS_CFGR_SYNCDIV(x)                     (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_SYNCDIV_SHIFT)) & CRS_CFGR_SYNCDIV_MASK)

#define CRS_CFGR_FELIM_SHIFT                    (16)
#define CRS_CFGR_FELIM_MASK                     (0xFFU << CRS_CFGR_FELIM_SHIFT)
#define CRS_CFGR_FELIM(x)                       (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_FELIM_SHIFT)) & CRS_CFGR_FELIM_MASK)

#define CRS_CFGR_RELOAD_SHIFT                   (0)
#define CRS_CFGR_RELOAD_MASK                    (0xFFFFU << CRS_CFGR_RELOAD_SHIFT)
#define CRS_CFGR_RELOAD(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_RELOAD_SHIFT)) & CRS_CFGR_RELOAD_MASK)

/*!
 * @brief CRS_LSR Register Bit Definition
 */

#define CRS_LSR_FECAP_SHIFT                     (16)
#define CRS_LSR_FECAP_MASK                      (0xFFFFU << CRS_LSR_FECAP_SHIFT)
#define CRS_LSR_FECAP(x)                        (((uint32_t)(((uint32_t)(x)) << CRS_LSR_FECAP_SHIFT)) & CRS_LSR_FECAP_MASK)

#define CRS_LSR_FEDIR_SHIFT                     (15)
#define CRS_LSR_FEDIR_MASK                      (0x01U << CRS_LSR_FEDIR_SHIFT)
#define CRS_LSR_FEDIR(x)                        (((uint32_t)(((uint32_t)(x)) << CRS_LSR_FEDIR_SHIFT)) & CRS_LSR_FEDIR_MASK)

#define CRS_LSR_TRIMOVF_SHIFT                   (10)
#define CRS_LSR_TRIMOVF_MASK                    (0x01U << CRS_LSR_TRIMOVF_SHIFT)
#define CRS_LSR_TRIMOVF(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_LSR_TRIMOVF_SHIFT)) & CRS_LSR_TRIMOVF_MASK)

#define CRS_LSR_SYNCMISS_SHIFT                  (9)
#define CRS_LSR_SYNCMISS_MASK                   (0x01U << CRS_LSR_SYNCMISS_SHIFT)
#define CRS_LSR_SYNCMISS(x)                     (((uint32_t)(((uint32_t)(x)) << CRS_LSR_SYNCMISS_SHIFT)) & CRS_LSR_SYNCMISS_MASK)

#define CRS_LSR_SYNCERR_SHIFT                   (8)
#define CRS_LSR_SYNCERR_MASK                    (0x01U << CRS_LSR_SYNCERR_SHIFT)
#define CRS_LSR_SYNCERR(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_LSR_SYNCERR_SHIFT)) & CRS_LSR_SYNCERR_MASK)

#define CRS_LSR_ESYNCF_SHIFT                    (3)
#define CRS_LSR_ESYNCF_MASK                     (0x01U << CRS_LSR_ESYNCF_SHIFT)
#define CRS_LSR_ESYNCF(x)                       (((uint32_t)(((uint32_t)(x)) << CRS_LSR_ESYNCF_SHIFT)) & CRS_LSR_ESYNCF_MASK)

#define CRS_LSR_ERRF_SHIFT                      (2)
#define CRS_LSR_ERRF_MASK                       (0x01U << CRS_LSR_ERRF_SHIFT)
#define CRS_LSR_ERRF(x)                         (((uint32_t)(((uint32_t)(x)) << CRS_LSR_ERRF_SHIFT)) & CRS_LSR_ERRF_MASK)

#define CRS_LSR_SYNCWARNF_SHIFT                 (1)
#define CRS_LSR_SYNCWARNF_MASK                  (0x01U << CRS_LSR_SYNCWARNF_SHIFT)
#define CRS_LSR_SYNCWARNF(x)                    (((uint32_t)(((uint32_t)(x)) << CRS_LSR_SYNCWARNF_SHIFT)) & CRS_LSR_SYNCWARNF_MASK)

#define CRS_LSR_SYNCOKF_SHIFT                   (0)
#define CRS_LSR_SYNCOKF_MASK                    (0x01U << CRS_LSR_SYNCOKF_SHIFT)
#define CRS_LSR_SYNCOKF(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_LSR_SYNCOKF_SHIFT)) & CRS_LSR_SYNCOKF_MASK)

/*!
 * @brief CRS_LCR Register Bit Definition
 */

#define CRS_LCR_ESYNCC_SHIFT                    (3)
#define CRS_LCR_ESYNCC_MASK                     (0x01U << CRS_LCR_ESYNCC_SHIFT)
#define CRS_LCR_ESYNCC(x)                       (((uint32_t)(((uint32_t)(x)) << CRS_LCR_ESYNCC_SHIFT)) & CRS_LCR_ESYNCC_MASK)

#define CRS_LCR_ERRC_SHIFT                      (2)
#define CRS_LCR_ERRC_MASK                       (0x01U << CRS_LCR_ERRC_SHIFT)
#define CRS_LCR_ERRC(x)                         (((uint32_t)(((uint32_t)(x)) << CRS_LCR_ERRC_SHIFT)) & CRS_LCR_ERRC_MASK)

#define CRS_LCR_SYNCWARNC_SHIFT                 (1)
#define CRS_LCR_SYNCWARNC_MASK                  (0x01U << CRS_LCR_SYNCWARNC_SHIFT)
#define CRS_LCR_SYNCWARNC(x)                    (((uint32_t)(((uint32_t)(x)) << CRS_LCR_SYNCWARNC_SHIFT)) & CRS_LCR_SYNCWARNC_MASK)

#define CRS_LCR_SYNCOKC_SHIFT                   (0)
#define CRS_LCR_SYNCOKC_MASK                    (0x01U << CRS_LCR_SYNCOKC_SHIFT)
#define CRS_LCR_SYNCOKC(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_LCR_SYNCOKC_SHIFT)) & CRS_LCR_SYNCOKC_MASK)

/*!
 * @}
 */ /* end of group CRS_Register_Masks */
/******************************************************************************
 *CRS Instance
*******************************************************************************/

#define CRS                  ((CRS_Type*)CRS_BASE)

/*!
 * @}
 */ /* end of group CRS_Peripheral_Access_Layer */




/*!
 * @addtogroup DAC_Peripheral_Access_Layer DAC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * DAC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< DAC Control Register                         offset: 0x00
    __IO uint32_t SWTRIGR;                                                        ///< DAC Software Trigger Register                offset: 0x04
    __IO uint32_t DHR12R1;                                                        ///< 12-Bit Right-Justified Data Holding Register for DAC Channel 1offset: 0x08
    __IO uint32_t DHR12L1;                                                        ///< 12-Bit Left-Justified Data Holding Register for DAC Channel 1offset: 0x0C
    __IO uint32_t DHR8R1;                                                         ///< 8-Bit Right-Justified Data Holding Register for DAC Channel 1offset: 0x10
    __IO uint32_t DHR12R2;                                                        ///< 12-Bit Right-Justified Data Holding Register for DAC Channel 2offset: 0x14
    __IO uint32_t DHR12L2;                                                        ///< 12-Bit Left-Justified Data Holding Register for DAC Channel 2offset: 0x18
    __IO uint32_t DHR8R2;                                                         ///< 8-Bit Right-Justified Data Holding Register for DAC Channel 2offset: 0x1C
    __IO uint32_t DHR12RD;                                                        ///< 12-Bit Right-Justified Data Holding Registers for Dual DACsoffset: 0x20
    __IO uint32_t DHR12LD;                                                        ///< 12-Bit Left-Justified Data Holding Registers for Dual DACsoffset: 0x24
    __IO uint32_t DHR8RD;                                                         ///< 8-Bit Right-Justified Data Holding Registers for Dual DACsoffset: 0x28
    __IO uint32_t DOR1;                                                           ///< DAC Channel 1 Data Output Register           offset: 0x2C
    __IO uint32_t DOR2;                                                           ///< DAC Channel 2 Data Output Register           offset: 0x30
} DAC_Type;

