OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define DMA_CCR_PL_SHIFT                        (12)
#define DMA_CCR_PL_MASK                         (0x3U << DMA_CCR_PL_SHIFT)
#define DMA_CCR_PL(x)                           (((uint32_t)(((uint32_t)(x)) << DMA_CCR_PL_SHIFT)) & DMA_CCR_PL_MASK)

#define DMA_CCR_MSIZE_SHIFT                     (10)
#define DMA_CCR_MSIZE_MASK                      (0x3U << DMA_CCR_MSIZE_SHIFT)
#define DMA_CCR_MSIZE(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_CCR_MSIZE_SHIFT)) & DMA_CCR_MSIZE_MASK)

#define DMA_CCR_PSIZE_SHIFT                     (8)
#define DMA_CCR_PSIZE_MASK                      (0x3U << DMA_CCR_PSIZE_SHIFT)
#define DMA_CCR_PSIZE(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_CCR_PSIZE_SHIFT)) & DMA_CCR_PSIZE_MASK)

#define DMA_CCR_MINC_SHIFT                      (7)
#define DMA_CCR_MINC_MASK                       (0x01U << DMA_CCR_MINC_SHIFT)
#define DMA_CCR_MINC(x)                         (((uint32_t)(((uint32_t)(x)) << DMA_CCR_MINC_SHIFT)) & DMA_CCR_MINC_MASK)

#define DMA_CCR_PINC_SHIFT                      (6)
#define DMA_CCR_PINC_MASK                       (0x01U << DMA_CCR_PINC_SHIFT)
#define DMA_CCR_PINC(x)                         (((uint32_t)(((uint32_t)(x)) << DMA_CCR_PINC_SHIFT)) & DMA_CCR_PINC_MASK)

#define DMA_CCR_CIRC_SHIFT                      (5)
#define DMA_CCR_CIRC_MASK                       (0x01U << DMA_CCR_CIRC_SHIFT)
#define DMA_CCR_CIRC(x)                         (((uint32_t)(((uint32_t)(x)) << DMA_CCR_CIRC_SHIFT)) & DMA_CCR_CIRC_MASK)

#define DMA_CCR_DIR_SHIFT                       (4)
#define DMA_CCR_DIR_MASK                        (0x01U << DMA_CCR_DIR_SHIFT)
#define DMA_CCR_DIR(x)                          (((uint32_t)(((uint32_t)(x)) << DMA_CCR_DIR_SHIFT)) & DMA_CCR_DIR_MASK)

#define DMA_CCR_TEIE_SHIFT                      (3)
#define DMA_CCR_TEIE_MASK                       (0x01U << DMA_CCR_TEIE_SHIFT)
#define DMA_CCR_TEIE(x)                         (((uint32_t)(((uint32_t)(x)) << DMA_CCR_TEIE_SHIFT)) & DMA_CCR_TEIE_MASK)

#define DMA_CCR_HTIE_SHIFT                      (2)
#define DMA_CCR_HTIE_MASK                       (0x01U << DMA_CCR_HTIE_SHIFT)
#define DMA_CCR_HTIE(x)                         (((uint32_t)(((uint32_t)(x)) << DMA_CCR_HTIE_SHIFT)) & DMA_CCR_HTIE_MASK)

#define DMA_CCR_TCIE_SHIFT                      (1)
#define DMA_CCR_TCIE_MASK                       (0x01U << DMA_CCR_TCIE_SHIFT)
#define DMA_CCR_TCIE(x)                         (((uint32_t)(((uint32_t)(x)) << DMA_CCR_TCIE_SHIFT)) & DMA_CCR_TCIE_MASK)

#define DMA_CCR_EN_SHIFT                        (0)
#define DMA_CCR_EN_MASK                         (0x01U << DMA_CCR_EN_SHIFT)
#define DMA_CCR_EN(x)                           (((uint32_t)(((uint32_t)(x)) << DMA_CCR_EN_SHIFT)) & DMA_CCR_EN_MASK)

/*!
 * @brief DMA_CNDTR Register Bit Definition
 */

#define DMA_CNDTR_NDT_SHIFT                     (0)
#define DMA_CNDTR_NDT_MASK                      (0xFFFFU << DMA_CNDTR_NDT_SHIFT)
#define DMA_CNDTR_NDT(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_CNDTR_NDT_SHIFT)) & DMA_CNDTR_NDT_MASK)

/*!
 * @brief DMA_CPAR Register Bit Definition
 */

#define DMA_CPAR_PA_SHIFT                       (0)
#define DMA_CPAR_PA_MASK                        (0xFFFFFFFFU << DMA_CPAR_PA_SHIFT)
#define DMA_CPAR_PA(x)                          (((uint32_t)(((uint32_t)(x)) << DMA_CPAR_PA_SHIFT)) & DMA_CPAR_PA_MASK)

/*!
 * @brief DMA_CMAR Register Bit Definition
 */

#define DMA_CMAR_MA_SHIFT                       (0)
#define DMA_CMAR_MA_MASK                        (0xFFFFFFFFU << DMA_CMAR_MA_SHIFT)
#define DMA_CMAR_MA(x)                          (((uint32_t)(((uint32_t)(x)) << DMA_CMAR_MA_SHIFT)) & DMA_CMAR_MA_MASK)


/*!
 * @}
 */ /* end of group DMA_Register_Masks */
/******************************************************************************
 *DMA Instance
*******************************************************************************/

#define DMA1                  ((DMA_Type*)DMA1_BASE)
#define DMA2                  ((DMA_Type*)DMA2_BASE)

/*!
 * @}
 */ /* end of group DMA_Peripheral_Access_Layer */

/*!
 * @addtogroup ENET_Peripheral_Access_Layer ENET Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * ENET Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t MACCR;                                                          ///< MAC configuration register                   offset: 0x0000
    __IO uint32_t MACAFR;                                                         ///< MAC address filter control register          offset: 0x0004
    __IO uint32_t MACHTHR;                                                        ///< MAC HASH table high register                 offset: 0x0008
    __IO uint32_t MACHTLR;                                                        ///< MAC HASH table low register                  offset: 0x000C
    __IO uint32_t MACSMIAR;                                                       ///< SMI address register                         offset: 0x0010
    __IO uint32_t MACSMIDR;                                                       ///< SMI data register                            offset: 0x0014
    __IO uint32_t MACFCR;                                                         ///< MAC flow control register                    offset: 0x0018
    __IO uint32_t MACVLTRR;                                                        ///< MAC VLAN Tag Register                       offset: 0x001C
    __IO uint32_t Reserved7[1];                                                  ///< Reserved
    __IO uint32_t MACSR;                                                          ///< MAC status register                          offset: 0x0024
    __IO uint32_t PMTRWFR;                                                        ///< MAC Remote Wakeup Frame Filter Register      offset: 0x0028
    __IO uint32_t PMTCR;                                                          ///< MAC PMT Control Register                     offset: 0x002C
    __IO uint32_t Reserved8[2];                                                  ///< Reserved
    __IO uint32_t MACISR;                                                         ///< MAC Interrupt Status Register               offset: 0x0038
    __IO uint32_t MACIMR;                                                         ///< MAC Interrupt Mask Register                 offset: 0x003C
    struct{
          __IO uint32_t MACAHR;                                                   ///< MAC filter address high register            offset: 0x0040
          __IO uint32_t MACALR;                                                   ///< MAC filter address low register             offset: 0x0044
        }MACAH_L[6];                                                              ///< 0~5 group
    __IO uint32_t MMCCR;                                                          ///< MMC Control Register                         offset: 0x0100
    __IO uint32_t MMCRSR;                                                         ///< MMC Receive Status Register                  offset: 0x0104
    __IO uint32_t MMCTSR;                                                         ///< MMC Transmit Status Register                 offset: 0x0108
    __IO uint32_t MMCRIR;                                                         ///< MMC receive interrupt register               offset: 0x010C
    __IO uint32_t MMCTIR;                                                         ///< MMC Transmit Interrupt Register              offset: 0x0110
	__IO uint32_t Reserved9[14];                                                   ///< Reserved
    __IO uint32_t MMCTGSCR;                                                       ///< MMC sends a good frame statistics register after a single collision error offset: 0x014C
    __IO uint32_t MMCTGMCR;                                                       ///< MMC sends good frame statistics register after multiple collision errors  offset: 0x0150
	__IO uint32_t Reserved10[5];                                                   ///< Reserved
    __IO uint32_t MMCTGR;                                                         ///< MMC sends good frame pass statistics register            offset: 0x0168
	__IO uint32_t Reserved11[10];                                                   ///< Reserved
    __IO uint32_t MMCRCRCER;                                                      ///< MMC CRC Error Received Frame Statistics Register         offset: 0x0194
    __IO uint32_t MMCRALIER;                                                      ///< MMC Alignment Error Received Frame Statistics Register   offset: 0x0198
	__IO uint32_t Reserved12[10];                                                   ///< Reserved
    __IO uint32_t MMCRUGR;                                                        ///< MMC Receive Unicast Good Frame Statistics Register       offset: 0x01C4
	__IO uint32_t Reserved13[239];                                                   ///< Reserved
    __IO uint32_t MACVLTTR;                                                       ///< MAC VLAN TAG send register                   offset: 0x0584
    __IO uint32_t MACVLHTR;                                                       ///< MAC VLAN HASH Table Register                 offset: 0x0588
	__IO uint32_t Reserved14[93];                                                   ///< Reserved
    __IO uint32_t PTPCR;                                                          ///< PTP Control Register                         offset: 0x0700
    __IO uint32_t PTPNSAR;                                                        ///< PTP subsecond adder register                 offset: 0x0704
    __IO uint32_t PTPSBSR;                                                        ///< PTP System Second Register                   offset: 0x0708
    __IO uint32_t PTPSNSR;                                                        ///< PTP System Subsecond Register                offset: 0x070C
    __IO uint32_t PTPUBSR;                                                        ///< PTP Update Seconds Register                  offset: 0x0710
    __IO uint32_t PTPUNSR;                                                        ///< PTP update subsecond register                offset: 0x0714
    __IO uint32_t PTPBSAR;                                                        ///< PTP Basic Addend Register                    offset: 0x0718
    __IO uint32_t PTPTBSR0;                                                       ///< PTP Target Seconds Register 0                offset: 0x071C
    __IO uint32_t PTPTNSR0;                                                       ///< PTP Target Subsecond Register 0              offset: 0x0720
	__IO uint32_t Reserved15[1];                                                   ///< Reserved
    __IO uint32_t PTPSR;                                                          ///< PTP Status Register                          offset: 0x0728
    __IO uint32_t PTPPPSR;                                                        ///< PTP PPS Control Register                     offset: 0x072C
	__IO uint32_t Reserved16[20];                                                 ///< Reserved
    __IO uint32_t PTPTBSR1;                                                       ///< PTP Target Seconds Register 1                offset: 0x0780
    __IO uint32_t PTPTNSR1;                                                       ///< PTP Target Subsecond Register 1              offset: 0x0784
	__IO uint32_t Reserved17[542];                                                   ///< Reserved
    __IO uint32_t DMABSR;                                                         ///< DMA bus control register                     offset: 0x1000
    __IO uint32_t DMATXPDR;                                                       ///< DMA transmit polling register                offset: 0x1004
    __IO uint32_t DMARXPDR;                                                       ///< DMA Receive Polling Register                 offset: 0x1008
    __IO uint32_t DMARXDSAR;                                                      ///< DMA Receive Descriptor Address Register      offset: 0x100C
    __IO uint32_t DMATXDSAR;                                                      ///< DMA transmit descriptor address register     offset: 0x1010
    __IO uint32_t DMASR;                                                          ///< DMA status register                          offset: 0x1014
    __IO uint32_t DMAMDR;                                                         ///< DMA work mode register                       offset: 0x1018
    __IO uint32_t DMAIR;                                                          ///< DMA Interrupt Register                       offset: 0x101C
    __IO uint32_t DMAFLCR;                                                        ///< DMA Frame Loss Statistics Register           offset: 0x1020
    __IO uint32_t DMAWDTR;                                                        ///< DMA Watchdog Timing Register                 offset: 0x1024
	__IO uint32_t Reserved18[8];                                                   ///< Reserved
    __IO uint32_t DMACURTXDSAR;                                                   ///< DMA current transmit descriptor address registeroffset: 0x1048
    __IO uint32_t DMACURRXDSAR;                                                   ///< DMA current receive descriptor address registeroffset: 0x104C
    __IO uint32_t DMACURTXBFAR;                                                   ///< DMA current send buffer address register     offset: 0x1050
    __IO uint32_t DMACURRXBFAR;                                                   ///< DMA current receive buffer address register  offset: 0x1054

} ENET_Type;

