OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
/*******************************************************************************
 * ENET Type
 ******************************************************************************/

/*!
 * @addtogroup ENET_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief ENET_MACSMIAR Register Bit Definition
 */

#define ENET_MACSMIAR_SMIADD_SHIFT              (11)
#define ENET_MACSMIAR_SMIADD_MASK               (0x1FU << ENET_MACSMIAR_SMIADD_SHIFT)
#define ENET_MACSMIAR_SMIADD(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MACSMIAR_SMIADD_SHIFT)) & ENET_MACSMIAR_SMIADD_MASK)

#define ENET_MACSMIAR_SMIREG_SHIFT              (6)
#define ENET_MACSMIAR_SMIREG_MASK               (0x1FU << ENET_MACSMIAR_SMIREG_SHIFT)
#define ENET_MACSMIAR_SMIREG(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MACSMIAR_SMIREG_SHIFT)) & ENET_MACSMIAR_SMIREG_MASK)

#define ENET_MACSMIAR_SMICLK_SHIFT              (2)
#define ENET_MACSMIAR_SMICLK_MASK               (0xFU << ENET_MACSMIAR_SMICLK_SHIFT)
#define ENET_MACSMIAR_SMICLK(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MACSMIAR_SMICLK_SHIFT)) & ENET_MACSMIAR_SMICLK_MASK)

#define ENET_MACSMIAR_SMIWR_SHIFT               (1)
#define ENET_MACSMIAR_SMIWR_MASK                (0x01U << ENET_MACSMIAR_SMIWR_SHIFT)
#define ENET_MACSMIAR_SMIWR(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACSMIAR_SMIWR_SHIFT)) & ENET_MACSMIAR_SMIWR_MASK)

#define ENET_MACSMIAR_SMIBY_SHIFT               (0)
#define ENET_MACSMIAR_SMIBY_MASK                (0x01U << ENET_MACSMIAR_SMIBY_SHIFT)
#define ENET_MACSMIAR_SMIBY(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACSMIAR_SMIBY_SHIFT)) & ENET_MACSMIAR_SMIBY_MASK)

/*!
 * @brief ENET_MACSMIDR Register Bit Definition
 */

#define ENET_MACSMIDR_SMIDATA_SHIFT             (0)
#define ENET_MACSMIDR_SMIDATA_MASK              (0xFFFFU << ENET_MACSMIDR_SMIDATA_SHIFT)
#define ENET_MACSMIDR_SMIDATA(x)                (((uint32_t)(((uint32_t)(x)) << ENET_MACSMIDR_SMIDATA_SHIFT)) & ENET_MACSMIDR_SMIDATA_MASK)

/*!
 * @brief ENET_MACCR Register Bit Definition
 */

#define ENET_MACCR_SAIRC_SHIFT                  (28)
#define ENET_MACCR_SAIRC_MASK                   (0xFU << ENET_MACCR_SAIRC_SHIFT)
#define ENET_MACCR_SAIRC(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_SAIRC_SHIFT)) & ENET_MACCR_SAIRC_MASK)

#define ENET_MACCR_CST_SHIFT                    (25)
#define ENET_MACCR_CST_MASK                     (0x01U << ENET_MACCR_CST_SHIFT)
#define ENET_MACCR_CST(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_CST_SHIFT)) & ENET_MACCR_CST_MASK)

#define ENET_MACCR_WTD_SHIFT                    (23)
#define ENET_MACCR_WTD_MASK                     (0x01U << ENET_MACCR_WTD_SHIFT)
#define ENET_MACCR_WTD(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_WTD_SHIFT)) & ENET_MACCR_WTD_MASK)

#define ENET_MACCR_JAB_SHIFT                    (22)
#define ENET_MACCR_JAB_MASK                     (0x01U << ENET_MACCR_JAB_SHIFT)
#define ENET_MACCR_JAB(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_JAB_SHIFT)) & ENET_MACCR_JAB_MASK)

#define ENET_MACCR_IFG_SHIFT                    (17)
#define ENET_MACCR_IFG_MASK                     (0x7U << ENET_MACCR_IFG_SHIFT)
#define ENET_MACCR_IFG(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_IFG_SHIFT)) & ENET_MACCR_IFG_MASK)

#define ENET_MACCR_MCRS_SHIFT                   (16)
#define ENET_MACCR_MCRS_MASK                    (0x01U << ENET_MACCR_MCRS_SHIFT)
#define ENET_MACCR_MCRS(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_MCRS_SHIFT)) & ENET_MACCR_MCRS_MASK)

#define ENET_MACCR_RDIS_SHIFT                   (13)
#define ENET_MACCR_RDIS_MASK                    (0x01U << ENET_MACCR_RDIS_SHIFT)
#define ENET_MACCR_RDIS(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_RDIS_SHIFT)) & ENET_MACCR_RDIS_MASK)

#define ENET_MACCR_LM_SHIFT                     (12)
#define ENET_MACCR_LM_MASK                      (0x01U << ENET_MACCR_LM_SHIFT)
#define ENET_MACCR_LM(x)                        (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_LM_SHIFT)) & ENET_MACCR_LM_MASK)

#define ENET_MACCR_DM_SHIFT                     (11)
#define ENET_MACCR_DM_MASK                      (0x01U << ENET_MACCR_DM_SHIFT)
#define ENET_MACCR_DM(x)                        (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_DM_SHIFT)) & ENET_MACCR_DM_MASK)

#define ENET_MACCR_IPCO_SHIFT                   (10)
#define ENET_MACCR_IPCO_MASK                    (0x01U << ENET_MACCR_IPCO_SHIFT)
#define ENET_MACCR_IPCO(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_IPCO_SHIFT)) & ENET_MACCR_IPCO_MASK)

#define ENET_MACCR_RETY_SHIFT                   (9)
#define ENET_MACCR_RETY_MASK                    (0x01U << ENET_MACCR_RETY_SHIFT)
#define ENET_MACCR_RETY(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_RETY_SHIFT)) & ENET_MACCR_RETY_MASK)

#define ENET_MACCR_APCS_SHIFT                   (7)
#define ENET_MACCR_APCS_MASK                    (0x01U << ENET_MACCR_APCS_SHIFT)
#define ENET_MACCR_APCS(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_APCS_SHIFT)) & ENET_MACCR_APCS_MASK)

#define ENET_MACCR_BL_SHIFT                     (5)
#define ENET_MACCR_BL_MASK                      (0x3U << ENET_MACCR_BL_SHIFT)
#define ENET_MACCR_BL(x)                        (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_BL_SHIFT)) & ENET_MACCR_BL_MASK)

#define ENET_MACCR_DLYC_SHIFT                   (4)
#define ENET_MACCR_DLYC_MASK                    (0x01U << ENET_MACCR_DLYC_SHIFT)
#define ENET_MACCR_DLYC(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_DLYC_SHIFT)) & ENET_MACCR_DLYC_MASK)

#define ENET_MACCR_TE_SHIFT                     (3)
#define ENET_MACCR_TE_MASK                      (0x01U << ENET_MACCR_TE_SHIFT)
#define ENET_MACCR_TE(x)                        (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_TE_SHIFT)) & ENET_MACCR_TE_MASK)

#define ENET_MACCR_RE_SHIFT                     (2)
#define ENET_MACCR_RE_MASK                      (0x01U << ENET_MACCR_RE_SHIFT)
#define ENET_MACCR_RE(x)                        (((uint32_t)(((uint32_t)(x)) << ENET_MACCR_RE_SHIFT)) & ENET_MACCR_RE_MASK)

/*!
 * @brief ENET_MACSR Register Bit Definition
 */

#define ENET_MACSR_TXFF_SHIFT                   (25)
#define ENET_MACSR_TXFF_MASK                    (0x01U << ENET_MACSR_TXFF_SHIFT)
#define ENET_MACSR_TXFF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_TXFF_SHIFT)) & ENET_MACSR_TXFF_MASK)

#define ENET_MACSR_TXFNE_SHIFT                  (24)
#define ENET_MACSR_TXFNE_MASK                   (0x01U << ENET_MACSR_TXFNE_SHIFT)
#define ENET_MACSR_TXFNE(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_TXFNE_SHIFT)) & ENET_MACSR_TXFNE_MASK)

#define ENET_MACSR_TXFWA_SHIFT                  (22)
#define ENET_MACSR_TXFWA_MASK                   (0x01U << ENET_MACSR_TXFWA_SHIFT)
#define ENET_MACSR_TXFWA(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_TXFWA_SHIFT)) & ENET_MACSR_TXFWA_MASK)

#define ENET_MACSR_TXFRS_SHIFT                  (20)
#define ENET_MACSR_TXFRS_MASK                   (0x3U << ENET_MACSR_TXFRS_SHIFT)
#define ENET_MACSR_TXFRS(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_TXFRS_SHIFT)) & ENET_MACSR_TXFRS_MASK)

