OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ENET_MACSR_MTP_SHIFT                    (19)
#define ENET_MACSR_MTP_MASK                     (0x01U << ENET_MACSR_MTP_SHIFT)
#define ENET_MACSR_MTP(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_MTP_SHIFT)) & ENET_MACSR_MTP_MASK)

#define ENET_MACSR_MTS_SHIFT                    (17)
#define ENET_MACSR_MTS_MASK                     (0x3U << ENET_MACSR_MTS_SHIFT)
#define ENET_MACSR_MTS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_MTS_SHIFT)) & ENET_MACSR_MTS_MASK)

#define ENET_MACSR_MTE_SHIFT                    (16)
#define ENET_MACSR_MTE_MASK                     (0x01U << ENET_MACSR_MTE_SHIFT)
#define ENET_MACSR_MTE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_MTE_SHIFT)) & ENET_MACSR_MTE_MASK)

#define ENET_MACSR_RXFL_SHIFT                   (8)
#define ENET_MACSR_RXFL_MASK                    (0x3U << ENET_MACSR_RXFL_SHIFT)
#define ENET_MACSR_RXFL(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_RXFL_SHIFT)) & ENET_MACSR_RXFL_MASK)

#define ENET_MACSR_RXFRS_SHIFT                  (5)
#define ENET_MACSR_RXFRS_MASK                   (0x3U << ENET_MACSR_RXFRS_SHIFT)
#define ENET_MACSR_RXFRS(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_RXFRS_SHIFT)) & ENET_MACSR_RXFRS_MASK)

#define ENET_MACSR_RXFWA_SHIFT                  (4)
#define ENET_MACSR_RXFWA_MASK                   (0x01U << ENET_MACSR_RXFWA_SHIFT)
#define ENET_MACSR_RXFWA(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_RXFWA_SHIFT)) & ENET_MACSR_RXFWA_MASK)

#define ENET_MACSR_MRS_SHIFT                    (1)
#define ENET_MACSR_MRS_MASK                     (0x3U << ENET_MACSR_MRS_SHIFT)
#define ENET_MACSR_MRS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_MRS_SHIFT)) & ENET_MACSR_MRS_MASK)

#define ENET_MACSR_MRE_SHIFT                    (0)
#define ENET_MACSR_MRE_MASK                     (0x01U << ENET_MACSR_MRE_SHIFT)
#define ENET_MACSR_MRE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACSR_MRE_SHIFT)) & ENET_MACSR_MRE_MASK)

/*!
 * @brief ENET_MACFCR Register Bit Definition
 */

#define ENET_MACFCR_PSET_SHIFT                  (16)
#define ENET_MACFCR_PSET_MASK                   (0xFFFFU << ENET_MACFCR_PSET_SHIFT)
#define ENET_MACFCR_PSET(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACFCR_PSET_SHIFT)) & ENET_MACFCR_PSET_MASK)

#define ENET_MACFCR_DZQP_SHIFT                  (7)
#define ENET_MACFCR_DZQP_MASK                   (0x01U << ENET_MACFCR_DZQP_SHIFT)
#define ENET_MACFCR_DZQP(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACFCR_DZQP_SHIFT)) & ENET_MACFCR_DZQP_MASK)

#define ENET_MACFCR_PLT_SHIFT                   (4)
#define ENET_MACFCR_PLT_MASK                    (0x3U << ENET_MACFCR_PLT_SHIFT)
#define ENET_MACFCR_PLT(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACFCR_PLT_SHIFT)) & ENET_MACFCR_PLT_MASK)

#define ENET_MACFCR_UPF_SHIFT                   (3)
#define ENET_MACFCR_UPF_MASK                    (0x01U << ENET_MACFCR_UPF_SHIFT)
#define ENET_MACFCR_UPF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACFCR_UPF_SHIFT)) & ENET_MACFCR_UPF_MASK)

#define ENET_MACFCR_FRE_SHIFT                   (2)
#define ENET_MACFCR_FRE_MASK                    (0x01U << ENET_MACFCR_FRE_SHIFT)
#define ENET_MACFCR_FRE(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACFCR_FRE_SHIFT)) & ENET_MACFCR_FRE_MASK)

#define ENET_MACFCR_FTE_SHIFT                   (1)
#define ENET_MACFCR_FTE_MASK                    (0x01U << ENET_MACFCR_FTE_SHIFT)
#define ENET_MACFCR_FTE(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACFCR_FTE_SHIFT)) & ENET_MACFCR_FTE_MASK)

#define ENET_MACFCR_FCBBPA_SHIFT                (0)
#define ENET_MACFCR_FCBBPA_MASK                 (0x01U << ENET_MACFCR_FCBBPA_SHIFT)
#define ENET_MACFCR_FCBBPA(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MACFCR_FCBBPA_SHIFT)) & ENET_MACFCR_FCBBPA_MASK)

/*!
 * @brief ENET_MACISR Register Bit Definition
 */

#define ENET_MACISR_PTPIS_SHIFT                 (9)
#define ENET_MACISR_PTPIS_MASK                  (0x01U << ENET_MACISR_PTPIS_SHIFT)
#define ENET_MACISR_PTPIS(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MACISR_PTPIS_SHIFT)) & ENET_MACISR_PTPIS_MASK)

#define ENET_MACISR_MMCTXIS_SHIFT               (6)
#define ENET_MACISR_MMCTXIS_MASK                (0x01U << ENET_MACISR_MMCTXIS_SHIFT)
#define ENET_MACISR_MMCTXIS(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACISR_MMCTXIS_SHIFT)) & ENET_MACISR_MMCTXIS_MASK)

#define ENET_MACISR_MMCRXIS_SHIFT               (5)
#define ENET_MACISR_MMCRXIS_MASK                (0x01U << ENET_MACISR_MMCRXIS_SHIFT)
#define ENET_MACISR_MMCRXIS(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACISR_MMCRXIS_SHIFT)) & ENET_MACISR_MMCRXIS_MASK)

#define ENET_MACISR_MMCIS_SHIFT                 (4)
#define ENET_MACISR_MMCIS_MASK                  (0x01U << ENET_MACISR_MMCIS_SHIFT)
#define ENET_MACISR_MMCIS(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MACISR_MMCIS_SHIFT)) & ENET_MACISR_MMCIS_MASK)

#define ENET_MACISR_PMTIS_SHIFT                 (3)
#define ENET_MACISR_PMTIS_MASK                  (0x01U << ENET_MACISR_PMTIS_SHIFT)
#define ENET_MACISR_PMTIS(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MACISR_PMTIS_SHIFT)) & ENET_MACISR_PMTIS_MASK)

/*!
 * @brief ENET_MACIMR Register Bit Definition
 */

#define ENET_MACIMR_PTPIM_SHIFT                 (9)
#define ENET_MACIMR_PTPIM_MASK                  (0x01U << ENET_MACIMR_PTPIM_SHIFT)
#define ENET_MACIMR_PTPIM(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MACIMR_PTPIM_SHIFT)) & ENET_MACIMR_PTPIM_MASK)

#define ENET_MACIMR_PMTIM_SHIFT                 (3)
#define ENET_MACIMR_PMTIM_MASK                  (0x01U << ENET_MACIMR_PMTIM_SHIFT)
#define ENET_MACIMR_PMTIM(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MACIMR_PMTIM_SHIFT)) & ENET_MACIMR_PMTIM_MASK)

/*!
 * @brief ENET_MACAFR Register Bit Definition
 */

#define ENET_MACAFR_RALL_SHIFT                  (31)
#define ENET_MACAFR_RALL_MASK                   (0x01U << ENET_MACAFR_RALL_SHIFT)
#define ENET_MACAFR_RALL(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_RALL_SHIFT)) & ENET_MACAFR_RALL_MASK)

