OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ENET_MACAFR_DNTU_SHIFT                  (21)
#define ENET_MACAFR_DNTU_MASK                   (0x01U << ENET_MACAFR_DNTU_SHIFT)
#define ENET_MACAFR_DNTU(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_DNTU_SHIFT)) & ENET_MACAFR_DNTU_MASK)

#define ENET_MACAFR_VLTF_SHIFT                  (16)
#define ENET_MACAFR_VLTF_MASK                   (0x01U << ENET_MACAFR_VLTF_SHIFT)
#define ENET_MACAFR_VLTF(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_VLTF_SHIFT)) & ENET_MACAFR_VLTF_MASK)

#define ENET_MACAFR_HPF_SHIFT                   (10)
#define ENET_MACAFR_HPF_MASK                    (0x01U << ENET_MACAFR_HPF_SHIFT)
#define ENET_MACAFR_HPF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_HPF_SHIFT)) & ENET_MACAFR_HPF_MASK)

#define ENET_MACAFR_SAF_SHIFT                   (9)
#define ENET_MACAFR_SAF_MASK                    (0x01U << ENET_MACAFR_SAF_SHIFT)
#define ENET_MACAFR_SAF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_SAF_SHIFT)) & ENET_MACAFR_SAF_MASK)

#define ENET_MACAFR_SAIF_SHIFT                  (8)
#define ENET_MACAFR_SAIF_MASK                   (0x01U << ENET_MACAFR_SAIF_SHIFT)
#define ENET_MACAFR_SAIF(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_SAIF_SHIFT)) & ENET_MACAFR_SAIF_MASK)

#define ENET_MACAFR_PCF_SHIFT                   (6)
#define ENET_MACAFR_PCF_MASK                    (0x3U << ENET_MACAFR_PCF_SHIFT)
#define ENET_MACAFR_PCF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_PCF_SHIFT)) & ENET_MACAFR_PCF_MASK)

#define ENET_MACAFR_BCF_SHIFT                   (5)
#define ENET_MACAFR_BCF_MASK                    (0x01U << ENET_MACAFR_BCF_SHIFT)
#define ENET_MACAFR_BCF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_BCF_SHIFT)) & ENET_MACAFR_BCF_MASK)

#define ENET_MACAFR_MCF_SHIFT                   (4)
#define ENET_MACAFR_MCF_MASK                    (0x01U << ENET_MACAFR_MCF_SHIFT)
#define ENET_MACAFR_MCF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_MCF_SHIFT)) & ENET_MACAFR_MCF_MASK)

#define ENET_MACAFR_DAIF_SHIFT                  (3)
#define ENET_MACAFR_DAIF_MASK                   (0x01U << ENET_MACAFR_DAIF_SHIFT)
#define ENET_MACAFR_DAIF(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_DAIF_SHIFT)) & ENET_MACAFR_DAIF_MASK)

#define ENET_MACAFR_HM_SHIFT                    (2)
#define ENET_MACAFR_HM_MASK                     (0x01U << ENET_MACAFR_HM_SHIFT)
#define ENET_MACAFR_HM(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_HM_SHIFT)) & ENET_MACAFR_HM_MASK)

#define ENET_MACAFR_HU_SHIFT                    (1)
#define ENET_MACAFR_HU_MASK                     (0x01U << ENET_MACAFR_HU_SHIFT)
#define ENET_MACAFR_HU(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_HU_SHIFT)) & ENET_MACAFR_HU_MASK)

#define ENET_MACAFR_PM_SHIFT                    (0)
#define ENET_MACAFR_PM_MASK                     (0x01U << ENET_MACAFR_PM_SHIFT)
#define ENET_MACAFR_PM(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_MACAFR_PM_SHIFT)) & ENET_MACAFR_PM_MASK)

/*!
 * @brief ENET_MACAHR Register Bit Definition
 */

#define ENET_MACAHR_ADDE_SHIFT                  (31)
#define ENET_MACAHR_ADDE_MASK                   (0x01U << ENET_MACAHR_ADDE_SHIFT)
#define ENET_MACAHR_ADDE(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACAHR_ADDE_SHIFT)) & ENET_MACAHR_ADDE_MASK)

#define ENET_MACAHR_SELE_SHIFT                  (30)
#define ENET_MACAHR_SELE_MASK                   (0x01U << ENET_MACAHR_SELE_SHIFT)
#define ENET_MACAHR_SELE(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MACAHR_SELE_SHIFT)) & ENET_MACAHR_SELE_MASK)

#define ENET_MACAHR_MBYTEC_SHIFT                (24)
#define ENET_MACAHR_MBYTEC_MASK                 (0x3FU << ENET_MACAHR_MBYTEC_SHIFT)
#define ENET_MACAHR_MBYTEC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MACAHR_MBYTEC_SHIFT)) & ENET_MACAHR_MBYTEC_MASK)

#define ENET_MACAHR_MACADDH_SHIFT               (0)
#define ENET_MACAHR_MACADDH_MASK                (0xFFFFU << ENET_MACAHR_MACADDH_SHIFT)
#define ENET_MACAHR_MACADDH(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACAHR_MACADDH_SHIFT)) & ENET_MACAHR_MACADDH_MASK)

/*!
 * @brief ENET_MACALR0 Register Bit Definition
 */

#define ENET_MACALR0_MACADDL_SHIFT              (0)
#define ENET_MACALR0_MACADDL_MASK               (0xFFFFFFFFU << ENET_MACALR0_MACADDL_SHIFT)
#define ENET_MACALR0_MACADDL(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MACALR0_MACADDL_SHIFT)) & ENET_MACALR0_MACADDL_MASK)

/*!
 * @brief ENET_MACHTHR Register Bit Definition
 */

#define ENET_MACHTHR_MACHTABH_SHIFT             (0)
#define ENET_MACHTHR_MACHTABH_MASK              (0xFFFFFFFFU << ENET_MACHTHR_MACHTABH_SHIFT)
#define ENET_MACHTHR_MACHTABH(x)                (((uint32_t)(((uint32_t)(x)) << ENET_MACHTHR_MACHTABH_SHIFT)) & ENET_MACHTHR_MACHTABH_MASK)

/*!
 * @brief ENET_MACHTLR Register Bit Definition
 */

#define ENET_MACHTLR_MACHTABL_SHIFT             (0)
#define ENET_MACHTLR_MACHTABL_MASK              (0xFFFFFFFFU << ENET_MACHTLR_MACHTABL_SHIFT)
#define ENET_MACHTLR_MACHTABL(x)                (((uint32_t)(((uint32_t)(x)) << ENET_MACHTLR_MACHTABL_SHIFT)) & ENET_MACHTLR_MACHTABL_MASK)

/*!
 * @brief ENET_MACVLTTR Register Bit Definition
 */

#define ENET_MACVLTTR_VLANS_SHIFT               (18)
#define ENET_MACVLTTR_VLANS_MASK                (0x01U << ENET_MACVLTTR_VLANS_SHIFT)
#define ENET_MACVLTTR_VLANS(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACVLTTR_VLANS_SHIFT)) & ENET_MACVLTTR_VLANS_MASK)

#define ENET_MACVLTTR_VLANC_SHIFT               (16)
#define ENET_MACVLTTR_VLANC_MASK                (0x3U << ENET_MACVLTTR_VLANC_SHIFT)
#define ENET_MACVLTTR_VLANC(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACVLTTR_VLANC_SHIFT)) & ENET_MACVLTTR_VLANC_MASK)

#define ENET_MACVLTTR_VLANV_SHIFT               (0)
#define ENET_MACVLTTR_VLANV_MASK                (0xFFFFU << ENET_MACVLTTR_VLANV_SHIFT)
#define ENET_MACVLTTR_VLANV(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACVLTTR_VLANV_SHIFT)) & ENET_MACVLTTR_VLANV_MASK)

/*!
 * @brief ENET_MACVLTRR Register Bit Definition
 */

#define ENET_MACVLTRR_VTHM_SHIFT                (19)
#define ENET_MACVLTRR_VTHM_MASK                 (0x01U << ENET_MACVLTRR_VTHM_SHIFT)
#define ENET_MACVLTRR_VTHM(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MACVLTRR_VTHM_SHIFT)) & ENET_MACVLTRR_VTHM_MASK)

#define ENET_MACVLTRR_VTIM_SHIFT                (17)
#define ENET_MACVLTRR_VTIM_MASK                 (0x01U << ENET_MACVLTRR_VTIM_SHIFT)
#define ENET_MACVLTRR_VTIM(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MACVLTRR_VTIM_SHIFT)) & ENET_MACVLTRR_VTIM_MASK)

