OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ENET_MACVLTRR_VTSEL_SHIFT               (16)
#define ENET_MACVLTRR_VTSEL_MASK                (0x01U << ENET_MACVLTRR_VTSEL_SHIFT)
#define ENET_MACVLTRR_VTSEL(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACVLTRR_VTSEL_SHIFT)) & ENET_MACVLTRR_VTSEL_MASK)

#define ENET_MACVLTRR_VLFLT_SHIFT               (0)
#define ENET_MACVLTRR_VLFLT_MASK                (0xFFFFU << ENET_MACVLTRR_VLFLT_SHIFT)
#define ENET_MACVLTRR_VLFLT(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MACVLTRR_VLFLT_SHIFT)) & ENET_MACVLTRR_VLFLT_MASK)

/*!
 * @brief ENET_MACVLHTR Register Bit Definition
 */

#define ENET_MACVLHTR_VLHTAB_SHIFT              (0)
#define ENET_MACVLHTR_VLHTAB_MASK               (0xFFFFU << ENET_MACVLHTR_VLHTAB_SHIFT)
#define ENET_MACVLHTR_VLHTAB(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MACVLHTR_VLHTAB_SHIFT)) & ENET_MACVLHTR_VLHTAB_MASK)

/*!
 * @brief ENET_DMAMDR Register Bit Definition
 */

#define ENET_DMAMDR_DTCOE_SHIFT                 (26)
#define ENET_DMAMDR_DTCOE_MASK                  (0x01U << ENET_DMAMDR_DTCOE_SHIFT)
#define ENET_DMAMDR_DTCOE(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_DTCOE_SHIFT)) & ENET_DMAMDR_DTCOE_MASK)

#define ENET_DMAMDR_RSF_SHIFT                   (25)
#define ENET_DMAMDR_RSF_MASK                    (0x01U << ENET_DMAMDR_RSF_SHIFT)
#define ENET_DMAMDR_RSF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_RSF_SHIFT)) & ENET_DMAMDR_RSF_MASK)

#define ENET_DMAMDR_DFRF_SHIFT                  (24)
#define ENET_DMAMDR_DFRF_MASK                   (0x01U << ENET_DMAMDR_DFRF_SHIFT)
#define ENET_DMAMDR_DFRF(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_DFRF_SHIFT)) & ENET_DMAMDR_DFRF_MASK)

#define ENET_DMAMDR_TSF_SHIFT                   (21)
#define ENET_DMAMDR_TSF_MASK                    (0x01U << ENET_DMAMDR_TSF_SHIFT)
#define ENET_DMAMDR_TSF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_TSF_SHIFT)) & ENET_DMAMDR_TSF_MASK)

#define ENET_DMAMDR_FTF_SHIFT                   (20)
#define ENET_DMAMDR_FTF_MASK                    (0x01U << ENET_DMAMDR_FTF_SHIFT)
#define ENET_DMAMDR_FTF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_FTF_SHIFT)) & ENET_DMAMDR_FTF_MASK)

#define ENET_DMAMDR_TTC_SHIFT                   (14)
#define ENET_DMAMDR_TTC_MASK                    (0x7U << ENET_DMAMDR_TTC_SHIFT)
#define ENET_DMAMDR_TTC(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_TTC_SHIFT)) & ENET_DMAMDR_TTC_MASK)

#define ENET_DMAMDR_STT_SHIFT                   (13)
#define ENET_DMAMDR_STT_MASK                    (0x01U << ENET_DMAMDR_STT_SHIFT)
#define ENET_DMAMDR_STT(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_STT_SHIFT)) & ENET_DMAMDR_STT_MASK)

#define ENET_DMAMDR_FEF_SHIFT                   (7)
#define ENET_DMAMDR_FEF_MASK                    (0x01U << ENET_DMAMDR_FEF_SHIFT)
#define ENET_DMAMDR_FEF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_FEF_SHIFT)) & ENET_DMAMDR_FEF_MASK)

#define ENET_DMAMDR_FUF_SHIFT                   (6)
#define ENET_DMAMDR_FUF_MASK                    (0x01U << ENET_DMAMDR_FUF_SHIFT)
#define ENET_DMAMDR_FUF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_FUF_SHIFT)) & ENET_DMAMDR_FUF_MASK)

#define ENET_DMAMDR_DGF_SHIFT                   (5)
#define ENET_DMAMDR_DGF_MASK                    (0x01U << ENET_DMAMDR_DGF_SHIFT)
#define ENET_DMAMDR_DGF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_DGF_SHIFT)) & ENET_DMAMDR_DGF_MASK)

#define ENET_DMAMDR_RTC_SHIFT                   (3)
#define ENET_DMAMDR_RTC_MASK                    (0x3U << ENET_DMAMDR_RTC_SHIFT)
#define ENET_DMAMDR_RTC(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_RTC_SHIFT)) & ENET_DMAMDR_RTC_MASK)

#define ENET_DMAMDR_OSF_SHIFT                   (2)
#define ENET_DMAMDR_OSF_MASK                    (0x01U << ENET_DMAMDR_OSF_SHIFT)
#define ENET_DMAMDR_OSF(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_OSF_SHIFT)) & ENET_DMAMDR_OSF_MASK)

#define ENET_DMAMDR_STR_SHIFT                   (1)
#define ENET_DMAMDR_STR_MASK                    (0x01U << ENET_DMAMDR_STR_SHIFT)
#define ENET_DMAMDR_STR(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMAMDR_STR_SHIFT)) & ENET_DMAMDR_STR_MASK)

/*!
 * @brief ENET_DMABSR Register Bit Definition
 */

#define ENET_DMABSR_TXPR_SHIFT                  (27)
#define ENET_DMABSR_TXPR_MASK                   (0x01U << ENET_DMABSR_TXPR_SHIFT)
#define ENET_DMABSR_TXPR(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_TXPR_SHIFT)) & ENET_DMABSR_TXPR_MASK)

#define ENET_DMABSR_MBST_SHIFT                  (26)
#define ENET_DMABSR_MBST_MASK                   (0x01U << ENET_DMABSR_MBST_SHIFT)
#define ENET_DMABSR_MBST(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_MBST_SHIFT)) & ENET_DMABSR_MBST_MASK)

#define ENET_DMABSR_AAL_SHIFT                   (25)
#define ENET_DMABSR_AAL_MASK                    (0x01U << ENET_DMABSR_AAL_SHIFT)
#define ENET_DMABSR_AAL(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_AAL_SHIFT)) & ENET_DMABSR_AAL_MASK)

#define ENET_DMABSR_MPBL_SHIFT                  (24)
#define ENET_DMABSR_MPBL_MASK                   (0x01U << ENET_DMABSR_MPBL_SHIFT)
#define ENET_DMABSR_MPBL(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_MPBL_SHIFT)) & ENET_DMABSR_MPBL_MASK)

#define ENET_DMABSR_SPBL_SHIFT                  (23)
#define ENET_DMABSR_SPBL_MASK                   (0x01U << ENET_DMABSR_SPBL_SHIFT)
#define ENET_DMABSR_SPBL(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_SPBL_SHIFT)) & ENET_DMABSR_SPBL_MASK)

#define ENET_DMABSR_RPBL_SHIFT                  (17)
#define ENET_DMABSR_RPBL_MASK                   (0x3FU << ENET_DMABSR_RPBL_SHIFT)
#define ENET_DMABSR_RPBL(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_RPBL_SHIFT)) & ENET_DMABSR_RPBL_MASK)

