OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ENET_DMABSR_FBST_SHIFT                  (16)
#define ENET_DMABSR_FBST_MASK                   (0x01U << ENET_DMABSR_FBST_SHIFT)
#define ENET_DMABSR_FBST(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_FBST_SHIFT)) & ENET_DMABSR_FBST_MASK)

#define ENET_DMABSR_FTPR_SHIFT                  (14)
#define ENET_DMABSR_FTPR_MASK                   (0x3U << ENET_DMABSR_FTPR_SHIFT)
#define ENET_DMABSR_FTPR(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_FTPR_SHIFT)) & ENET_DMABSR_FTPR_MASK)

#define ENET_DMABSR_TPBL_SHIFT                  (8)
#define ENET_DMABSR_TPBL_MASK                   (0x3FU << ENET_DMABSR_TPBL_SHIFT)
#define ENET_DMABSR_TPBL(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_TPBL_SHIFT)) & ENET_DMABSR_TPBL_MASK)

#define ENET_DMABSR_DSEN_SHIFT                  (7)
#define ENET_DMABSR_DSEN_MASK                   (0x01U << ENET_DMABSR_DSEN_SHIFT)
#define ENET_DMABSR_DSEN(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_DSEN_SHIFT)) & ENET_DMABSR_DSEN_MASK)

#define ENET_DMABSR_DSL_SHIFT                   (2)
#define ENET_DMABSR_DSL_MASK                    (0x1FU << ENET_DMABSR_DSL_SHIFT)
#define ENET_DMABSR_DSL(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_DSL_SHIFT)) & ENET_DMABSR_DSL_MASK)

#define ENET_DMABSR_DMAA_SHIFT                  (1)
#define ENET_DMABSR_DMAA_MASK                   (0x01U << ENET_DMABSR_DMAA_SHIFT)
#define ENET_DMABSR_DMAA(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_DMAA_SHIFT)) & ENET_DMABSR_DMAA_MASK)

#define ENET_DMABSR_SR_SHIFT                    (0)
#define ENET_DMABSR_SR_MASK                     (0x01U << ENET_DMABSR_SR_SHIFT)
#define ENET_DMABSR_SR(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMABSR_SR_SHIFT)) & ENET_DMABSR_SR_MASK)

/*!
 * @brief ENET_DMASR Register Bit Definition
 */

#define ENET_DMASR_PTPS_SHIFT                   (29)
#define ENET_DMASR_PTPS_MASK                    (0x01U << ENET_DMASR_PTPS_SHIFT)
#define ENET_DMASR_PTPS(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_PTPS_SHIFT)) & ENET_DMASR_PTPS_MASK)

#define ENET_DMASR_PMTS_SHIFT                   (28)
#define ENET_DMASR_PMTS_MASK                    (0x01U << ENET_DMASR_PMTS_SHIFT)
#define ENET_DMASR_PMTS(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_PMTS_SHIFT)) & ENET_DMASR_PMTS_MASK)

#define ENET_DMASR_MMCS_SHIFT                   (27)
#define ENET_DMASR_MMCS_MASK                    (0x01U << ENET_DMASR_MMCS_SHIFT)
#define ENET_DMASR_MMCS(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_MMCS_SHIFT)) & ENET_DMASR_MMCS_MASK)

#define ENET_DMASR_EBUS_SHIFT                   (23)
#define ENET_DMASR_EBUS_MASK                    (0x7U << ENET_DMASR_EBUS_SHIFT)
#define ENET_DMASR_EBUS(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_EBUS_SHIFT)) & ENET_DMASR_EBUS_MASK)

#define ENET_DMASR_TPS_SHIFT                    (20)
#define ENET_DMASR_TPS_MASK                     (0x7U << ENET_DMASR_TPS_SHIFT)
#define ENET_DMASR_TPS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_TPS_SHIFT)) & ENET_DMASR_TPS_MASK)

#define ENET_DMASR_RPS_SHIFT                    (17)
#define ENET_DMASR_RPS_MASK                     (0x7U << ENET_DMASR_RPS_SHIFT)
#define ENET_DMASR_RPS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_RPS_SHIFT)) & ENET_DMASR_RPS_MASK)

#define ENET_DMASR_NIS_SHIFT                    (16)
#define ENET_DMASR_NIS_MASK                     (0x01U << ENET_DMASR_NIS_SHIFT)
#define ENET_DMASR_NIS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_NIS_SHIFT)) & ENET_DMASR_NIS_MASK)

#define ENET_DMASR_AIS_SHIFT                    (15)
#define ENET_DMASR_AIS_MASK                     (0x01U << ENET_DMASR_AIS_SHIFT)
#define ENET_DMASR_AIS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_AIS_SHIFT)) & ENET_DMASR_AIS_MASK)

#define ENET_DMASR_ERS_SHIFT                    (14)
#define ENET_DMASR_ERS_MASK                     (0x01U << ENET_DMASR_ERS_SHIFT)
#define ENET_DMASR_ERS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_ERS_SHIFT)) & ENET_DMASR_ERS_MASK)

#define ENET_DMASR_FBS_SHIFT                    (13)
#define ENET_DMASR_FBS_MASK                     (0x01U << ENET_DMASR_FBS_SHIFT)
#define ENET_DMASR_FBS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_FBS_SHIFT)) & ENET_DMASR_FBS_MASK)

#define ENET_DMASR_ETS_SHIFT                    (10)
#define ENET_DMASR_ETS_MASK                     (0x01U << ENET_DMASR_ETS_SHIFT)
#define ENET_DMASR_ETS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_ETS_SHIFT)) & ENET_DMASR_ETS_MASK)

#define ENET_DMASR_RWS_SHIFT                    (9)
#define ENET_DMASR_RWS_MASK                     (0x01U << ENET_DMASR_RWS_SHIFT)
#define ENET_DMASR_RWS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_RWS_SHIFT)) & ENET_DMASR_RWS_MASK)

#define ENET_DMASR_RSS_SHIFT                    (8)
#define ENET_DMASR_RSS_MASK                     (0x01U << ENET_DMASR_RSS_SHIFT)
#define ENET_DMASR_RSS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_RSS_SHIFT)) & ENET_DMASR_RSS_MASK)

#define ENET_DMASR_RUS_SHIFT                    (7)
#define ENET_DMASR_RUS_MASK                     (0x01U << ENET_DMASR_RUS_SHIFT)
#define ENET_DMASR_RUS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_RUS_SHIFT)) & ENET_DMASR_RUS_MASK)

#define ENET_DMASR_RCS_SHIFT                    (6)
#define ENET_DMASR_RCS_MASK                     (0x01U << ENET_DMASR_RCS_SHIFT)
#define ENET_DMASR_RCS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_RCS_SHIFT)) & ENET_DMASR_RCS_MASK)

#define ENET_DMASR_UNS_SHIFT                    (5)
#define ENET_DMASR_UNS_MASK                     (0x01U << ENET_DMASR_UNS_SHIFT)
#define ENET_DMASR_UNS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_UNS_SHIFT)) & ENET_DMASR_UNS_MASK)

#define ENET_DMASR_OVS_SHIFT                    (4)
#define ENET_DMASR_OVS_MASK                     (0x01U << ENET_DMASR_OVS_SHIFT)
#define ENET_DMASR_OVS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_OVS_SHIFT)) & ENET_DMASR_OVS_MASK)

#define ENET_DMASR_TJS_SHIFT                    (3)
#define ENET_DMASR_TJS_MASK                     (0x01U << ENET_DMASR_TJS_SHIFT)
#define ENET_DMASR_TJS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_TJS_SHIFT)) & ENET_DMASR_TJS_MASK)

#define ENET_DMASR_TUS_SHIFT                    (2)
#define ENET_DMASR_TUS_MASK                     (0x01U << ENET_DMASR_TUS_SHIFT)
#define ENET_DMASR_TUS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_TUS_SHIFT)) & ENET_DMASR_TUS_MASK)

