OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ENET_DMASR_TSS_SHIFT                    (1)
#define ENET_DMASR_TSS_MASK                     (0x01U << ENET_DMASR_TSS_SHIFT)
#define ENET_DMASR_TSS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_TSS_SHIFT)) & ENET_DMASR_TSS_MASK)

#define ENET_DMASR_TCS_SHIFT                    (0)
#define ENET_DMASR_TCS_MASK                     (0x01U << ENET_DMASR_TCS_SHIFT)
#define ENET_DMASR_TCS(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMASR_TCS_SHIFT)) & ENET_DMASR_TCS_MASK)

/*!
 * @brief ENET_DMAIR Register Bit Definition
 */

#define ENET_DMAIR_NIE_SHIFT                    (16)
#define ENET_DMAIR_NIE_MASK                     (0x01U << ENET_DMAIR_NIE_SHIFT)
#define ENET_DMAIR_NIE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_NIE_SHIFT)) & ENET_DMAIR_NIE_MASK)

#define ENET_DMAIR_AIE_SHIFT                    (15)
#define ENET_DMAIR_AIE_MASK                     (0x01U << ENET_DMAIR_AIE_SHIFT)
#define ENET_DMAIR_AIE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_AIE_SHIFT)) & ENET_DMAIR_AIE_MASK)

#define ENET_DMAIR_ERE_SHIFT                    (14)
#define ENET_DMAIR_ERE_MASK                     (0x01U << ENET_DMAIR_ERE_SHIFT)
#define ENET_DMAIR_ERE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_ERE_SHIFT)) & ENET_DMAIR_ERE_MASK)

#define ENET_DMAIR_FBE_SHIFT                    (13)
#define ENET_DMAIR_FBE_MASK                     (0x01U << ENET_DMAIR_FBE_SHIFT)
#define ENET_DMAIR_FBE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_FBE_SHIFT)) & ENET_DMAIR_FBE_MASK)

#define ENET_DMAIR_ETE_SHIFT                    (10)
#define ENET_DMAIR_ETE_MASK                     (0x01U << ENET_DMAIR_ETE_SHIFT)
#define ENET_DMAIR_ETE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_ETE_SHIFT)) & ENET_DMAIR_ETE_MASK)

#define ENET_DMAIR_RWE_SHIFT                    (9)
#define ENET_DMAIR_RWE_MASK                     (0x01U << ENET_DMAIR_RWE_SHIFT)
#define ENET_DMAIR_RWE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_RWE_SHIFT)) & ENET_DMAIR_RWE_MASK)

#define ENET_DMAIR_RSE_SHIFT                    (8)
#define ENET_DMAIR_RSE_MASK                     (0x01U << ENET_DMAIR_RSE_SHIFT)
#define ENET_DMAIR_RSE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_RSE_SHIFT)) & ENET_DMAIR_RSE_MASK)

#define ENET_DMAIR_RUE_SHIFT                    (7)
#define ENET_DMAIR_RUE_MASK                     (0x01U << ENET_DMAIR_RUE_SHIFT)
#define ENET_DMAIR_RUE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_RUE_SHIFT)) & ENET_DMAIR_RUE_MASK)

#define ENET_DMAIR_RCE_SHIFT                    (6)
#define ENET_DMAIR_RCE_MASK                     (0x01U << ENET_DMAIR_RCE_SHIFT)
#define ENET_DMAIR_RCE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_RCE_SHIFT)) & ENET_DMAIR_RCE_MASK)

#define ENET_DMAIR_UNE_SHIFT                    (5)
#define ENET_DMAIR_UNE_MASK                     (0x01U << ENET_DMAIR_UNE_SHIFT)
#define ENET_DMAIR_UNE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_UNE_SHIFT)) & ENET_DMAIR_UNE_MASK)

#define ENET_DMAIR_OVE_SHIFT                    (4)
#define ENET_DMAIR_OVE_MASK                     (0x01U << ENET_DMAIR_OVE_SHIFT)
#define ENET_DMAIR_OVE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_OVE_SHIFT)) & ENET_DMAIR_OVE_MASK)

#define ENET_DMAIR_TJE_SHIFT                    (3)
#define ENET_DMAIR_TJE_MASK                     (0x01U << ENET_DMAIR_TJE_SHIFT)
#define ENET_DMAIR_TJE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_TJE_SHIFT)) & ENET_DMAIR_TJE_MASK)

#define ENET_DMAIR_TUE_SHIFT                    (2)
#define ENET_DMAIR_TUE_MASK                     (0x01U << ENET_DMAIR_TUE_SHIFT)
#define ENET_DMAIR_TUE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_TUE_SHIFT)) & ENET_DMAIR_TUE_MASK)

#define ENET_DMAIR_TSE_SHIFT                    (1)
#define ENET_DMAIR_TSE_MASK                     (0x01U << ENET_DMAIR_TSE_SHIFT)
#define ENET_DMAIR_TSE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_TSE_SHIFT)) & ENET_DMAIR_TSE_MASK)

#define ENET_DMAIR_TCE_SHIFT                    (0)
#define ENET_DMAIR_TCE_MASK                     (0x01U << ENET_DMAIR_TCE_SHIFT)
#define ENET_DMAIR_TCE(x)                       (((uint32_t)(((uint32_t)(x)) << ENET_DMAIR_TCE_SHIFT)) & ENET_DMAIR_TCE_MASK)

/*!
 * @brief ENET_DMAFLCR Register Bit Definition
 */

#define ENET_DMAFLCR_OVFF_SHIFT                 (28)
#define ENET_DMAFLCR_OVFF_MASK                  (0x01U << ENET_DMAFLCR_OVFF_SHIFT)
#define ENET_DMAFLCR_OVFF(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_DMAFLCR_OVFF_SHIFT)) & ENET_DMAFLCR_OVFF_MASK)

#define ENET_DMAFLCR_OVFC_SHIFT                 (17)
#define ENET_DMAFLCR_OVFC_MASK                  (0x7FFU << ENET_DMAFLCR_OVFC_SHIFT)
#define ENET_DMAFLCR_OVFC(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_DMAFLCR_OVFC_SHIFT)) & ENET_DMAFLCR_OVFC_MASK)

#define ENET_DMAFLCR_BUAF_SHIFT                 (16)
#define ENET_DMAFLCR_BUAF_MASK                  (0x01U << ENET_DMAFLCR_BUAF_SHIFT)
#define ENET_DMAFLCR_BUAF(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_DMAFLCR_BUAF_SHIFT)) & ENET_DMAFLCR_BUAF_MASK)

#define ENET_DMAFLCR_BUAC_SHIFT                 (0)
#define ENET_DMAFLCR_BUAC_MASK                  (0xFFFFU << ENET_DMAFLCR_BUAC_SHIFT)
#define ENET_DMAFLCR_BUAC(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_DMAFLCR_BUAC_SHIFT)) & ENET_DMAFLCR_BUAC_MASK)

/*!
 * @brief ENET_DMAWDTR Register Bit Definition
 */

#define ENET_DMAWDTR_RIWT_SHIFT                 (0)
#define ENET_DMAWDTR_RIWT_MASK                  (0xFFFFFFFFU << ENET_DMAWDTR_RIWT_SHIFT)
#define ENET_DMAWDTR_RIWT(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_DMAWDTR_RIWT_SHIFT)) & ENET_DMAWDTR_RIWT_MASK)

/*!
 * @brief ENET_DMARXPDR Register Bit Definition
 */

#define ENET_DMARXPDR_RXPD_SHIFT                (0)
#define ENET_DMARXPDR_RXPD_MASK                 (0xFFFFFFFFU << ENET_DMARXPDR_RXPD_SHIFT)
#define ENET_DMARXPDR_RXPD(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_DMARXPDR_RXPD_SHIFT)) & ENET_DMARXPDR_RXPD_MASK)

/*!
 * @brief ENET_DMATXPDR Register Bit Definition
 */

#define ENET_DMATXPDR_TXPD_SHIFT                (0)
#define ENET_DMATXPDR_TXPD_MASK                 (0xFFFFFFFFU << ENET_DMATXPDR_TXPD_SHIFT)
#define ENET_DMATXPDR_TXPD(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_DMATXPDR_TXPD_SHIFT)) & ENET_DMATXPDR_TXPD_MASK)

/*!
 * @brief ENET_DMARXDSAR Register Bit Definition
 */

