OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ENET_DMARXDSAR_RXDSA_SHIFT              (0)
#define ENET_DMARXDSAR_RXDSA_MASK               (0xFFFFFFFFU << ENET_DMARXDSAR_RXDSA_SHIFT)
#define ENET_DMARXDSAR_RXDSA(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_DMARXDSAR_RXDSA_SHIFT)) & ENET_DMARXDSAR_RXDSA_MASK)

/*!
 * @brief ENET_DMATXDSAR Register Bit Definition
 */

#define ENET_DMATXDSAR_TXDSA_SHIFT              (0)
#define ENET_DMATXDSAR_TXDSA_MASK               (0xFFFFFFFFU << ENET_DMATXDSAR_TXDSA_SHIFT)
#define ENET_DMATXDSAR_TXDSA(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_DMATXDSAR_TXDSA_SHIFT)) & ENET_DMATXDSAR_TXDSA_MASK)

/*!
 * @brief ENET_DMACURRXDSAR Register Bit Definition
 */

#define ENET_DMACURRXDSAR_CURRXDSA_SHIFT        (0)
#define ENET_DMACURRXDSAR_CURRXDSA_MASK         (0xFFFFFFFFU << ENET_DMACURRXDSAR_CURRXDSA_SHIFT)
#define ENET_DMACURRXDSAR_CURRXDSA(x)           (((uint32_t)(((uint32_t)(x)) << ENET_DMACURRXDSAR_CURRXDSA_SHIFT)) & ENET_DMACURRXDSAR_CURRXDSA_MASK)

/*!
 * @brief ENET_DMACURTXDSAR Register Bit Definition
 */

#define ENET_DMACURTXDSAR_CURTXDSA_SHIFT        (0)
#define ENET_DMACURTXDSAR_CURTXDSA_MASK         (0xFFFFFFFFU << ENET_DMACURTXDSAR_CURTXDSA_SHIFT)
#define ENET_DMACURTXDSAR_CURTXDSA(x)           (((uint32_t)(((uint32_t)(x)) << ENET_DMACURTXDSAR_CURTXDSA_SHIFT)) & ENET_DMACURTXDSAR_CURTXDSA_MASK)

/*!
 * @brief ENET_DMACURRXBFAR Register Bit Definition
 */

#define ENET_DMACURRXBFAR_CURRXBFA_SHIFT        (0)
#define ENET_DMACURRXBFAR_CURRXBFA_MASK         (0xFFFFFFFFU << ENET_DMACURRXBFAR_CURRXBFA_SHIFT)
#define ENET_DMACURRXBFAR_CURRXBFA(x)           (((uint32_t)(((uint32_t)(x)) << ENET_DMACURRXBFAR_CURRXBFA_SHIFT)) & ENET_DMACURRXBFAR_CURRXBFA_MASK)

/*!
 * @brief ENET_DMACURTXBFAR Register Bit Definition
 */

#define ENET_DMACURTXBFAR_CURTXBFA_SHIFT        (0)
#define ENET_DMACURTXBFAR_CURTXBFA_MASK         (0xFFFFFFFFU << ENET_DMACURTXBFAR_CURTXBFA_SHIFT)
#define ENET_DMACURTXBFAR_CURTXBFA(x)           (((uint32_t)(((uint32_t)(x)) << ENET_DMACURTXBFAR_CURTXBFA_SHIFT)) & ENET_DMACURTXBFAR_CURTXBFA_MASK)

/*!
 * @brief ENET_PTPCR Register Bit Definition
 */

#define ENET_PTPCR_PTPDAF_SHIFT                 (18)
#define ENET_PTPCR_PTPDAF_MASK                  (0x01U << ENET_PTPCR_PTPDAF_SHIFT)
#define ENET_PTPCR_PTPDAF(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPDAF_SHIFT)) & ENET_PTPCR_PTPDAF_MASK)

#define ENET_PTPCR_PTPTYPS_SHIFT                (14)
#define ENET_PTPCR_PTPTYPS_MASK                 (0xFU << ENET_PTPCR_PTPTYPS_SHIFT)
#define ENET_PTPCR_PTPTYPS(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPTYPS_SHIFT)) & ENET_PTPCR_PTPTYPS_MASK)

#define ENET_PTPCR_PTPIPV4_SHIFT                (13)
#define ENET_PTPCR_PTPIPV4_MASK                 (0x01U << ENET_PTPCR_PTPIPV4_SHIFT)
#define ENET_PTPCR_PTPIPV4(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPIPV4_SHIFT)) & ENET_PTPCR_PTPIPV4_MASK)

#define ENET_PTPCR_PTPIPV6_SHIFT                (12)
#define ENET_PTPCR_PTPIPV6_MASK                 (0x01U << ENET_PTPCR_PTPIPV6_SHIFT)
#define ENET_PTPCR_PTPIPV6(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPIPV6_SHIFT)) & ENET_PTPCR_PTPIPV6_MASK)

#define ENET_PTPCR_PTPETH_SHIFT                 (11)
#define ENET_PTPCR_PTPETH_MASK                  (0x01U << ENET_PTPCR_PTPETH_SHIFT)
#define ENET_PTPCR_PTPETH(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPETH_SHIFT)) & ENET_PTPCR_PTPETH_MASK)

#define ENET_PTPCR_PTPVER_SHIFT                 (10)
#define ENET_PTPCR_PTPVER_MASK                  (0x01U << ENET_PTPCR_PTPVER_SHIFT)
#define ENET_PTPCR_PTPVER(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPVER_SHIFT)) & ENET_PTPCR_PTPVER_MASK)

#define ENET_PTPCR_PTPNSS_SHIFT                 (9)
#define ENET_PTPCR_PTPNSS_MASK                  (0x01U << ENET_PTPCR_PTPNSS_SHIFT)
#define ENET_PTPCR_PTPNSS(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPNSS_SHIFT)) & ENET_PTPCR_PTPNSS_MASK)

#define ENET_PTPCR_PTPEALL_SHIFT                (8)
#define ENET_PTPCR_PTPEALL_MASK                 (0x01U << ENET_PTPCR_PTPEALL_SHIFT)
#define ENET_PTPCR_PTPEALL(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPEALL_SHIFT)) & ENET_PTPCR_PTPEALL_MASK)

#define ENET_PTPCR_PTPADUP_SHIFT                (5)
#define ENET_PTPCR_PTPADUP_MASK                 (0x01U << ENET_PTPCR_PTPADUP_SHIFT)
#define ENET_PTPCR_PTPADUP(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPADUP_SHIFT)) & ENET_PTPCR_PTPADUP_MASK)

#define ENET_PTPCR_PTPINT_SHIFT                 (4)
#define ENET_PTPCR_PTPINT_MASK                  (0x01U << ENET_PTPCR_PTPINT_SHIFT)
#define ENET_PTPCR_PTPINT(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPINT_SHIFT)) & ENET_PTPCR_PTPINT_MASK)

#define ENET_PTPCR_PTPUP_SHIFT                  (3)
#define ENET_PTPCR_PTPUP_MASK                   (0x01U << ENET_PTPCR_PTPUP_SHIFT)
#define ENET_PTPCR_PTPUP(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPUP_SHIFT)) & ENET_PTPCR_PTPUP_MASK)

#define ENET_PTPCR_PTPINI_SHIFT                 (2)
#define ENET_PTPCR_PTPINI_MASK                  (0x01U << ENET_PTPCR_PTPINI_SHIFT)
#define ENET_PTPCR_PTPINI(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPINI_SHIFT)) & ENET_PTPCR_PTPINI_MASK)

#define ENET_PTPCR_PTPCS_SHIFT                  (1)
#define ENET_PTPCR_PTPCS_MASK                   (0x01U << ENET_PTPCR_PTPCS_SHIFT)
#define ENET_PTPCR_PTPCS(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPCS_SHIFT)) & ENET_PTPCR_PTPCS_MASK)

#define ENET_PTPCR_PTPEN_SHIFT                  (0)
#define ENET_PTPCR_PTPEN_MASK                   (0x01U << ENET_PTPCR_PTPEN_SHIFT)
#define ENET_PTPCR_PTPEN(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_PTPCR_PTPEN_SHIFT)) & ENET_PTPCR_PTPEN_MASK)

/*!
 * @brief ENET_PTPSR Register Bit Definition
 */

#define ENET_PTPSR_TSER1_SHIFT                  (5)
#define ENET_PTPSR_TSER1_MASK                   (0x01U << ENET_PTPSR_TSER1_SHIFT)
#define ENET_PTPSR_TSER1(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_PTPSR_TSER1_SHIFT)) & ENET_PTPSR_TSER1_MASK)

#define ENET_PTPSR_TSTA1_SHIFT                  (4)
#define ENET_PTPSR_TSTA1_MASK                   (0x01U << ENET_PTPSR_TSTA1_SHIFT)
#define ENET_PTPSR_TSTA1(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_PTPSR_TSTA1_SHIFT)) & ENET_PTPSR_TSTA1_MASK)

#define ENET_PTPSR_TSER0_SHIFT                  (3)
#define ENET_PTPSR_TSER0_MASK                   (0x01U << ENET_PTPSR_TSER0_SHIFT)
#define ENET_PTPSR_TSER0(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_PTPSR_TSER0_SHIFT)) & ENET_PTPSR_TSER0_MASK)

#define ENET_PTPSR_TSTA0_SHIFT                  (1)
#define ENET_PTPSR_TSTA0_MASK                   (0x01U << ENET_PTPSR_TSTA0_SHIFT)
#define ENET_PTPSR_TSTA0(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_PTPSR_TSTA0_SHIFT)) & ENET_PTPSR_TSTA0_MASK)

#define ENET_PTPSR_TSOVF_SHIFT                  (0)
#define ENET_PTPSR_TSOVF_MASK                   (0x01U << ENET_PTPSR_TSOVF_SHIFT)
#define ENET_PTPSR_TSOVF(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_PTPSR_TSOVF_SHIFT)) & ENET_PTPSR_TSOVF_MASK)

/*!
 * @brief ENET_PTPBSAR Register Bit Definition
 */

