OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ENET_PTPBSAR_BSADD_SHIFT                (0)
#define ENET_PTPBSAR_BSADD_MASK                 (0xFFFFFFFFU << ENET_PTPBSAR_BSADD_SHIFT)
#define ENET_PTPBSAR_BSADD(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPBSAR_BSADD_SHIFT)) & ENET_PTPBSAR_BSADD_MASK)

/*!
 * @brief ENET_PTPNSAR Register Bit Definition
 */

#define ENET_PTPNSAR_NSADD_SHIFT                (0)
#define ENET_PTPNSAR_NSADD_MASK                 (0xFFU << ENET_PTPNSAR_NSADD_SHIFT)
#define ENET_PTPNSAR_NSADD(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPNSAR_NSADD_SHIFT)) & ENET_PTPNSAR_NSADD_MASK)

/*!
 * @brief ENET_PTPSBSR Register Bit Definition
 */

#define ENET_PTPSBSR_SBSEC_SHIFT                (0)
#define ENET_PTPSBSR_SBSEC_MASK                 (0xFFFFFFFFU << ENET_PTPSBSR_SBSEC_SHIFT)
#define ENET_PTPSBSR_SBSEC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPSBSR_SBSEC_SHIFT)) & ENET_PTPSBSR_SBSEC_MASK)

/*!
 * @brief ENET_PTPSNSR Register Bit Definition
 */

#define ENET_PTPSNSR_SNSEC_SHIFT                (0)
#define ENET_PTPSNSR_SNSEC_MASK                 (0x7FFFFFFFU << ENET_PTPSNSR_SNSEC_SHIFT)
#define ENET_PTPSNSR_SNSEC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPSNSR_SNSEC_SHIFT)) & ENET_PTPSNSR_SNSEC_MASK)

/*!
 * @brief ENET_PTPUBSR Register Bit Definition
 */

#define ENET_PTPUBSR_UBSEC_SHIFT                (0)
#define ENET_PTPUBSR_UBSEC_MASK                 (0xFFFFFFFFU << ENET_PTPUBSR_UBSEC_SHIFT)
#define ENET_PTPUBSR_UBSEC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPUBSR_UBSEC_SHIFT)) & ENET_PTPUBSR_UBSEC_MASK)

/*!
 * @brief ENET_PTPUNSR Register Bit Definition
 */

#define ENET_PTPUNSR_UPNSEC_SHIFT               (31)
#define ENET_PTPUNSR_UPNSEC_MASK                (0x01U << ENET_PTPUNSR_UPNSEC_SHIFT)
#define ENET_PTPUNSR_UPNSEC(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_PTPUNSR_UPNSEC_SHIFT)) & ENET_PTPUNSR_UPNSEC_MASK)

#define ENET_PTPUNSR_UNSEC_SHIFT                (0)
#define ENET_PTPUNSR_UNSEC_MASK                 (0x7FFFFFFFU << ENET_PTPUNSR_UNSEC_SHIFT)
#define ENET_PTPUNSR_UNSEC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPUNSR_UNSEC_SHIFT)) & ENET_PTPUNSR_UNSEC_MASK)

/*!
 * @brief ENET_PTPTBSR Register Bit Definition
 */

#define ENET_PTPTBSR_TBSEC_SHIFT                (0)
#define ENET_PTPTBSR_TBSEC_MASK                 (0xFFFFFFFFU << ENET_PTPTBSR_TBSEC_SHIFT)
#define ENET_PTPTBSR_TBSEC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPTBSR_TBSEC_SHIFT)) & ENET_PTPTBSR_TBSEC_MASK)

/*!
 * @brief ENET_PTPTNSR Register Bit Definition
 */

#define ENET_PTPTNSR_TNSEC_SHIFT                (0)
#define ENET_PTPTNSR_TNSEC_MASK                 (0x7FFFFFFFU << ENET_PTPTNSR_TNSEC_SHIFT)
#define ENET_PTPTNSR_TNSEC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_PTPTNSR_TNSEC_SHIFT)) & ENET_PTPTNSR_TNSEC_MASK)

/*!
 * @brief ENET_PTPPPSR Register Bit Definition
 */

#define ENET_PTPPPSR_TTSEL1_SHIFT               (13)
#define ENET_PTPPPSR_TTSEL1_MASK                (0x3U << ENET_PTPPPSR_TTSEL1_SHIFT)
#define ENET_PTPPPSR_TTSEL1(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_PTPPPSR_TTSEL1_SHIFT)) & ENET_PTPPPSR_TTSEL1_MASK)

#define ENET_PTPPPSR_PPSOUT1_SHIFT              (8)
#define ENET_PTPPPSR_PPSOUT1_MASK               (0x7U << ENET_PTPPPSR_PPSOUT1_SHIFT)
#define ENET_PTPPPSR_PPSOUT1(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_PTPPPSR_PPSOUT1_SHIFT)) & ENET_PTPPPSR_PPSOUT1_MASK)

#define ENET_PTPPPSR_TTSEL0_SHIFT               (5)
#define ENET_PTPPPSR_TTSEL0_MASK                (0x3U << ENET_PTPPPSR_TTSEL0_SHIFT)
#define ENET_PTPPPSR_TTSEL0(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_PTPPPSR_TTSEL0_SHIFT)) & ENET_PTPPPSR_TTSEL0_MASK)

#define ENET_PTPPPSR_PPSOMD_SHIFT               (4)
#define ENET_PTPPPSR_PPSOMD_MASK                (0x01U << ENET_PTPPPSR_PPSOMD_SHIFT)
#define ENET_PTPPPSR_PPSOMD(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_PTPPPSR_PPSOMD_SHIFT)) & ENET_PTPPPSR_PPSOMD_MASK)

#define ENET_PTPPPSR_PPSOUT0_SHIFT              (0)
#define ENET_PTPPPSR_PPSOUT0_MASK               (0xFU << ENET_PTPPPSR_PPSOUT0_SHIFT)
#define ENET_PTPPPSR_PPSOUT0(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_PTPPPSR_PPSOUT0_SHIFT)) & ENET_PTPPPSR_PPSOUT0_MASK)

/*!
 * @brief ENET_PMTCR Register Bit Definition
 */

#define ENET_PMTCR_RTWKFR_SHIFT                 (31)
#define ENET_PMTCR_RTWKFR_MASK                  (0x01U << ENET_PMTCR_RTWKFR_SHIFT)
#define ENET_PMTCR_RTWKFR(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_RTWKFR_SHIFT)) & ENET_PMTCR_RTWKFR_MASK)

#define ENET_PMTCR_RTWKPT_SHIFT                 (24)
#define ENET_PMTCR_RTWKPT_MASK                  (0x7U << ENET_PMTCR_RTWKPT_SHIFT)
#define ENET_PMTCR_RTWKPT(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_RTWKPT_SHIFT)) & ENET_PMTCR_RTWKPT_MASK)

#define ENET_PMTCR_RTWKTR_SHIFT                 (10)
#define ENET_PMTCR_RTWKTR_MASK                  (0x01U << ENET_PMTCR_RTWKTR_SHIFT)
#define ENET_PMTCR_RTWKTR(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_RTWKTR_SHIFT)) & ENET_PMTCR_RTWKTR_MASK)

#define ENET_PMTCR_GLUB_SHIFT                   (9)
#define ENET_PMTCR_GLUB_MASK                    (0x01U << ENET_PMTCR_GLUB_SHIFT)
#define ENET_PMTCR_GLUB(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_GLUB_SHIFT)) & ENET_PMTCR_GLUB_MASK)

#define ENET_PMTCR_WKFR_SHIFT                   (6)
#define ENET_PMTCR_WKFR_MASK                    (0x01U << ENET_PMTCR_WKFR_SHIFT)
#define ENET_PMTCR_WKFR(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_WKFR_SHIFT)) & ENET_PMTCR_WKFR_MASK)

#define ENET_PMTCR_MPFR_SHIFT                   (5)
#define ENET_PMTCR_MPFR_MASK                    (0x01U << ENET_PMTCR_MPFR_SHIFT)
#define ENET_PMTCR_MPFR(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_MPFR_SHIFT)) & ENET_PMTCR_MPFR_MASK)

#define ENET_PMTCR_WKEN_SHIFT                   (2)
#define ENET_PMTCR_WKEN_MASK                    (0x01U << ENET_PMTCR_WKEN_SHIFT)
#define ENET_PMTCR_WKEN(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_WKEN_SHIFT)) & ENET_PMTCR_WKEN_MASK)

#define ENET_PMTCR_MPEN_SHIFT                   (1)
#define ENET_PMTCR_MPEN_MASK                    (0x01U << ENET_PMTCR_MPEN_SHIFT)
#define ENET_PMTCR_MPEN(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_MPEN_SHIFT)) & ENET_PMTCR_MPEN_MASK)

#define ENET_PMTCR_PWDN_SHIFT                   (0)
#define ENET_PMTCR_PWDN_MASK                    (0x01U << ENET_PMTCR_PWDN_SHIFT)
#define ENET_PMTCR_PWDN(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_PMTCR_PWDN_SHIFT)) & ENET_PMTCR_PWDN_MASK)

/*!
 * @brief ENET_PMTRWFR Register Bit Definition
 */

#define ENET_PMTRWFR_RTWKFLT_SHIFT              (0)
#define ENET_PMTRWFR_RTWKFLT_MASK               (0xFFFFFFFFU << ENET_PMTRWFR_RTWKFLT_SHIFT)
#define ENET_PMTRWFR_RTWKFLT(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_PMTRWFR_RTWKFLT_SHIFT)) & ENET_PMTRWFR_RTWKFLT_MASK)

/*!
 * @brief ENET_MMCCR Register Bit Definition
 */

#define ENET_MMCCR_CPSEL_SHIFT                  (5)
#define ENET_MMCCR_CPSEL_MASK                   (0x01U << ENET_MMCCR_CPSEL_SHIFT)
#define ENET_MMCCR_CPSEL(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MMCCR_CPSEL_SHIFT)) & ENET_MMCCR_CPSEL_MASK)

#define ENET_MMCCR_CPSET_SHIFT                  (4)
#define ENET_MMCCR_CPSET_MASK                   (0x01U << ENET_MMCCR_CPSET_SHIFT)
#define ENET_MMCCR_CPSET(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MMCCR_CPSET_SHIFT)) & ENET_MMCCR_CPSET_MASK)

