OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define ENET_MMCCR_CFIX_SHIFT                   (3)
#define ENET_MMCCR_CFIX_MASK                    (0x01U << ENET_MMCCR_CFIX_SHIFT)
#define ENET_MMCCR_CFIX(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MMCCR_CFIX_SHIFT)) & ENET_MMCCR_CFIX_MASK)

#define ENET_MMCCR_CRRST_SHIFT                  (2)
#define ENET_MMCCR_CRRST_MASK                   (0x01U << ENET_MMCCR_CRRST_SHIFT)
#define ENET_MMCCR_CRRST(x)                     (((uint32_t)(((uint32_t)(x)) << ENET_MMCCR_CRRST_SHIFT)) & ENET_MMCCR_CRRST_MASK)

#define ENET_MMCCR_COSR_SHIFT                   (1)
#define ENET_MMCCR_COSR_MASK                    (0x01U << ENET_MMCCR_COSR_SHIFT)
#define ENET_MMCCR_COSR(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MMCCR_COSR_SHIFT)) & ENET_MMCCR_COSR_MASK)

#define ENET_MMCCR_CRST_SHIFT                   (0)
#define ENET_MMCCR_CRST_MASK                    (0x01U << ENET_MMCCR_CRST_SHIFT)
#define ENET_MMCCR_CRST(x)                      (((uint32_t)(((uint32_t)(x)) << ENET_MMCCR_CRST_SHIFT)) & ENET_MMCCR_CRST_MASK)

/*!
 * @brief ENET_MMCRSR Register Bit Definition
 */

#define ENET_MMCRSR_RUGIS_SHIFT                 (17)
#define ENET_MMCRSR_RUGIS_MASK                  (0x01U << ENET_MMCRSR_RUGIS_SHIFT)
#define ENET_MMCRSR_RUGIS(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MMCRSR_RUGIS_SHIFT)) & ENET_MMCRSR_RUGIS_MASK)

#define ENET_MMCRSR_RALIEIS_SHIFT               (6)
#define ENET_MMCRSR_RALIEIS_MASK                (0x01U << ENET_MMCRSR_RALIEIS_SHIFT)
#define ENET_MMCRSR_RALIEIS(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MMCRSR_RALIEIS_SHIFT)) & ENET_MMCRSR_RALIEIS_MASK)

#define ENET_MMCRSR_RCRCEIS_SHIFT               (5)
#define ENET_MMCRSR_RCRCEIS_MASK                (0x01U << ENET_MMCRSR_RCRCEIS_SHIFT)
#define ENET_MMCRSR_RCRCEIS(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MMCRSR_RCRCEIS_SHIFT)) & ENET_MMCRSR_RCRCEIS_MASK)

/*!
 * @brief ENET_MMCTSR Register Bit Definition
 */

#define ENET_MMCTSR_TAGIS_SHIFT                 (21)
#define ENET_MMCTSR_TAGIS_MASK                  (0x01U << ENET_MMCTSR_TAGIS_SHIFT)
#define ENET_MMCTSR_TAGIS(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MMCTSR_TAGIS_SHIFT)) & ENET_MMCTSR_TAGIS_MASK)

#define ENET_MMCTSR_TGMCIS_SHIFT                (15)
#define ENET_MMCTSR_TGMCIS_MASK                 (0x01U << ENET_MMCTSR_TGMCIS_SHIFT)
#define ENET_MMCTSR_TGMCIS(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MMCTSR_TGMCIS_SHIFT)) & ENET_MMCTSR_TGMCIS_MASK)

#define ENET_MMCTSR_TGSCIS_SHIFT                (14)
#define ENET_MMCTSR_TGSCIS_MASK                 (0x01U << ENET_MMCTSR_TGSCIS_SHIFT)
#define ENET_MMCTSR_TGSCIS(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MMCTSR_TGSCIS_SHIFT)) & ENET_MMCTSR_TGSCIS_MASK)

/*!
 * @brief ENET_MMCRIR Register Bit Definition
 */

#define ENET_MMCRIR_RUGIM_SHIFT                 (17)
#define ENET_MMCRIR_RUGIM_MASK                  (0x01U << ENET_MMCRIR_RUGIM_SHIFT)
#define ENET_MMCRIR_RUGIM(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MMCRIR_RUGIM_SHIFT)) & ENET_MMCRIR_RUGIM_MASK)

#define ENET_MMCRIR_RALIEIM_SHIFT               (6)
#define ENET_MMCRIR_RALIEIM_MASK                (0x01U << ENET_MMCRIR_RALIEIM_SHIFT)
#define ENET_MMCRIR_RALIEIM(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MMCRIR_RALIEIM_SHIFT)) & ENET_MMCRIR_RALIEIM_MASK)

#define ENET_MMCRIR_RCRCEIM_SHIFT               (5)
#define ENET_MMCRIR_RCRCEIM_MASK                (0x01U << ENET_MMCRIR_RCRCEIM_SHIFT)
#define ENET_MMCRIR_RCRCEIM(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MMCRIR_RCRCEIM_SHIFT)) & ENET_MMCRIR_RCRCEIM_MASK)

/*!
 * @brief ENET_MMCTIR Register Bit Definition
 */

#define ENET_MMCTIR_TAGIM_SHIFT                 (21)
#define ENET_MMCTIR_TAGIM_MASK                  (0x01U << ENET_MMCTIR_TAGIM_SHIFT)
#define ENET_MMCTIR_TAGIM(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MMCTIR_TAGIM_SHIFT)) & ENET_MMCTIR_TAGIM_MASK)

#define ENET_MMCTIR_TGMCIM_SHIFT                (15)
#define ENET_MMCTIR_TGMCIM_MASK                 (0x01U << ENET_MMCTIR_TGMCIM_SHIFT)
#define ENET_MMCTIR_TGMCIM(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MMCTIR_TGMCIM_SHIFT)) & ENET_MMCTIR_TGMCIM_MASK)

#define ENET_MMCTIR_TGSCIM_SHIFT                (14)
#define ENET_MMCTIR_TGSCIM_MASK                 (0x01U << ENET_MMCTIR_TGSCIM_SHIFT)
#define ENET_MMCTIR_TGSCIM(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MMCTIR_TGSCIM_SHIFT)) & ENET_MMCTIR_TGSCIM_MASK)

/*!
 * @brief ENET_MMCRUGR Register Bit Definition
 */

#define ENET_MMCRUGR_MMCRUG_SHIFT               (0)
#define ENET_MMCRUGR_MMCRUG_MASK                (0xFFFFFFFFU << ENET_MMCRUGR_MMCRUG_SHIFT)
#define ENET_MMCRUGR_MMCRUG(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MMCRUGR_MMCRUG_SHIFT)) & ENET_MMCRUGR_MMCRUG_MASK)

/*!
 * @brief ENET_MMCRALIER Register Bit Definition
 */

#define ENET_MMCRALIER_RALIE_SHIFT              (0)
#define ENET_MMCRALIER_RALIE_MASK               (0xFFFFFFFFU << ENET_MMCRALIER_RALIE_SHIFT)
#define ENET_MMCRALIER_RALIE(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MMCRALIER_RALIE_SHIFT)) & ENET_MMCRALIER_RALIE_MASK)

/*!
 * @brief ENET_MMCRCRCER Register Bit Definition
 */

#define ENET_MMCRCRCER_RCRCE_SHIFT              (0)
#define ENET_MMCRCRCER_RCRCE_MASK               (0xFFFFFFFFU << ENET_MMCRCRCER_RCRCE_SHIFT)
#define ENET_MMCRCRCER_RCRCE(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MMCRCRCER_RCRCE_SHIFT)) & ENET_MMCRCRCER_RCRCE_MASK)

/*!
 * @brief ENET_MMCTGR Register Bit Definition
 */

#define ENET_MMCTGR_MMCTG_SHIFT                 (0)
#define ENET_MMCTGR_MMCTG_MASK                  (0xFFFFFFFFU << ENET_MMCTGR_MMCTG_SHIFT)
#define ENET_MMCTGR_MMCTG(x)                    (((uint32_t)(((uint32_t)(x)) << ENET_MMCTGR_MMCTG_SHIFT)) & ENET_MMCTGR_MMCTG_MASK)

/*!
 * @brief ENET_MMCTGSCR Register Bit Definition
 */

#define ENET_MMCTGSCR_TGSC_SHIFT                (0)
#define ENET_MMCTGSCR_TGSC_MASK                 (0xFFFFFFFFU << ENET_MMCTGSCR_TGSC_SHIFT)
#define ENET_MMCTGSCR_TGSC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MMCTGSCR_TGSC_SHIFT)) & ENET_MMCTGSCR_TGSC_MASK)

/*!
 * @brief ENET_MMCTGMCR Register Bit Definition
 */

#define ENET_MMCTGMCR_TGMC_SHIFT                (0)
#define ENET_MMCTGMCR_TGMC_MASK                 (0xFFFFFFFFU << ENET_MMCTGMCR_TGMC_SHIFT)
#define ENET_MMCTGMCR_TGMC(x)                   (((uint32_t)(((uint32_t)(x)) << ENET_MMCTGMCR_TGMC_SHIFT)) & ENET_MMCTGMCR_TGMC_MASK)

/*!
 * @}
 */ /* end of group ENET_Register_Masks */
/******************************************************************************
 *ENET Instance
*******************************************************************************/

#define ENET                 ((ENET_Type*)ENET_BASE)

/*!
 * @}
 */ /* end of group ENET_Peripheral_Access_Layer */

/*!
 * @addtogroup EXTI_Peripheral_Access_Layer EXTI Peripheral Access Layer
 *  @{
 */

