OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define FLEXCAN_ESR2_VPS_SHIFT                  (14)
#define FLEXCAN_ESR2_VPS_MASK                   (0x01U << FLEXCAN_ESR2_VPS_SHIFT)
#define FLEXCAN_ESR2_VPS(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR2_VPS_SHIFT)) & FLEXCAN_ESR2_VPS_MASK)

#define FLEXCAN_ESR2_IMB_SHIFT                  (13)
#define FLEXCAN_ESR2_IMB_MASK                   (0x01U << FLEXCAN_ESR2_IMB_SHIFT)
#define FLEXCAN_ESR2_IMB(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR2_IMB_SHIFT)) & FLEXCAN_ESR2_IMB_MASK)

/*!
 * @brief FLEXCAN_CRCR  Register Bit Definition
 */

#define FLEXCAN_CRCR_MBCRC_SHIFT                (16)
#define FLEXCAN_CRCR_MBCRC_MASK                 (0x7FU << FLEXCAN_CRCR_MBCRC_SHIFT)
#define FLEXCAN_CRCR_MBCRC(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CRCR_MBCRC_SHIFT)) & FLEXCAN_CRCR_MBCRC_MASK)

#define FLEXCAN_CRCR_TXCRC_SHIFT                (0)
#define FLEXCAN_CRCR_TXCRC_MASK                 (0x7FFFU << FLEXCAN_CRCR_TXCRC_SHIFT)
#define FLEXCAN_CRCR_TXCRC(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CRCR_TXCRC_SHIFT)) & FLEXCAN_CRCR_TXCRC_MASK)

/*!
 * @brief FLEXCAN_RXFGMASK   Register Bit Definition
 */

#define FLEXCAN_RXFGMASK_FGM_SHIFT              (0)
#define FLEXCAN_RXFGMASK_FGM_MASK               (0xFFFFFFFFU << FLEXCAN_RXFGMASK_FGM_SHIFT)
#define FLEXCAN_RXFGMASK_FGM(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RXFGMASK_FGM_SHIFT)) & FLEXCAN_RXFGMASK_FGM_MASK)

/*!
 * @brief FLEXCAN_RXFIR    Register Bit Definition
 */

#define FLEXCAN_RXFIR_IDHIT_SHIFT               (0)
#define FLEXCAN_RXFIR_IDHIT_MASK                (0x1FFU << FLEXCAN_RXFIR_IDHIT_SHIFT)
#define FLEXCAN_RXFIR_IDHIT(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RXFIR_IDHIT_SHIFT)) & FLEXCAN_RXFIR_IDHIT_MASK)

/*!
 * @brief FLEXCAN_CBT   Register Bit Definition
 */

#define FLEXCAN_CBT_BTF_SHIFT                   (31)
#define FLEXCAN_CBT_BTF_MASK                    (0x01U << FLEXCAN_CBT_BTF_SHIFT)
#define FLEXCAN_CBT_BTF(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_BTF_SHIFT)) & FLEXCAN_CBT_BTF_MASK)

#define FLEXCAN_CBT_EPRESDIV_SHIFT              (21)
#define FLEXCAN_CBT_EPRESDIV_MASK               (0x3FFU << FLEXCAN_CBT_EPRESDIV_SHIFT)
#define FLEXCAN_CBT_EPRESDIV(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_EPRESDIV_SHIFT)) & FLEXCAN_CBT_EPRESDIV_MASK)

#define FLEXCAN_CBT_ERJW_SHIFT                  (16)
#define FLEXCAN_CBT_ERJW_MASK                   (0x1FU << FLEXCAN_CBT_ERJW_SHIFT)
#define FLEXCAN_CBT_ERJW(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_ERJW_SHIFT)) & FLEXCAN_CBT_ERJW_MASK)

#define FLEXCAN_CBT_EPROPSEG_SHIFT              (10)
#define FLEXCAN_CBT_EPROPSEG_MASK               (0x3FU << FLEXCAN_CBT_EPROPSEG_SHIFT)
#define FLEXCAN_CBT_EPROPSEG(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_EPROPSEG_SHIFT)) & FLEXCAN_CBT_EPROPSEG_MASK)

#define FLEXCAN_CBT_EPSEG1_SHIFT                (5)
#define FLEXCAN_CBT_EPSEG1_MASK                 (0x1FU << FLEXCAN_CBT_EPSEG1_SHIFT)
#define FLEXCAN_CBT_EPSEG1(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_EPSEG1_SHIFT)) & FLEXCAN_CBT_EPSEG1_MASK)

#define FLEXCAN_CBT_EPSEG2_SHIFT                (0)
#define FLEXCAN_CBT_EPSEG2_MASK                 (0x1FU << FLEXCAN_CBT_EPSEG2_SHIFT)
#define FLEXCAN_CBT_EPSEG2(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_EPSEG2_SHIFT)) & FLEXCAN_CBT_EPSEG2_MASK)

/*!
 * @brief FLEXCAN_CS  Register Bit Definition
 */

#define FLEXCAN_CS_CODE_SHIFT                   (24)
#define FLEXCAN_CS_CODE_MASK                    (0xFU << FLEXCAN_CS_CODE_SHIFT)
#define FLEXCAN_CS_CODE(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CS_CODE_SHIFT)) & FLEXCAN_CS_CODE_MASK)

#define FLEXCAN_CS_SRR_SHIFT                    (22)
#define FLEXCAN_CS_SRR_MASK                     (0x01U << FLEXCAN_CS_SRR_SHIFT)
#define FLEXCAN_CS_SRR(x)                       (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CS_SRR_SHIFT)) & FLEXCAN_CS_SRR_MASK)

#define FLEXCAN_CS_IDE_SHIFT                    (21)
#define FLEXCAN_CS_IDE_MASK                     (0x01U << FLEXCAN_CS_IDE_SHIFT)
#define FLEXCAN_CS_IDE(x)                       (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CS_IDE_SHIFT)) & FLEXCAN_CS_IDE_MASK)

#define FLEXCAN_CS_RTR_SHIFT                    (20)
#define FLEXCAN_CS_RTR_MASK                     (0x01U << FLEXCAN_CS_RTR_SHIFT)
#define FLEXCAN_CS_RTR(x)                       (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CS_RTR_SHIFT)) & FLEXCAN_CS_RTR_MASK)

#define FLEXCAN_CS_DLC_SHIFT                    (16)
#define FLEXCAN_CS_DLC_MASK                     (0xFU << FLEXCAN_CS_DLC_SHIFT)
#define FLEXCAN_CS_DLC(x)                       (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CS_DLC_SHIFT)) & FLEXCAN_CS_DLC_MASK)

#define FLEXCAN_CS_TIMESTAMP_SHIFT              (0)
#define FLEXCAN_CS_TIMESTAMP_MASK               (0xFFFFU << FLEXCAN_CS_TIMESTAMP_SHIFT)
#define FLEXCAN_CS_TIMESTAMP(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CS_TIMESTAMP_SHIFT)) & FLEXCAN_CS_TIMESTAMP_MASK)

/*!
 * @brief FLEXCAN_ID Register Bit Definition
 */

#define FLEXCAN_ID_PRIO_SHIFT                   (29)
#define FLEXCAN_ID_PRIO_MASK                    (0x7U << FLEXCAN_ID_PRIO_SHIFT)
#define FLEXCAN_ID_PRIO(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ID_PRIO_SHIFT)) & FLEXCAN_ID_PRIO_MASK)

#define FLEXCAN_ID_STD_SHIFT                    (18)
#define FLEXCAN_ID_STD_MASK                     (0x7FFU << FLEXCAN_ID_STD_SHIFT)
#define FLEXCAN_ID_STD(x)                       (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ID_STD_SHIFT)) & FLEXCAN_ID_STD_MASK)

#define FLEXCAN_ID_EXT_SHIFT                    (0)
#define FLEXCAN_ID_EXT_MASK                     (0x3FFFFU << FLEXCAN_ID_EXT_SHIFT)
#define FLEXCAN_ID_EXT(x)                       (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ID_EXT_SHIFT)) & FLEXCAN_ID_EXT_MASK)

/*!
 * @brief FLEXCAN_WORD0 Register Bit Definition
 */

#define FLEXCAN_WORD0_BYTE0_SHIFT               (24)
#define FLEXCAN_WORD0_BYTE0_MASK                (0xFFU << FLEXCAN_WORD0_BYTE0_SHIFT)
#define FLEXCAN_WORD0_BYTE0(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WORD0_BYTE0_SHIFT)) & FLEXCAN_WORD0_BYTE0_MASK)

#define FLEXCAN_WORD0_BYTE1_SHIFT               (16)
#define FLEXCAN_WORD0_BYTE1_MASK                (0x3FU << FLEXCAN_WORD0_BYTE1_SHIFT)
#define FLEXCAN_WORD0_BYTE1(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WORD0_BYTE1_SHIFT)) & FLEXCAN_WORD0_BYTE1_MASK)

