OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
/*******************************************************************************
 * I2C Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< control register                             offset: 0x00
    __IO uint32_t TAR;                                                            ///< target address register                      offset: 0x04
    __IO uint32_t SAR;                                                            ///< slave address register                       offset: 0x08
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t DR;                                                             ///< Data Command Register                        offset: 0x10
    __IO uint32_t SSHR;                                                           ///< Standard Mode Clock High Count Register      offset: 0x14
    __IO uint32_t SSLR;                                                           ///< Standard Mode Clock Low Count Register       offset: 0x18
    __IO uint32_t FSHR;                                                           ///< Fast/Super Fast Mode Clock High Count Registeroffset: 0x1C
    __IO uint32_t FSLR;                                                           ///< Fast/Super Fast Mode Clock Low Count Registeroffset: 0x20
    __IO uint32_t Reserved1[2];                                                   ///< Reserved
    __IO uint32_t ISR;                                                            ///< Interrupt Status Register                    offset: 0x2C
    __IO uint32_t IMR;                                                            ///< interrupt mask register                      offset: 0x30
    __IO uint32_t RAWISR;                                                         ///< RAW interrupt register                       offset: 0x34
    __IO uint32_t RXTLR;                                                          ///< receive threshold register                   offset: 0x38
    __IO uint32_t TXTLR;                                                          ///< Transmit Threshold Register                  offset: 0x3C
    __IO uint32_t ICR;                                                            ///< Combined and Independent Interrupt Clear Registersoffset: 0x40
    __IO uint32_t RXUNDER;                                                        ///< Clear the RX_UNDER interrupt register        offset: 0x44
    __IO uint32_t RXOVER;                                                         ///< Clear the RX_OVER interrupt register         offset: 0x48
    __IO uint32_t TXOVER;                                                         ///< Clear the TX_OVER interrupt register         offset: 0x4C
    __IO uint32_t RDREQ;                                                          ///< Clear the RD_REQ interrupt register          offset: 0x50
    __IO uint32_t TXABRT;                                                         ///< Clear the TX_ABRT interrupt register         offset: 0x54
    __IO uint32_t RXDONE;                                                         ///< Clear the RX_DONE interrupt register         offset: 0x58
    __IO uint32_t ACTIV;                                                          ///< Clear the ACTIVITY interrupt register        offset: 0x5C
    __IO uint32_t STOP;                                                           ///< Clear the STOP_DET interrupt register        offset: 0x60
    __IO uint32_t START;                                                          ///< Clear the START_DET interrupt register       offset: 0x64
    __IO uint32_t GC;                                                             ///< Clear the GEN_CALL interrupt register        offset: 0x68
    __IO uint32_t ENR;                                                            ///< enable register                              offset: 0x6C
    __IO uint32_t SR;                                                             ///< status register                              offset: 0x70
    __IO uint32_t TXFLR;                                                          ///< Transmit buffer level register               offset: 0x74
    __IO uint32_t RXFLR;                                                          ///< Receive buffer level register                offset: 0x78
    __IO uint32_t HOLD;                                                           ///< SDA hold time register                       offset: 0x7C
    __IO uint32_t TXABRTSRC;                                                      ///< Transfer Abort Source Register               offset: 0x80
    __IO uint32_t SLVNACK;                                                        ///< Slave Receive NACK Register                  offset: 0x84
    __IO uint32_t DMA;                                                            ///< DMA Control Register                         offset: 0x88
    __IO uint32_t Reserved2[2];                                                   ///< Reserved
    __IO uint32_t SETUP;                                                          ///< SDA setup time register                      offset: 0x94
    __IO uint32_t GCR;                                                            ///< General Call ACK Register                    offset: 0x98
    __IO uint32_t ENSR;                                                           ///< ENABLE Status Register                       offset: 0x9C
    __IO uint32_t SPKLEN;                                                         ///< filter register                              offset: 0xA0
    __IO uint32_t Reserved3[2];                                                   ///< Reserved
    __IO uint32_t SCLTMO;                                                         ///< SCL Low Timeout Register                     offset: 0xAC
    __IO uint32_t SDATMO;                                                         ///< SDA Low Timeout Register                     offset: 0xB0
    __IO uint32_t SCLSTUCK;                                                       ///< Clear the SCL_STUCK interrupt register       offset: 0xB4
    __IO uint32_t Reserved4[1];                                                   ///< Reserved
    __IO uint32_t SMBSEXT;                                                        ///< SMBus Slave Clock Stretching Timeout Registeroffset: 0xBC
    __IO uint32_t SMBMEXT;                                                        ///< SMBus Master Clock Stretching Timeout Registeroffset: 0xC0
    __IO uint32_t SMBIDLE;                                                        ///< SMBus Bus Idle Count Register                offset: 0xC4
    __IO uint32_t SMBISR;                                                         ///< SMBus Interrupt Status Register              offset: 0xC8
    __IO uint32_t SMBIMR;                                                         ///< SMBus Interrupt Mask Register                offset: 0xCC
    __IO uint32_t SMBRAWISR;                                                      ///< SMBus RAW Interrupt Register                 offset: 0xD0
    __IO uint32_t SMBICR;                                                         ///< SMBus Combined and Independent Interrupt Clear Registersoffset: 0xD4
    __IO uint32_t OPTSAR;                                                         ///< Optional Slave Address Register              offset: 0xD8
    __IO uint32_t SMBUDIDLSB;                                                     ///< SMBus UDID LSB Register                      offset: 0xDC
    __IO uint32_t SMBUDIDMSB0;                                                    ///< SMBus UDID MSB Register 0                    offset: 0XE0
    __IO uint32_t SMBUDIDMSB1;                                                    ///< SMBus UDID MSB Register 1                    offset: 0XE4
    __IO uint32_t SMBUDIDMSB2;                                                    ///< SMBus UDID MSB Register 2                    offset: 0xE8
    __IO uint32_t SLVMASK;                                                        ///< Slave Address Mask Register                  offset: 0xEC
    __IO uint32_t SLVRCVADDR;                                                     ///< Slave Receive Address Register               offset: 0xF0
} I2C_Type;

