OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define I2C_RXDONE_RXDONE_SHIFT                 (0)
#define I2C_RXDONE_RXDONE_MASK                  (0x01U << I2C_RXDONE_RXDONE_SHIFT)
#define I2C_RXDONE_RXDONE(x)                    (((uint32_t)(((uint32_t)(x)) << I2C_RXDONE_RXDONE_SHIFT)) & I2C_RXDONE_RXDONE_MASK)

/*!
 * @brief I2C_ACTIV Register Bit Definition
 */

#define I2C_ACTIV_ACTIV_SHIFT                   (0)
#define I2C_ACTIV_ACTIV_MASK                    (0x01U << I2C_ACTIV_ACTIV_SHIFT)
#define I2C_ACTIV_ACTIV(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_ACTIV_ACTIV_SHIFT)) & I2C_ACTIV_ACTIV_MASK)

/*!
 * @brief I2C_STOP Register Bit Definition
 */

#define I2C_STOP_STOP_SHIFT                     (0)
#define I2C_STOP_STOP_MASK                      (0x01U << I2C_STOP_STOP_SHIFT)
#define I2C_STOP_STOP(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_STOP_STOP_SHIFT)) & I2C_STOP_STOP_MASK)

/*!
 * @brief I2C_START Register Bit Definition
 */

#define I2C_START_START_SHIFT                   (0)
#define I2C_START_START_MASK                    (0x01U << I2C_START_START_SHIFT)
#define I2C_START_START(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_START_START_SHIFT)) & I2C_START_START_MASK)

/*!
 * @brief I2C_GC Register Bit Definition
 */

#define I2C_GC_GC_SHIFT                         (0)
#define I2C_GC_GC_MASK                          (0x01U << I2C_GC_GC_SHIFT)
#define I2C_GC_GC(x)                            (((uint32_t)(((uint32_t)(x)) << I2C_GC_GC_SHIFT)) & I2C_GC_GC_MASK)

/*!
 * @brief I2C_ENR Register Bit Definition
 */

#define I2C_ENR_SMBALTEN_SHIFT                  (18)
#define I2C_ENR_SMBALTEN_MASK                   (0x01U << I2C_ENR_SMBALTEN_SHIFT)
#define I2C_ENR_SMBALTEN(x)                     (((uint32_t)(((uint32_t)(x)) << I2C_ENR_SMBALTEN_SHIFT)) & I2C_ENR_SMBALTEN_MASK)

#define I2C_ENR_SMBCLKRST_SHIFT                 (16)
#define I2C_ENR_SMBCLKRST_MASK                  (0x01U << I2C_ENR_SMBCLKRST_SHIFT)
#define I2C_ENR_SMBCLKRST(x)                    (((uint32_t)(((uint32_t)(x)) << I2C_ENR_SMBCLKRST_SHIFT)) & I2C_ENR_SMBCLKRST_MASK)

#define I2C_ENR_SDARCVEN_SHIFT                  (3)
#define I2C_ENR_SDARCVEN_MASK                   (0x01U << I2C_ENR_SDARCVEN_SHIFT)
#define I2C_ENR_SDARCVEN(x)                     (((uint32_t)(((uint32_t)(x)) << I2C_ENR_SDARCVEN_SHIFT)) & I2C_ENR_SDARCVEN_MASK)

#define I2C_ENR_TXCMDBLOCK_SHIFT                (2)
#define I2C_ENR_TXCMDBLOCK_MASK                 (0x01U << I2C_ENR_TXCMDBLOCK_SHIFT)
#define I2C_ENR_TXCMDBLOCK(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_ENR_TXCMDBLOCK_SHIFT)) & I2C_ENR_TXCMDBLOCK_MASK)

#define I2C_ENR_ABORT_SHIFT                     (1)
#define I2C_ENR_ABORT_MASK                      (0x01U << I2C_ENR_ABORT_SHIFT)
#define I2C_ENR_ABORT(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_ENR_ABORT_SHIFT)) & I2C_ENR_ABORT_MASK)

#define I2C_ENR_ENABLE_SHIFT                    (0)
#define I2C_ENR_ENABLE_MASK                     (0x01U << I2C_ENR_ENABLE_SHIFT)
#define I2C_ENR_ENABLE(x)                       (((uint32_t)(((uint32_t)(x)) << I2C_ENR_ENABLE_SHIFT)) & I2C_ENR_ENABLE_MASK)

/*!
 * @brief I2C_SR Register Bit Definition
 */

#define I2C_SR_SMBALT_SHIFT                     (20)
#define I2C_SR_SMBALT_MASK                      (0x01U << I2C_SR_SMBALT_SHIFT)
#define I2C_SR_SMBALT(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_SR_SMBALT_SHIFT)) & I2C_SR_SMBALT_MASK)

#define I2C_SR_SMBSLVAR_SHIFT                   (18)
#define I2C_SR_SMBSLVAR_MASK                    (0x01U << I2C_SR_SMBSLVAR_SHIFT)
#define I2C_SR_SMBSLVAR(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_SR_SMBSLVAR_SHIFT)) & I2C_SR_SMBSLVAR_MASK)

#define I2C_SR_SMBSLVAV_SHIFT                   (17)
#define I2C_SR_SMBSLVAV_MASK                    (0x01U << I2C_SR_SMBSLVAV_SHIFT)
#define I2C_SR_SMBSLVAV(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_SR_SMBSLVAV_SHIFT)) & I2C_SR_SMBSLVAV_MASK)

#define I2C_SR_SMBQC_SHIFT                      (16)
#define I2C_SR_SMBQC_MASK                       (0x01U << I2C_SR_SMBQC_SHIFT)
#define I2C_SR_SMBQC(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_SR_SMBQC_SHIFT)) & I2C_SR_SMBQC_MASK)

#define I2C_SR_SDANOTRECOVERED_SHIFT            (11)
#define I2C_SR_SDANOTRECOVERED_MASK             (0x01U << I2C_SR_SDANOTRECOVERED_SHIFT)
#define I2C_SR_SDANOTRECOVERED(x)               (((uint32_t)(((uint32_t)(x)) << I2C_SR_SDANOTRECOVERED_SHIFT)) & I2C_SR_SDANOTRECOVERED_MASK)

#define I2C_SR_SLVHOLDRXFULL_SHIFT              (10)
#define I2C_SR_SLVHOLDRXFULL_MASK               (0x01U << I2C_SR_SLVHOLDRXFULL_SHIFT)
#define I2C_SR_SLVHOLDRXFULL(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SR_SLVHOLDRXFULL_SHIFT)) & I2C_SR_SLVHOLDRXFULL_MASK)

#define I2C_SR_SLVHOLDTXEMPTY_SHIFT             (9)
#define I2C_SR_SLVHOLDTXEMPTY_MASK              (0x01U << I2C_SR_SLVHOLDTXEMPTY_SHIFT)
#define I2C_SR_SLVHOLDTXEMPTY(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SR_SLVHOLDTXEMPTY_SHIFT)) & I2C_SR_SLVHOLDTXEMPTY_MASK)

#define I2C_SR_MSTHOLDRXFULL_SHIFT              (8)
#define I2C_SR_MSTHOLDRXFULL_MASK               (0x01U << I2C_SR_MSTHOLDRXFULL_SHIFT)
#define I2C_SR_MSTHOLDRXFULL(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SR_MSTHOLDRXFULL_SHIFT)) & I2C_SR_MSTHOLDRXFULL_MASK)

#define I2C_SR_MSTHOLDTXEMPTY_SHIFT             (7)
#define I2C_SR_MSTHOLDTXEMPTY_MASK              (0x01U << I2C_SR_MSTHOLDTXEMPTY_SHIFT)
#define I2C_SR_MSTHOLDTXEMPTY(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SR_MSTHOLDTXEMPTY_SHIFT)) & I2C_SR_MSTHOLDTXEMPTY_MASK)

#define I2C_SR_SLVACTIV_SHIFT                   (6)
#define I2C_SR_SLVACTIV_MASK                    (0x01U << I2C_SR_SLVACTIV_SHIFT)
#define I2C_SR_SLVACTIV(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_SR_SLVACTIV_SHIFT)) & I2C_SR_SLVACTIV_MASK)

#define I2C_SR_MSTACTIV_SHIFT                   (5)
#define I2C_SR_MSTACTIV_MASK                    (0x01U << I2C_SR_MSTACTIV_SHIFT)
#define I2C_SR_MSTACTIV(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_SR_MSTACTIV_SHIFT)) & I2C_SR_MSTACTIV_MASK)

#define I2C_SR_RFF_SHIFT                        (4)
#define I2C_SR_RFF_MASK                         (0x01U << I2C_SR_RFF_SHIFT)
#define I2C_SR_RFF(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_SR_RFF_SHIFT)) & I2C_SR_RFF_MASK)

#define I2C_SR_RFNE_SHIFT                       (3)
#define I2C_SR_RFNE_MASK                        (0x01U << I2C_SR_RFNE_SHIFT)
#define I2C_SR_RFNE(x)                          (((uint32_t)(((uint32_t)(x)) << I2C_SR_RFNE_SHIFT)) & I2C_SR_RFNE_MASK)

#define I2C_SR_TFE_SHIFT                        (2)
#define I2C_SR_TFE_MASK                         (0x01U << I2C_SR_TFE_SHIFT)
#define I2C_SR_TFE(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_SR_TFE_SHIFT)) & I2C_SR_TFE_MASK)

