OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define I2C_SR_TFNF_SHIFT                       (1)
#define I2C_SR_TFNF_MASK                        (0x01U << I2C_SR_TFNF_SHIFT)
#define I2C_SR_TFNF(x)                          (((uint32_t)(((uint32_t)(x)) << I2C_SR_TFNF_SHIFT)) & I2C_SR_TFNF_MASK)

#define I2C_SR_ACTIV_SHIFT                      (0)
#define I2C_SR_ACTIV_MASK                       (0x01U << I2C_SR_ACTIV_SHIFT)
#define I2C_SR_ACTIV(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_SR_ACTIV_SHIFT)) & I2C_SR_ACTIV_MASK)

/*!
 * @brief I2C_TXFLR Register Bit Definition
 */

#define I2C_TXFLR_CNT_SHIFT                     (0)
#define I2C_TXFLR_CNT_MASK                      (0x7U << I2C_TXFLR_CNT_SHIFT)
#define I2C_TXFLR_CNT(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_TXFLR_CNT_SHIFT)) & I2C_TXFLR_CNT_MASK)

/*!
 * @brief I2C_RXFLR Register Bit Definition
 */

#define I2C_RXFLR_CNT_SHIFT                     (0)
#define I2C_RXFLR_CNT_MASK                      (0x7U << I2C_RXFLR_CNT_SHIFT)
#define I2C_RXFLR_CNT(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_RXFLR_CNT_SHIFT)) & I2C_RXFLR_CNT_MASK)

/*!
 * @brief I2C_HOLD Register Bit Definition
 */

#define I2C_HOLD_RXHOLD_SHIFT                   (16)
#define I2C_HOLD_RXHOLD_MASK                    (0xFFU << I2C_HOLD_RXHOLD_SHIFT)
#define I2C_HOLD_RXHOLD(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_HOLD_RXHOLD_SHIFT)) & I2C_HOLD_RXHOLD_MASK)

#define I2C_HOLD_TXHOLD_SHIFT                   (0)
#define I2C_HOLD_TXHOLD_MASK                    (0xFFFFU << I2C_HOLD_TXHOLD_SHIFT)
#define I2C_HOLD_TXHOLD(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_HOLD_TXHOLD_SHIFT)) & I2C_HOLD_TXHOLD_MASK)

/*!
 * @brief I2C_TX_ABRT_SRC Register Bit Definition
 */

#define I2C_TXABRTSRC_TXFLUSHCNT_SHIFT          (23)
#define I2C_TXABRTSRC_TXFLUSHCNT_MASK           (0x1FFU << I2C_TXABRTSRC_TXFLUSHCNT_SHIFT)
#define I2C_TXABRTSRC_TXFLUSHCNT(x)             (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_TXFLUSHCNT_SHIFT)) & I2C_TXABRTSRC_TXFLUSHCNT_MASK)

#define I2C_TXABRTSRC_SDALOW_SHIFT              (17)
#define I2C_TXABRTSRC_SDALOW_MASK               (0x01U << I2C_TXABRTSRC_SDALOW_SHIFT)
#define I2C_TXABRTSRC_SDALOW(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_SDALOW_SHIFT)) & I2C_TXABRTSRC_SDALOW_MASK)

#define I2C_TXABRTSRC_USERABRT_SHIFT            (16)
#define I2C_TXABRTSRC_USERABRT_MASK             (0x01U << I2C_TXABRTSRC_USERABRT_SHIFT)
#define I2C_TXABRTSRC_USERABRT(x)               (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_USERABRT_SHIFT)) & I2C_TXABRTSRC_USERABRT_MASK)

#define I2C_TXABRTSRC_SLVRDINTX_SHIFT           (15)
#define I2C_TXABRTSRC_SLVRDINTX_MASK            (0x01U << I2C_TXABRTSRC_SLVRDINTX_SHIFT)
#define I2C_TXABRTSRC_SLVRDINTX(x)              (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_SLVRDINTX_SHIFT)) & I2C_TXABRTSRC_SLVRDINTX_MASK)

#define I2C_TXABRTSRC_SLVARBLOST_SHIFT          (14)
#define I2C_TXABRTSRC_SLVARBLOST_MASK           (0x01U << I2C_TXABRTSRC_SLVARBLOST_SHIFT)
#define I2C_TXABRTSRC_SLVARBLOST(x)             (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_SLVARBLOST_SHIFT)) & I2C_TXABRTSRC_SLVARBLOST_MASK)

#define I2C_TXABRTSRC_SLVFLUSHTXFIFO_SHIFT      (13)
#define I2C_TXABRTSRC_SLVFLUSHTXFIFO_MASK       (0x01U << I2C_TXABRTSRC_SLVFLUSHTXFIFO_SHIFT)
#define I2C_TXABRTSRC_SLVFLUSHTXFIFO(x)         (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_SLVFLUSHTXFIFO_SHIFT)) & I2C_TXABRTSRC_SLVFLUSHTXFIFO_MASK)

#define I2C_TXABRTSRC_LOST_SHIFT                (12)
#define I2C_TXABRTSRC_LOST_MASK                 (0x01U << I2C_TXABRTSRC_LOST_SHIFT)
#define I2C_TXABRTSRC_LOST(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_LOST_SHIFT)) & I2C_TXABRTSRC_LOST_MASK)

#define I2C_TXABRTSRC_MSTDIS_SHIFT              (11)
#define I2C_TXABRTSRC_MSTDIS_MASK               (0x01U << I2C_TXABRTSRC_MSTDIS_SHIFT)
#define I2C_TXABRTSRC_MSTDIS(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_MSTDIS_SHIFT)) & I2C_TXABRTSRC_MSTDIS_MASK)

#define I2C_TXABRTSRC_10BRDNORSTRT_SHIFT        (10)
#define I2C_TXABRTSRC_10BRDNORSTRT_MASK         (0x01U << I2C_TXABRTSRC_10BRDNORSTRT_SHIFT)
#define I2C_TXABRTSRC_10BRDNORSTRT(x)           (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_10BRDNORSTRT_SHIFT)) & I2C_TXABRTSRC_10BRDNORSTRT_MASK)

#define I2C_TXABRTSRC_SBYTENORSTRT_SHIFT        (9)
#define I2C_TXABRTSRC_SBYTENORSTRT_MASK         (0x01U << I2C_TXABRTSRC_SBYTENORSTRT_SHIFT)
#define I2C_TXABRTSRC_SBYTENORSTRT(x)           (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_SBYTENORSTRT_SHIFT)) & I2C_TXABRTSRC_SBYTENORSTRT_MASK)

#define I2C_TXABRTSRC_SBYTEACKDET_SHIFT         (7)
#define I2C_TXABRTSRC_SBYTEACKDET_MASK          (0x01U << I2C_TXABRTSRC_SBYTEACKDET_SHIFT)
#define I2C_TXABRTSRC_SBYTEACKDET(x)            (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_SBYTEACKDET_SHIFT)) & I2C_TXABRTSRC_SBYTEACKDET_MASK)

#define I2C_TXABRTSRC_GCREAD_SHIFT              (5)
#define I2C_TXABRTSRC_GCREAD_MASK               (0x01U << I2C_TXABRTSRC_GCREAD_SHIFT)
#define I2C_TXABRTSRC_GCREAD(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_GCREAD_SHIFT)) & I2C_TXABRTSRC_GCREAD_MASK)

#define I2C_TXABRTSRC_GCNOACK_SHIFT             (4)
#define I2C_TXABRTSRC_GCNOACK_MASK              (0x01U << I2C_TXABRTSRC_GCNOACK_SHIFT)
#define I2C_TXABRTSRC_GCNOACK(x)                (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_GCNOACK_SHIFT)) & I2C_TXABRTSRC_GCNOACK_MASK)

#define I2C_TXABRTSRC_TXDATANOACK_SHIFT         (3)
#define I2C_TXABRTSRC_TXDATANOACK_MASK          (0x01U << I2C_TXABRTSRC_TXDATANOACK_SHIFT)
#define I2C_TXABRTSRC_TXDATANOACK(x)            (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_TXDATANOACK_SHIFT)) & I2C_TXABRTSRC_TXDATANOACK_MASK)

#define I2C_TXABRTSRC_10ADDR2NOACK_SHIFT        (2)
#define I2C_TXABRTSRC_10ADDR2NOACK_MASK         (0x01U << I2C_TXABRTSRC_10ADDR2NOACK_SHIFT)
#define I2C_TXABRTSRC_10ADDR2NOACK(x)           (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_10ADDR2NOACK_SHIFT)) & I2C_TXABRTSRC_10ADDR2NOACK_MASK)

#define I2C_TXABRTSRC_10ADDR1NOACK_SHIFT        (1)
#define I2C_TXABRTSRC_10ADDR1NOACK_MASK         (0x01U << I2C_TXABRTSRC_10ADDR1NOACK_SHIFT)
#define I2C_TXABRTSRC_10ADDR1NOACK(x)           (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_10ADDR1NOACK_SHIFT)) & I2C_TXABRTSRC_10ADDR1NOACK_MASK)

#define I2C_TXABRTSRC_7ADDRNOACK_SHIFT          (0)
#define I2C_TXABRTSRC_7ADDRNOACK_MASK           (0x01U << I2C_TXABRTSRC_7ADDRNOACK_SHIFT)
#define I2C_TXABRTSRC_7ADDRNOACK(x)             (((uint32_t)(((uint32_t)(x)) << I2C_TXABRTSRC_7ADDRNOACK_SHIFT)) & I2C_TXABRTSRC_7ADDRNOACK_MASK)

/*!
 * @brief I2C_SLV_NACK Register Bit Definition
 */

#define I2C_SLVNACK_NACK_SHIFT                  (0)
#define I2C_SLVNACK_NACK_MASK                   (0x01U << I2C_SLVNACK_NACK_SHIFT)
#define I2C_SLVNACK_NACK(x)                     (((uint32_t)(((uint32_t)(x)) << I2C_SLVNACK_NACK_SHIFT)) & I2C_SLVNACK_NACK_MASK)

/*!
 * @brief I2C_DMA Register Bit Definition
 */

