OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define I2C_DMA_TXEN_SHIFT                      (1)
#define I2C_DMA_TXEN_MASK                       (0x01U << I2C_DMA_TXEN_SHIFT)
#define I2C_DMA_TXEN(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_DMA_TXEN_SHIFT)) & I2C_DMA_TXEN_MASK)

#define I2C_DMA_RXEN_SHIFT                      (0)
#define I2C_DMA_RXEN_MASK                       (0x01U << I2C_DMA_RXEN_SHIFT)
#define I2C_DMA_RXEN(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_DMA_RXEN_SHIFT)) & I2C_DMA_RXEN_MASK)

/*!
 * @brief I2C_SETUP Register Bit Definition
 */

#define I2C_SETUP_CNT_SHIFT                     (0)
#define I2C_SETUP_CNT_MASK                      (0xFFU << I2C_SETUP_CNT_SHIFT)
#define I2C_SETUP_CNT(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_SETUP_CNT_SHIFT)) & I2C_SETUP_CNT_MASK)

/*!
 * @brief I2C_GCR Register Bit Definition
 */

#define I2C_GCR_GC_SHIFT                        (0)
#define I2C_GCR_GC_MASK                         (0x01U << I2C_GCR_GC_SHIFT)
#define I2C_GCR_GC(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_GCR_GC_SHIFT)) & I2C_GCR_GC_MASK)

/*!
 * @brief I2C_EN_SR Register Bit Definition
 */

#define I2C_ENSR_SLVRXDATALOST_SHIFT            (2)
#define I2C_ENSR_SLVRXDATALOST_MASK             (0x01U << I2C_ENSR_SLVRXDATALOST_SHIFT)
#define I2C_ENSR_SLVRXDATALOST(x)               (((uint32_t)(((uint32_t)(x)) << I2C_ENSR_SLVRXDATALOST_SHIFT)) & I2C_ENSR_SLVRXDATALOST_MASK)

#define I2C_ENSR_SLVDISWHILEBUSY_SHIFT          (1)
#define I2C_ENSR_SLVDISWHILEBUSY_MASK           (0x01U << I2C_ENSR_SLVDISWHILEBUSY_SHIFT)
#define I2C_ENSR_SLVDISWHILEBUSY(x)             (((uint32_t)(((uint32_t)(x)) << I2C_ENSR_SLVDISWHILEBUSY_SHIFT)) & I2C_ENSR_SLVDISWHILEBUSY_MASK)

#define I2C_ENSR_ICEN_SHIFT                     (0)
#define I2C_ENSR_ICEN_MASK                      (0x01U << I2C_ENSR_ICEN_SHIFT)
#define I2C_ENSR_ICEN(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_ENSR_ICEN_SHIFT)) & I2C_ENSR_ICEN_MASK)

/*!
 * @brief I2C_SPKLEN Register Bit Definition
 */

#define I2C_SPKLEN_SPKLEN_SHIFT                 (0)
#define I2C_SPKLEN_SPKLEN_MASK                  (0xFFU << I2C_SPKLEN_SPKLEN_SHIFT)
#define I2C_SPKLEN_SPKLEN(x)                    (((uint32_t)(((uint32_t)(x)) << I2C_SPKLEN_SPKLEN_SHIFT)) & I2C_SPKLEN_SPKLEN_MASK)

/*!
 * @brief I2C_SCL_TMO Register Bit Definition
 */

#define I2C_SCLTMO_SCLTIMEOUT_SHIFT             (0)
#define I2C_SCLTMO_SCLTIMEOUT_MASK              (0xFFFFFFFFU << I2C_SCLTMO_SCLTIMEOUT_SHIFT)
#define I2C_SCLTMO_SCLTIMEOUT(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SCLTMO_SCLTIMEOUT_SHIFT)) & I2C_SCLTMO_SCLTIMEOUT_MASK)

/*!
 * @brief I2C_SDA_TMO Register Bit Definition
 */

#define I2C_SDATMO_SDATIMEOUT_SHIFT             (0)
#define I2C_SDATMO_SDATIMEOUT_MASK              (0xFFFFFFFFU << I2C_SDATMO_SDATIMEOUT_SHIFT)
#define I2C_SDATMO_SDATIMEOUT(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SDATMO_SDATIMEOUT_SHIFT)) & I2C_SDATMO_SDATIMEOUT_MASK)

/*!
 * @brief I2C_SCL_STUCK Register Bit Definition
 */

#define I2C_SCLSTUCK_SCLSTUCK_SHIFT             (0)
#define I2C_SCLSTUCK_SCLSTUCK_MASK              (0x01U << I2C_SCLSTUCK_SCLSTUCK_SHIFT)
#define I2C_SCLSTUCK_SCLSTUCK(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SCLSTUCK_SCLSTUCK_SHIFT)) & I2C_SCLSTUCK_SCLSTUCK_MASK)

/*!
 * @brief I2C_SMB_SEXT Register Bit Definition
 */

#define I2C_SMBSEXT_SMBSEXT_SHIFT               (0)
#define I2C_SMBSEXT_SMBSEXT_MASK                (0xFFFFFFFFU << I2C_SMBSEXT_SMBSEXT_SHIFT)
#define I2C_SMBSEXT_SMBSEXT(x)                  (((uint32_t)(((uint32_t)(x)) << I2C_SMBSEXT_SMBSEXT_SHIFT)) & I2C_SMBSEXT_SMBSEXT_MASK)

/*!
 * @brief I2C_SMB_MEXT Register Bit Definition
 */

#define I2C_SMBMEXT_SMBMEXT_SHIFT               (0)
#define I2C_SMBMEXT_SMBMEXT_MASK                (0xFFFFFFFFU << I2C_SMBMEXT_SMBMEXT_SHIFT)
#define I2C_SMBMEXT_SMBMEXT(x)                  (((uint32_t)(((uint32_t)(x)) << I2C_SMBMEXT_SMBMEXT_SHIFT)) & I2C_SMBMEXT_SMBMEXT_MASK)

/*!
 * @brief I2C_SMB_IDLE Register Bit Definition
 */

#define I2C_SMBIDLE_SMBIDLECNT_SHIFT            (0)
#define I2C_SMBIDLE_SMBIDLECNT_MASK             (0xFFFFU << I2C_SMBIDLE_SMBIDLECNT_SHIFT)
#define I2C_SMBIDLE_SMBIDLECNT(x)               (((uint32_t)(((uint32_t)(x)) << I2C_SMBIDLE_SMBIDLECNT_SHIFT)) & I2C_SMBIDLE_SMBIDLECNT_MASK)

/*!
 * @brief I2C_SMB_ISR Register Bit Definition
 */

#define I2C_SMBISR_RSMBALT_SHIFT                (10)
#define I2C_SMBISR_RSMBALT_MASK                 (0x01U << I2C_SMBISR_RSMBALT_SHIFT)
#define I2C_SMBISR_RSMBALT(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RSMBALT_SHIFT)) & I2C_SMBISR_RSMBALT_MASK)

#define I2C_SMBISR_RPECNACK_SHIFT               (8)
#define I2C_SMBISR_RPECNACK_MASK                (0x01U << I2C_SMBISR_RPECNACK_SHIFT)
#define I2C_SMBISR_RPECNACK(x)                  (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RPECNACK_SHIFT)) & I2C_SMBISR_RPECNACK_MASK)

#define I2C_SMBISR_RARPASSGN_SHIFT              (7)
#define I2C_SMBISR_RARPASSGN_MASK               (0x01U << I2C_SMBISR_RARPASSGN_SHIFT)
#define I2C_SMBISR_RARPASSGN(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RARPASSGN_SHIFT)) & I2C_SMBISR_RARPASSGN_MASK)

#define I2C_SMBISR_RARPUDID_SHIFT               (6)
#define I2C_SMBISR_RARPUDID_MASK                (0x01U << I2C_SMBISR_RARPUDID_SHIFT)
#define I2C_SMBISR_RARPUDID(x)                  (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RARPUDID_SHIFT)) & I2C_SMBISR_RARPUDID_MASK)

#define I2C_SMBISR_RARPRST_SHIFT                (5)
#define I2C_SMBISR_RARPRST_MASK                 (0x01U << I2C_SMBISR_RARPRST_SHIFT)
#define I2C_SMBISR_RARPRST(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RARPRST_SHIFT)) & I2C_SMBISR_RARPRST_MASK)

#define I2C_SMBISR_RARPPRE_SHIFT                (4)
#define I2C_SMBISR_RARPPRE_MASK                 (0x01U << I2C_SMBISR_RARPPRE_SHIFT)
#define I2C_SMBISR_RARPPRE(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RARPPRE_SHIFT)) & I2C_SMBISR_RARPPRE_MASK)

#define I2C_SMBISR_RARPNOTIFY_SHIFT             (3)
#define I2C_SMBISR_RARPNOTIFY_MASK              (0x01U << I2C_SMBISR_RARPNOTIFY_SHIFT)
#define I2C_SMBISR_RARPNOTIFY(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RARPNOTIFY_SHIFT)) & I2C_SMBISR_RARPNOTIFY_MASK)

