OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define I2C_SMBISR_RARPQUICK_SHIFT              (2)
#define I2C_SMBISR_RARPQUICK_MASK               (0x01U << I2C_SMBISR_RARPQUICK_SHIFT)
#define I2C_SMBISR_RARPQUICK(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RARPQUICK_SHIFT)) & I2C_SMBISR_RARPQUICK_MASK)

#define I2C_SMBISR_RMSTTMO_SHIFT                (1)
#define I2C_SMBISR_RMSTTMO_MASK                 (0x01U << I2C_SMBISR_RMSTTMO_SHIFT)
#define I2C_SMBISR_RMSTTMO(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RMSTTMO_SHIFT)) & I2C_SMBISR_RMSTTMO_MASK)

#define I2C_SMBISR_RSLVTMO_SHIFT                (0)
#define I2C_SMBISR_RSLVTMO_MASK                 (0x01U << I2C_SMBISR_RSLVTMO_SHIFT)
#define I2C_SMBISR_RSLVTMO(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBISR_RSLVTMO_SHIFT)) & I2C_SMBISR_RSLVTMO_MASK)

/*!
 * @brief I2C_SMB_IMR Register Bit Definition
 */

#define I2C_SMBIMR_MSMBALT_SHIFT                (10)
#define I2C_SMBIMR_MSMBALT_MASK                 (0x01U << I2C_SMBIMR_MSMBALT_SHIFT)
#define I2C_SMBIMR_MSMBALT(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MSMBALT_SHIFT)) & I2C_SMBIMR_MSMBALT_MASK)

#define I2C_SMBIMR_MPECNACK_SHIFT               (8)
#define I2C_SMBIMR_MPECNACK_MASK                (0x01U << I2C_SMBIMR_MPECNACK_SHIFT)
#define I2C_SMBIMR_MPECNACK(x)                  (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MPECNACK_SHIFT)) & I2C_SMBIMR_MPECNACK_MASK)

#define I2C_SMBIMR_MARPASSGN_SHIFT              (7)
#define I2C_SMBIMR_MARPASSGN_MASK               (0x01U << I2C_SMBIMR_MARPASSGN_SHIFT)
#define I2C_SMBIMR_MARPASSGN(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MARPASSGN_SHIFT)) & I2C_SMBIMR_MARPASSGN_MASK)

#define I2C_SMBIMR_MARPUDID_SHIFT               (6)
#define I2C_SMBIMR_MARPUDID_MASK                (0x01U << I2C_SMBIMR_MARPUDID_SHIFT)
#define I2C_SMBIMR_MARPUDID(x)                  (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MARPUDID_SHIFT)) & I2C_SMBIMR_MARPUDID_MASK)

#define I2C_SMBIMR_MARPRST_SHIFT                (5)
#define I2C_SMBIMR_MARPRST_MASK                 (0x01U << I2C_SMBIMR_MARPRST_SHIFT)
#define I2C_SMBIMR_MARPRST(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MARPRST_SHIFT)) & I2C_SMBIMR_MARPRST_MASK)

#define I2C_SMBIMR_MARPPRE_SHIFT                (4)
#define I2C_SMBIMR_MARPPRE_MASK                 (0x01U << I2C_SMBIMR_MARPPRE_SHIFT)
#define I2C_SMBIMR_MARPPRE(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MARPPRE_SHIFT)) & I2C_SMBIMR_MARPPRE_MASK)

#define I2C_SMBIMR_MARPNOTIFY_SHIFT             (3)
#define I2C_SMBIMR_MARPNOTIFY_MASK              (0x01U << I2C_SMBIMR_MARPNOTIFY_SHIFT)
#define I2C_SMBIMR_MARPNOTIFY(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MARPNOTIFY_SHIFT)) & I2C_SMBIMR_MARPNOTIFY_MASK)

#define I2C_SMBIMR_MARPQUICK_SHIFT              (2)
#define I2C_SMBIMR_MARPQUICK_MASK               (0x01U << I2C_SMBIMR_MARPQUICK_SHIFT)
#define I2C_SMBIMR_MARPQUICK(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MARPQUICK_SHIFT)) & I2C_SMBIMR_MARPQUICK_MASK)

#define I2C_SMBIMR_MMSTTMO_SHIFT                (1)
#define I2C_SMBIMR_MMSTTMO_MASK                 (0x01U << I2C_SMBIMR_MMSTTMO_SHIFT)
#define I2C_SMBIMR_MMSTTMO(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MMSTTMO_SHIFT)) & I2C_SMBIMR_MMSTTMO_MASK)

#define I2C_SMBIMR_MSLVTMO_SHIFT                (0)
#define I2C_SMBIMR_MSLVTMO_MASK                 (0x01U << I2C_SMBIMR_MSLVTMO_SHIFT)
#define I2C_SMBIMR_MSLVTMO(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_SMBIMR_MSLVTMO_SHIFT)) & I2C_SMBIMR_MSLVTMO_MASK)

/*!
 * @brief I2C_SMB_RAWISR Register Bit Definition
 */

#define I2C_SMBRAWISR_SMBALT_SHIFT              (10)
#define I2C_SMBRAWISR_SMBALT_MASK               (0x01U << I2C_SMBRAWISR_SMBALT_SHIFT)
#define I2C_SMBRAWISR_SMBALT(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_SMBALT_SHIFT)) & I2C_SMBRAWISR_SMBALT_MASK)

#define I2C_SMBRAWISR_PECNACK_SHIFT             (8)
#define I2C_SMBRAWISR_PECNACK_MASK              (0x01U << I2C_SMBRAWISR_PECNACK_SHIFT)
#define I2C_SMBRAWISR_PECNACK(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_PECNACK_SHIFT)) & I2C_SMBRAWISR_PECNACK_MASK)

#define I2C_SMBRAWISR_ARPASSGN_SHIFT            (7)
#define I2C_SMBRAWISR_ARPASSGN_MASK             (0x01U << I2C_SMBRAWISR_ARPASSGN_SHIFT)
#define I2C_SMBRAWISR_ARPASSGN(x)               (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_ARPASSGN_SHIFT)) & I2C_SMBRAWISR_ARPASSGN_MASK)

#define I2C_SMBRAWISR_ARPUDID_SHIFT             (6)
#define I2C_SMBRAWISR_ARPUDID_MASK              (0x01U << I2C_SMBRAWISR_ARPUDID_SHIFT)
#define I2C_SMBRAWISR_ARPUDID(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_ARPUDID_SHIFT)) & I2C_SMBRAWISR_ARPUDID_MASK)

#define I2C_SMBRAWISR_ARPRST_SHIFT              (5)
#define I2C_SMBRAWISR_ARPRST_MASK               (0x01U << I2C_SMBRAWISR_ARPRST_SHIFT)
#define I2C_SMBRAWISR_ARPRST(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_ARPRST_SHIFT)) & I2C_SMBRAWISR_ARPRST_MASK)

#define I2C_SMBRAWISR_ARPPRE_SHIFT              (4)
#define I2C_SMBRAWISR_ARPPRE_MASK               (0x01U << I2C_SMBRAWISR_ARPPRE_SHIFT)
#define I2C_SMBRAWISR_ARPPRE(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_ARPPRE_SHIFT)) & I2C_SMBRAWISR_ARPPRE_MASK)

#define I2C_SMBRAWISR_ARPNOTIFY_SHIFT           (3)
#define I2C_SMBRAWISR_ARPNOTIFY_MASK            (0x01U << I2C_SMBRAWISR_ARPNOTIFY_SHIFT)
#define I2C_SMBRAWISR_ARPNOTIFY(x)              (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_ARPNOTIFY_SHIFT)) & I2C_SMBRAWISR_ARPNOTIFY_MASK)

#define I2C_SMBRAWISR_ARPQUICK_SHIFT            (2)
#define I2C_SMBRAWISR_ARPQUICK_MASK             (0x01U << I2C_SMBRAWISR_ARPQUICK_SHIFT)
#define I2C_SMBRAWISR_ARPQUICK(x)               (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_ARPQUICK_SHIFT)) & I2C_SMBRAWISR_ARPQUICK_MASK)

#define I2C_SMBRAWISR_MSTTMO_SHIFT              (1)
#define I2C_SMBRAWISR_MSTTMO_MASK               (0x01U << I2C_SMBRAWISR_MSTTMO_SHIFT)
#define I2C_SMBRAWISR_MSTTMO(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_MSTTMO_SHIFT)) & I2C_SMBRAWISR_MSTTMO_MASK)

#define I2C_SMBRAWISR_SLVTMO_SHIFT              (0)
#define I2C_SMBRAWISR_SLVTMO_MASK               (0x01U << I2C_SMBRAWISR_SLVTMO_SHIFT)
#define I2C_SMBRAWISR_SLVTMO(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBRAWISR_SLVTMO_SHIFT)) & I2C_SMBRAWISR_SLVTMO_MASK)

/*!
 * @brief I2C_SMB_ICR Register Bit Definition
 */

#define I2C_SMBICR_CLRSMBALT_SHIFT              (10)
#define I2C_SMBICR_CLRSMBALT_MASK               (0x01U << I2C_SMBICR_CLRSMBALT_SHIFT)
#define I2C_SMBICR_CLRSMBALT(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRSMBALT_SHIFT)) & I2C_SMBICR_CLRSMBALT_MASK)

#define I2C_SMBICR_CLRPECNACK_SHIFT             (8)
#define I2C_SMBICR_CLRPECNACK_MASK              (0x01U << I2C_SMBICR_CLRPECNACK_SHIFT)
#define I2C_SMBICR_CLRPECNACK(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRPECNACK_SHIFT)) & I2C_SMBICR_CLRPECNACK_MASK)

#define I2C_SMBICR_CLRARPASSGN_SHIFT            (7)
#define I2C_SMBICR_CLRARPASSGN_MASK             (0x01U << I2C_SMBICR_CLRARPASSGN_SHIFT)
#define I2C_SMBICR_CLRARPASSGN(x)               (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRARPASSGN_SHIFT)) & I2C_SMBICR_CLRARPASSGN_MASK)

#define I2C_SMBICR_CLRARPUDID_SHIFT             (6)
#define I2C_SMBICR_CLRARPUDID_MASK              (0x01U << I2C_SMBICR_CLRARPUDID_SHIFT)
#define I2C_SMBICR_CLRARPUDID(x)                (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRARPUDID_SHIFT)) & I2C_SMBICR_CLRARPUDID_MASK)

#define I2C_SMBICR_CLRARPRST_SHIFT              (5)
#define I2C_SMBICR_CLRARPRST_MASK               (0x01U << I2C_SMBICR_CLRARPRST_SHIFT)
#define I2C_SMBICR_CLRARPRST(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRARPRST_SHIFT)) & I2C_SMBICR_CLRARPRST_MASK)

