OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
/*******************************************************************************
 * LPT Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CFG;                                                            ///< LPTIM Configuration Register                 offset: 0x00
    __IO uint32_t IE;                                                             ///< LPTIM Interrupt Enable Register              offset: 0x04
    __IO uint32_t IF;                                                             ///< LPTIM Interrupt Flag Register                offset: 0x08
    __IO uint32_t CTRL;                                                           ///< LPTIM Control Register                       offset: 0x0C
    __IO uint32_t CNT;                                                            ///< LPTIM count register                         offset: 0x10
    __IO uint32_t CMP;                                                            ///< LPTIM Compare Value Register                 offset: 0x14
    __IO uint32_t TARGET;                                                         ///< LPTIM target value register                  offset: 0x18
} LPTIM_Type;

/*******************************************************************************
 * LPT Type
 ******************************************************************************/

/*!
 * @addtogroup LPTIM_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief LPTIM_CFG Register Bit Definition
 */

#define LPTIM_CFG_FLTEN_SHIFT                     (15)
#define LPTIM_CFG_FLTEN_MASK                      (0x01U << LPTIM_CFG_FLTEN_SHIFT)
#define LPTIM_CFG_FLTEN(x)                        (((uint32_t)(((uint32_t)(x)) << LPTIM_CFG_FLTEN_SHIFT)) & LPTIM_CFG_FLTEN_MASK)

#define LPTIM_CFG_DIVSEL_SHIFT                    (8)
#define LPTIM_CFG_DIVSEL_MASK                     (0x7U << LPTIM_CFG_DIVSEL_SHIFT)
#define LPTIM_CFG_DIVSEL(x)                       (((uint32_t)(((uint32_t)(x)) << LPTIM_CFG_DIVSEL_SHIFT)) & LPTIM_CFG_DIVSEL_MASK)

#define LPTIM_CFG_TRIGCFG_SHIFT                   (6)
#define LPTIM_CFG_TRIGCFG_MASK                    (0x3U << LPTIM_CFG_TRIGCFG_SHIFT)
#define LPTIM_CFG_TRIGCFG(x)                      (((uint32_t)(((uint32_t)(x)) << LPTIM_CFG_TRIGCFG_SHIFT)) & LPTIM_CFG_TRIGCFG_MASK)

#define LPTIM_CFG_TRIGSEL_SHIFT                   (5)
#define LPTIM_CFG_TRIGSEL_MASK                    (0x01U << LPTIM_CFG_TRIGSEL_SHIFT)
#define LPTIM_CFG_TRIGSEL(x)                      (((uint32_t)(((uint32_t)(x)) << LPTIM_CFG_TRIGSEL_SHIFT)) & LPTIM_CFG_TRIGSEL_MASK)

#define LPTIM_CFG_POLARITY_SHIFT                  (4)
#define LPTIM_CFG_POLARITY_MASK                   (0x01U << LPTIM_CFG_POLARITY_SHIFT)
#define LPTIM_CFG_POLARITY(x)                     (((uint32_t)(((uint32_t)(x)) << LPTIM_CFG_POLARITY_SHIFT)) & LPTIM_CFG_POLARITY_MASK)

#define LPTIM_CFG_PWM_SHIFT                       (3)
#define LPTIM_CFG_PWM_MASK                        (0x01U << LPTIM_CFG_PWM_SHIFT)
#define LPTIM_CFG_PWM(x)                          (((uint32_t)(((uint32_t)(x)) << LPTIM_CFG_PWM_SHIFT)) & LPTIM_CFG_PWM_MASK)

#define LPTIM_CFG_TMODE_SHIFT                     (1)
#define LPTIM_CFG_TMODE_MASK                      (0x3U << LPTIM_CFG_TMODE_SHIFT)
#define LPTIM_CFG_TMODE(x)                        (((uint32_t)(((uint32_t)(x)) << LPTIM_CFG_TMODE_SHIFT)) & LPTIM_CFG_TMODE_MASK)

#define LPTIM_CFG_MODE_SHIFT                      (0)
#define LPTIM_CFG_MODE_MASK                       (0x01U << LPTIM_CFG_MODE_SHIFT)
#define LPTIM_CFG_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << LPTIM_CFG_MODE_SHIFT)) & LPTIM_CFG_MODE_MASK)

/*!
 * @brief LPTIM_IE Register Bit Definition
 */

#define LPTIM_IE_COMPIE_SHIFT                     (2)
#define LPTIM_IE_COMPIE_MASK                      (0x01U << LPTIM_IE_COMPIE_SHIFT)
#define LPTIM_IE_COMPIE(x)                        (((uint32_t)(((uint32_t)(x)) << LPTIM_IE_COMPIE_SHIFT)) & LPTIM_IE_COMPIE_MASK)

#define LPTIM_IE_TRIGIE_SHIFT                     (1)
#define LPTIM_IE_TRIGIE_MASK                      (0x01U << LPTIM_IE_TRIGIE_SHIFT)
#define LPTIM_IE_TRIGIE(x)                        (((uint32_t)(((uint32_t)(x)) << LPTIM_IE_TRIGIE_SHIFT)) & LPTIM_IE_TRIGIE_MASK)

#define LPTIM_IE_OVIE_SHIFT                       (0)
#define LPTIM_IE_OVIE_MASK                        (0x01U << LPTIM_IE_OVIE_SHIFT)
#define LPTIM_IE_OVIE(x)                          (((uint32_t)(((uint32_t)(x)) << LPTIM_IE_OVIE_SHIFT)) & LPTIM_IE_OVIE_MASK)

/*!
 * @brief LPTIM_IF Register Bit Definition
 */

#define LPTIM_IF_COMPIF_SHIFT                     (2)
#define LPTIM_IF_COMPIF_MASK                      (0x01U << LPTIM_IF_COMPIF_SHIFT)
#define LPTIM_IF_COMPIF(x)                        (((uint32_t)(((uint32_t)(x)) << LPTIM_IF_COMPIF_SHIFT)) & LPTIM_IF_COMPIF_MASK)

#define LPTIM_IF_TRIGIF_SHIFT                     (1)
#define LPTIM_IF_TRIGIF_MASK                      (0x01U << LPTIM_IF_TRIGIF_SHIFT)
#define LPTIM_IF_TRIGIF(x)                        (((uint32_t)(((uint32_t)(x)) << LPTIM_IF_TRIGIF_SHIFT)) & LPTIM_IF_TRIGIF_MASK)

#define LPTIM_IF_OVIF_SHIFT                       (0)
#define LPTIM_IF_OVIF_MASK                        (0x01U << LPTIM_IF_OVIF_SHIFT)
#define LPTIM_IF_OVIF(x)                          (((uint32_t)(((uint32_t)(x)) << LPTIM_IF_OVIF_SHIFT)) & LPTIM_IF_OVIF_MASK)

/*!
 * @brief LPTIM_CTRL Register Bit Definition
 */

#define LPTIM_CTRL_LPTEN_SHIFT                    (0)
#define LPTIM_CTRL_LPTEN_MASK                     (0x01U << LPTIM_CTRL_LPTEN_SHIFT)
#define LPTIM_CTRL_LPTEN(x)                       (((uint32_t)(((uint32_t)(x)) << LPTIM_CTRL_LPTEN_SHIFT)) & LPTIM_CTRL_LPTEN_MASK)

/*!
 * @brief LPTIM_CNT Register Bit Definition
 */

#define LPTIM_CNT_CNT_SHIFT                       (0)
#define LPTIM_CNT_CNT_MASK                        (0xFFFFU << LPTIM_CNT_CNT_SHIFT)
#define LPTIM_CNT_CNT(x)                          (((uint32_t)(((uint32_t)(x)) << LPTIM_CNT_CNT_SHIFT)) & LPTIM_CNT_CNT_MASK)

/*!
 * @brief LPTIM_CMP Register Bit Definition
 */

#define LPTIM_CMP_COMPAREREG_SHIFT                (0)
#define LPTIM_CMP_COMPAREREG_MASK                 (0xFFFFU << LPTIM_CMP_COMPAREREG_SHIFT)
#define LPTIM_CMP_COMPAREREG(x)                   (((uint32_t)(((uint32_t)(x)) << LPTIM_CMP_COMPAREREG_SHIFT)) & LPTIM_CMP_COMPAREREG_MASK)

/*!
 * @brief LPTIM_TARGET Register Bit Definition
 */

