OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define LPTIM_TARGET_TARGETREG_SHIFT              (0)
#define LPTIM_TARGET_TARGETREG_MASK               (0xFFFFU << LPTIM_TARGET_TARGETREG_SHIFT)
#define LPTIM_TARGET_TARGETREG(x)                 (((uint32_t)(((uint32_t)(x)) << LPTIM_TARGET_TARGETREG_SHIFT)) & LPTIM_TARGET_TARGETREG_MASK)

/*!
 * @}
 */ /* end of group LPTIM_Register_Masks */
/******************************************************************************
 *LPT Instance
*******************************************************************************/

#define LPTIM                  ((LPTIM_Type*)LPTIM_BASE)

/*!
 * @}
 */ /* end of group LPTIM_Peripheral_Access_Layer */




/*!
 * @addtogroup LPUART_Peripheral_Access_Layer LPU Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * LPU Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t LPUBAUD;                                                        ///< LPUART Baud Rate Register                    offset: 0x00
    __IO uint32_t MODU;                                                           ///< LPUART Baud Rate Modulation Control Register offset: 0x04
    __IO uint32_t LPUIF;                                                          ///< LPUART Interrupt Flag Register               offset: 0x08
    __IO uint32_t LPUSTA;                                                         ///< LPUART Status Register                       offset: 0x0C
    __IO uint32_t LPUCON;                                                         ///< LPUART Control Register                      offset: 0x10
    __IO uint32_t LPUEN;                                                          ///< LPUART transmit and receive enable register  offset: 0x14
    __IO uint32_t LPURXD;                                                         ///< LPUART receive data register                 offset: 0x18
    __IO uint32_t LPUTXD;                                                         ///< LPUART transmit data register                offset: 0x1C
    __IO uint32_t COMPARE;                                                        ///< LPUART data match register                   offset: 0x20
    __IO uint32_t WKCKE;                                                          ///< LPUART Wakeup Register                       offset: 0x24
} LPUART_Type;

/*******************************************************************************
 * LPU Type
 ******************************************************************************/

/*!
 * @addtogroup LPUART_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief LPUART_LPUBAUD Register Bit Definition
 */

#define LPUART_LPUBAUD_BR_SHIFT                    (16)
#define LPUART_LPUBAUD_BR_MASK                     (0xFFFFU << LPUART_LPUBAUD_BR_SHIFT)
#define LPUART_LPUBAUD_BR(x)                       (((uint32_t)(((uint32_t)(x)) << LPUART_LPUBAUD_BR_SHIFT)) & LPUART_LPUBAUD_BR_MASK)

#define LPUART_LPUBAUD_BREN_SHIFT                  (8)
#define LPUART_LPUBAUD_BREN_MASK                   (0x01U << LPUART_LPUBAUD_BREN_SHIFT)
#define LPUART_LPUBAUD_BREN(x)                     (((uint32_t)(((uint32_t)(x)) << LPUART_LPUBAUD_BREN_SHIFT)) & LPUART_LPUBAUD_BREN_MASK)

#define LPUART_LPUBAUD_BAUD_SHIFT                  (0)
#define LPUART_LPUBAUD_BAUD_MASK                   (0x7U << LPUART_LPUBAUD_BAUD_SHIFT)
#define LPUART_LPUBAUD_BAUD(x)                     (((uint32_t)(((uint32_t)(x)) << LPUART_LPUBAUD_BAUD_SHIFT)) & LPUART_LPUBAUD_BAUD_MASK)

/*!
 * @brief LPUART_MODU Register Bit Definition
 */

#define LPUART_MODU_MCTL_SHIFT                     (0)
#define LPUART_MODU_MCTL_MASK                      (0xFFFU << LPUART_MODU_MCTL_SHIFT)
#define LPUART_MODU_MCTL(x)                        (((uint32_t)(((uint32_t)(x)) << LPUART_MODU_MCTL_SHIFT)) & LPUART_MODU_MCTL_MASK)

/*!
 * @brief LPUART_LPUIF Register Bit Definition
 */

#define LPUART_LPUIF_TCIF_SHIFT                    (3)
#define LPUART_LPUIF_TCIF_MASK                     (0x01U << LPUART_LPUIF_TCIF_SHIFT)
#define LPUART_LPUIF_TCIF(x)                       (((uint32_t)(((uint32_t)(x)) << LPUART_LPUIF_TCIF_SHIFT)) & LPUART_LPUIF_TCIF_MASK)

#define LPUART_LPUIF_RXNEGIF_SHIFT                 (2)
#define LPUART_LPUIF_RXNEGIF_MASK                  (0x01U << LPUART_LPUIF_RXNEGIF_SHIFT)
#define LPUART_LPUIF_RXNEGIF(x)                    (((uint32_t)(((uint32_t)(x)) << LPUART_LPUIF_RXNEGIF_SHIFT)) & LPUART_LPUIF_RXNEGIF_MASK)

#define LPUART_LPUIF_TXIF_SHIFT                    (1)
#define LPUART_LPUIF_TXIF_MASK                     (0x01U << LPUART_LPUIF_TXIF_SHIFT)
#define LPUART_LPUIF_TXIF(x)                       (((uint32_t)(((uint32_t)(x)) << LPUART_LPUIF_TXIF_SHIFT)) & LPUART_LPUIF_TXIF_MASK)

#define LPUART_LPUIF_RXIF_SHIFT                    (0)
#define LPUART_LPUIF_RXIF_MASK                     (0x01U << LPUART_LPUIF_RXIF_SHIFT)
#define LPUART_LPUIF_RXIF(x)                       (((uint32_t)(((uint32_t)(x)) << LPUART_LPUIF_RXIF_SHIFT)) & LPUART_LPUIF_RXIF_MASK)

/*!
 * @brief LPUART_LPUSTA Register Bit Definition
 */

#define LPUART_LPUSTA_START_SHIFT                  (7)
#define LPUART_LPUSTA_START_MASK                   (0x01U << LPUART_LPUSTA_START_SHIFT)
#define LPUART_LPUSTA_START(x)                     (((uint32_t)(((uint32_t)(x)) << LPUART_LPUSTA_START_SHIFT)) & LPUART_LPUSTA_START_MASK)

#define LPUART_LPUSTA_PERR_SHIFT                   (6)
#define LPUART_LPUSTA_PERR_MASK                    (0x01U << LPUART_LPUSTA_PERR_SHIFT)
#define LPUART_LPUSTA_PERR(x)                      (((uint32_t)(((uint32_t)(x)) << LPUART_LPUSTA_PERR_SHIFT)) & LPUART_LPUSTA_PERR_MASK)

#define LPUART_LPUSTA_TC_SHIFT                     (5)
#define LPUART_LPUSTA_TC_MASK                      (0x01U << LPUART_LPUSTA_TC_SHIFT)
#define LPUART_LPUSTA_TC(x)                        (((uint32_t)(((uint32_t)(x)) << LPUART_LPUSTA_TC_SHIFT)) & LPUART_LPUSTA_TC_MASK)

#define LPUART_LPUSTA_TXE_SHIFT                    (4)
#define LPUART_LPUSTA_TXE_MASK                     (0x01U << LPUART_LPUSTA_TXE_SHIFT)
#define LPUART_LPUSTA_TXE(x)                       (((uint32_t)(((uint32_t)(x)) << LPUART_LPUSTA_TXE_SHIFT)) & LPUART_LPUSTA_TXE_MASK)

#define LPUART_LPUSTA_RXF_SHIFT                    (3)
#define LPUART_LPUSTA_RXF_MASK                     (0x01U << LPUART_LPUSTA_RXF_SHIFT)
#define LPUART_LPUSTA_RXF(x)                       (((uint32_t)(((uint32_t)(x)) << LPUART_LPUSTA_RXF_SHIFT)) & LPUART_LPUSTA_RXF_MASK)

