OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
/*******************************************************************************
 * MDS Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t TRIGXCR[8];                                                        ///< Trigger Channel x Control Register           offset: 0x000
    __IO uint32_t Reserved0[24];                                                     ///< Reserved
    __IO uint32_t TRIGCLUXSEL[4];                                                    ///< Trigger channel CLUx logic operation input select register offset: 0x080
    __IO uint32_t Reserved1[12];                                                     ///< Reserved
    __IO uint32_t TRIGCLUXCFG[4];                                                    ///< Trigger channel CLUx logic operation input control register offset: 0x080
    __IO uint32_t Reserved2[11];                                                     ///< Reserved
    __IO uint32_t SWTRIG;                                                            ///< Software Trigger Control Register            offset:  0x0FC
    __IO uint32_t CONNXCR[7];                                                        ///< Connect Channel x Control Register           offset: 0x100
    __IO uint32_t Reserved3[25];                                                     ///< Reserved
    __IO uint32_t CONNCLUXSEL[4];                                                    ///< Connection channel CLUx logic operation input control register offset: 0x180
    __IO uint32_t Reserved4[12];                                                    ///< Reserved
    __IO uint32_t CONNCLUXCFG[4];                                                    ///< Connection Channel CLUx Logic Operation Configuration Register offset: 0x1C0
} MDS_Type;

/*******************************************************************************
 * MDS Type
 ******************************************************************************/

/*!
 * @addtogroup MDS_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief MDS_TRIGXCR Register Bit Definition
 */
#define MDS_TRIGXCR_EDGESEL_SHIFT                (24)
#define MDS_TRIGXCR_EDGESEL_MASK                 (0x3U << MDS_TRIGXCR_EDGESEL_SHIFT)
#define MDS_TRIGXCR_EDGESEL(x)                   (((uint32_t)(((uint32_t)(x)) << MDS_TRIGXCR_EDGESEL_SHIFT)) & MDS_TRIGXCR_EDGESEL_MASK)

#define MDS_TRIGXCR_CLUSEL_SHIFT                (17)
#define MDS_TRIGXCR_CLUSEL_MASK                 (0x3U << MDS_TRIGXCR_CLUSEL_SHIFT)
#define MDS_TRIGXCR_CLUSEL(x)                   (((uint32_t)(((uint32_t)(x)) << MDS_TRIGXCR_CLUSEL_SHIFT)) & MDS_TRIGXCR_CLUSEL_MASK)

#define MDS_TRIGXCR_CLUEN_SHIFT                 (16)
#define MDS_TRIGXCR_CLUEN_MASK                  (0x01U << MDS_TRIGXCR_CLUEN_SHIFT)
#define MDS_TRIGXCR_CLUEN(x)                    (((uint32_t)(((uint32_t)(x)) << MDS_TRIGXCR_CLUEN_SHIFT)) & MDS_TRIGXCR_CLUEN_MASK)

#define MDS_TRIGXCR_TRGSEL_SHIFT                (0)
#define MDS_TRIGXCR_TRGSEL_MASK                 (0x3FU << MDS_TRIGXCR_TRGSEL_SHIFT)
#define MDS_TRIGXCR_TRGSEL(x)                   (((uint32_t)(((uint32_t)(x)) << MDS_TRIGXCR_TRGSEL_SHIFT)) & MDS_TRIGXCR_TRGSEL_MASK)

/*!
 * @brief MDS_TRIG_CLUXSEL Register Bit Definition
 */

#define MDS_TRIGCLUXSEL_CLUIN3SEL_SHIFT         (24)
#define MDS_TRIGCLUXSEL_CLUIN3SEL_MASK          (0xFFU << MDS_TRIGCLUXSEL_CLUIN3SEL_SHIFT)
#define MDS_TRIGCLUXSEL_CLUIN3SEL(x)            (((uint32_t)(((uint32_t)(x)) << MDS_TRIGCLUXSEL_CLUIN3SEL_SHIFT)) & MDS_TRIGCLUXSEL_CLUIN3SEL_MASK)

#define MDS_TRIGCLUXSEL_CLUIN2SEL_SHIFT         (16)
#define MDS_TRIGCLUXSEL_CLUIN2SEL_MASK          (0xFFU << MDS_TRIGCLUXSEL_CLUIN2SEL_SHIFT)
#define MDS_TRIGCLUXSEL_CLUIN2SEL(x)            (((uint32_t)(((uint32_t)(x)) << MDS_TRIGCLUXSEL_CLUIN2SEL_SHIFT)) & MDS_TRIGCLUXSEL_CLUIN2SEL_MASK)

#define MDS_TRIGCLUXSEL_CLUIN1SEL_SHIFT         (8)
#define MDS_TRIGCLUXSEL_CLUIN1SEL_MASK          (0xFFU << MDS_TRIGCLUXSEL_CLUIN1SEL_SHIFT)
#define MDS_TRIGCLUXSEL_CLUIN1SEL(x)            (((uint32_t)(((uint32_t)(x)) << MDS_TRIGCLUXSEL_CLUIN1SEL_SHIFT)) & MDS_TRIGCLUXSEL_CLUIN1SEL_MASK)

#define MDS_TRIGCLUXSEL_CLUIN0SEL_SHIFT         (0)
#define MDS_TRIGCLUXSEL_CLUIN0SEL_MASK          (0xFFU << MDS_TRIGCLUXSEL_CLUIN0SEL_SHIFT)
#define MDS_TRIGCLUXSEL_CLUIN0SEL(x)            (((uint32_t)(((uint32_t)(x)) << MDS_TRIGCLUXSEL_CLUIN0SEL_SHIFT)) & MDS_TRIGCLUXSEL_CLUIN0SEL_MASK)

/*!
 * @brief MDS_TRIG_CLUXCFG Register Bit Definition
 */

#define MDS_TRIGCLUXCFG_CLUIN3SED_SHIFT         (24)
#define MDS_TRIGCLUXCFG_CLUIN3SED_MASK          (0x03U << MDS_TRIGCLUXCFG_CLUIN3SED_SHIFT)
#define MDS_TRIGCLUXCFG_CLUIN3SED(x)            (((uint32_t)(((uint32_t)(x)) << MDS_TRIGCLUXCFG_CLUIN3SED_SHIFT)) & MDS_TRIGCLUXCFG_CLUIN3SED_MASK)

#define MDS_TRIGCLUXCFG_CLUIN2SED_SHIFT         (16)
#define MDS_TRIGCLUXCFG_CLUIN2SED_MASK          (0x03U << MDS_TRIGCLUXCFG_CLUIN2SED_SHIFT)
#define MDS_TRIGCLUXCFG_CLUIN2SED(x)            (((uint32_t)(((uint32_t)(x)) << MDS_TRIGCLUXCFG_CLUIN2SED_SHIFT)) & MDS_TRIGCLUXCFG_CLUIN2SED_MASK)

#define MDS_TRIGCLUXCFG_CLUIN1SED_SHIFT         (8)
#define MDS_TRIGCLUXCFG_CLUIN1SED_MASK          (0x03U << MDS_TRIGCLUXCFG_CLUIN1SED_SHIFT)
#define MDS_TRIGCLUXCFG_CLUIN1SED(x)            (((uint32_t)(((uint32_t)(x)) << MDS_TRIGCLUXCFG_CLUIN1SED_SHIFT)) & MDS_TRIGCLUXCFG_CLUIN1SED_MASK)

#define MDS_TRIGCLUXCFG_CLUIN0SED_SHIFT         (0)
#define MDS_TRIGCLUXCFG_CLUIN0SED_MASK          (0x03U << MDS_TRIGCLUXCFG_CLUIN0SED_SHIFT)
#define MDS_TRIGCLUXCFG_CLUIN0SED(x)            (((uint32_t)(((uint32_t)(x)) << MDS_TRIGCLUXCFG_CLUIN0SED_SHIFT)) & MDS_TRIGCLUXCFG_CLUIN0SED_MASK)

/*!
 * @brief MDS_SWTRIG Register Bit Definition
 */

#define MDS_SWTRIG_SWTRIG_SHIFT                 (0)
#define MDS_SWTRIG_SWTRIG_MASK                  (0x01U << MDS_SWTRIG_SWTRIG_SHIFT)
#define MDS_SWTRIG_SWTRIG(x)                    (((uint32_t)(((uint32_t)(x)) << MDS_SWTRIG_SWTRIG_SHIFT)) & MDS_SWTRIG_SWTRIG_MASK)

/*!
 * @brief MDS_CONNXCR Register Bit Definition
 */

#define MDS_CONNXCR_CLUSEL_SHIFT                (17)
#define MDS_CONNXCR_CLUSEL_MASK                 (0x3U << MDS_CONNXCR_CLUSEL_SHIFT)
#define MDS_CONNXCR_CLUSEL(x)                   (((uint32_t)(((uint32_t)(x)) << MDS_CONNXCR_CLUSEL_SHIFT)) & MDS_CONNXCR_CLUSEL_MASK)

#define MDS_CONNXCR_CLUEN_SHIFT                 (16)
#define MDS_CONNXCR_CLUEN_MASK                  (0x01U << MDS_CONNXCR_CLUEN_SHIFT)
#define MDS_CONNXCR_CLUEN(x)                    (((uint32_t)(((uint32_t)(x)) << MDS_CONNXCR_CLUEN_SHIFT)) & MDS_CONNXCR_CLUEN_MASK)

#define MDS_CONNXCR_TRGSEL_SHIFT                (0)
#define MDS_CONNXCR_TRGSEL_MASK                 (0x3FU << MDS_CONNXCR_TRGSEL_SHIFT)
#define MDS_CONNXCR_TRGSEL(x)                   (((uint32_t)(((uint32_t)(x)) << MDS_CONNXCR_TRGSEL_SHIFT)) & MDS_CONNXCR_TRGSEL_MASK)

/*!
 * @brief MDS_CONN_CLUXSEL Register Bit Definition
 */

#define MDS_CONNCLUXSEL_CLUIN3SEL_SHIFT         (24)
#define MDS_CONNCLUXSEL_CLUIN3SEL_MASK          (0xFFU << MDS_CONNCLUXSEL_CLUIN3SEL_SHIFT)
#define MDS_CONNCLUXSEL_CLUIN3SEL(x)            (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXSEL_CLUIN3SEL_SHIFT)) & MDS_CONNCLUXSEL_CLUIN3SEL_MASK)

#define MDS_CONNCLUXSEL_CLUIN2SEL_SHIFT         (16)
#define MDS_CONNCLUXSEL_CLUIN2SEL_MASK          (0xFFU << MDS_CONNCLUXSEL_CLUIN2SEL_SHIFT)
#define MDS_CONNCLUXSEL_CLUIN2SEL(x)            (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXSEL_CLUIN2SEL_SHIFT)) & MDS_CONNCLUXSEL_CLUIN2SEL_MASK)

#define MDS_CONNCLUXSEL_CLUIN1SEL_SHIFT         (8)
#define MDS_CONNCLUXSEL_CLUIN1SEL_MASK          (0xFFU << MDS_CONNCLUXSEL_CLUIN1SEL_SHIFT)
#define MDS_CONNCLUXSEL_CLUIN1SEL(x)            (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXSEL_CLUIN1SEL_SHIFT)) & MDS_CONNCLUXSEL_CLUIN1SEL_MASK)

#define MDS_CONNCLUXSEL_CLUIN0SEL_SHIFT         (0)
#define MDS_CONNCLUXSEL_CLUIN0SEL_MASK          (0xFFU << MDS_CONNCLUXSEL_CLUIN0SEL_SHIFT)
#define MDS_CONNCLUXSEL_CLUIN0SEL(x)            (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXSEL_CLUIN0SEL_SHIFT)) & MDS_CONNCLUXSEL_CLUIN0SEL_MASK)

/*!
 * @brief MDS_CONN_CLUXCFG Register Bit Definition
 */

