OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define QSPI_CR_XIPMODE_SHIFT                   (5)
#define QSPI_CR_XIPMODE_MASK                    (0x01U << QSPI_CR_XIPMODE_SHIFT)
#define QSPI_CR_XIPMODE(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_CR_XIPMODE_SHIFT)) & QSPI_CR_XIPMODE_MASK)

#define QSPI_CR_SCKMODE_SHIFT                   (4)
#define QSPI_CR_SCKMODE_MASK                    (0x01U << QSPI_CR_SCKMODE_SHIFT)
#define QSPI_CR_SCKMODE(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_CR_SCKMODE_SHIFT)) & QSPI_CR_SCKMODE_MASK)

#define QSPI_CR_OPMODE_SHIFT                    (0)
#define QSPI_CR_OPMODE_MASK                     (0x3U << QSPI_CR_OPMODE_SHIFT)
#define QSPI_CR_OPMODE(x)                       (((uint32_t)(((uint32_t)(x)) << QSPI_CR_OPMODE_SHIFT)) & QSPI_CR_OPMODE_MASK)

/*!
 * @brief QSPI_SR Register Bit Definition
 */

#define QSPI_SR_DEPTH_SHIFT                     (24)
#define QSPI_SR_DEPTH_MASK                      (0xFU << QSPI_SR_DEPTH_SHIFT)
#define QSPI_SR_DEPTH(x)                        (((uint32_t)(((uint32_t)(x)) << QSPI_SR_DEPTH_SHIFT)) & QSPI_SR_DEPTH_MASK)

#define QSPI_SR_LEVEL_SHIFT                     (12)
#define QSPI_SR_LEVEL_MASK                      (0xFU << QSPI_SR_LEVEL_SHIFT)
#define QSPI_SR_LEVEL(x)                        (((uint32_t)(((uint32_t)(x)) << QSPI_SR_LEVEL_SHIFT)) & QSPI_SR_LEVEL_MASK)

#define QSPI_SR_FULL_SHIFT                      (9)
#define QSPI_SR_FULL_MASK                       (0x01U << QSPI_SR_FULL_SHIFT)
#define QSPI_SR_FULL(x)                         (((uint32_t)(((uint32_t)(x)) << QSPI_SR_FULL_SHIFT)) & QSPI_SR_FULL_MASK)

#define QSPI_SR_EMPTY_SHIFT                     (8)
#define QSPI_SR_EMPTY_MASK                      (0x01U << QSPI_SR_EMPTY_SHIFT)
#define QSPI_SR_EMPTY(x)                        (((uint32_t)(((uint32_t)(x)) << QSPI_SR_EMPTY_SHIFT)) & QSPI_SR_EMPTY_MASK)

#define QSPI_SR_XIPST_SHIFT                     (6)
#define QSPI_SR_XIPST_MASK                      (0x01U << QSPI_SR_XIPST_SHIFT)
#define QSPI_SR_XIPST(x)                        (((uint32_t)(((uint32_t)(x)) << QSPI_SR_XIPST_SHIFT)) & QSPI_SR_XIPST_MASK)

#define QSPI_SR_BUSY_SHIFT                      (5)
#define QSPI_SR_BUSY_MASK                       (0x01U << QSPI_SR_BUSY_SHIFT)
#define QSPI_SR_BUSY(x)                         (((uint32_t)(((uint32_t)(x)) << QSPI_SR_BUSY_SHIFT)) & QSPI_SR_BUSY_MASK)

#define QSPI_SR_TCF_SHIFT                       (4)
#define QSPI_SR_TCF_MASK                        (0x01U << QSPI_SR_TCF_SHIFT)
#define QSPI_SR_TCF(x)                          (((uint32_t)(((uint32_t)(x)) << QSPI_SR_TCF_SHIFT)) & QSPI_SR_TCF_MASK)

#define QSPI_SR_OPCRCF_SHIFT                    (2)
#define QSPI_SR_OPCRCF_MASK                     (0x01U << QSPI_SR_OPCRCF_SHIFT)
#define QSPI_SR_OPCRCF(x)                       (((uint32_t)(((uint32_t)(x)) << QSPI_SR_OPCRCF_SHIFT)) & QSPI_SR_OPCRCF_MASK)

#define QSPI_SR_CUROP_SHIFT                     (0)
#define QSPI_SR_CUROP_MASK                      (0x3U << QSPI_SR_CUROP_SHIFT)
#define QSPI_SR_CUROP(x)                        (((uint32_t)(((uint32_t)(x)) << QSPI_SR_CUROP_SHIFT)) & QSPI_SR_CUROP_MASK)

/*!
 * @brief QSPI_DMCR Register Bit Definition
 */

#define QSPI_DMCR_NUMDC_SHIFT                   (24)
#define QSPI_DMCR_NUMDC_MASK                    (0x1FU << QSPI_DMCR_NUMDC_SHIFT)
#define QSPI_DMCR_NUMDC(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_NUMDC_SHIFT)) & QSPI_DMCR_NUMDC_MASK)

#define QSPI_DMCR_RXDLY_SHIFT                   (22)
#define QSPI_DMCR_RXDLY_MASK                    (0x3U << QSPI_DMCR_RXDLY_SHIFT)
#define QSPI_DMCR_RXDLY(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_RXDLY_SHIFT)) & QSPI_DMCR_RXDLY_MASK)

#define QSPI_DMCR_DSIZE_SHIFT                   (20)
#define QSPI_DMCR_DSIZE_MASK                    (0x3U << QSPI_DMCR_DSIZE_SHIFT)
#define QSPI_DMCR_DSIZE(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_DSIZE_SHIFT)) & QSPI_DMCR_DSIZE_MASK)

#define QSPI_DMCR_DMODE_SHIFT                   (18)
#define QSPI_DMCR_DMODE_MASK                    (0x3U << QSPI_DMCR_DMODE_SHIFT)
#define QSPI_DMCR_DMODE(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_DMODE_SHIFT)) & QSPI_DMCR_DMODE_MASK)

#define QSPI_DMCR_ABSIZE_SHIFT                  (16)
#define QSPI_DMCR_ABSIZE_MASK                   (0x3U << QSPI_DMCR_ABSIZE_SHIFT)
#define QSPI_DMCR_ABSIZE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_ABSIZE_SHIFT)) & QSPI_DMCR_ABSIZE_MASK)

#define QSPI_DMCR_ABMODE_SHIFT                  (14)
#define QSPI_DMCR_ABMODE_MASK                   (0x3U << QSPI_DMCR_ABMODE_SHIFT)
#define QSPI_DMCR_ABMODE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_ABMODE_SHIFT)) & QSPI_DMCR_ABMODE_MASK)

#define QSPI_DMCR_ADSIZE_SHIFT                  (12)
#define QSPI_DMCR_ADSIZE_MASK                   (0x3U << QSPI_DMCR_ADSIZE_SHIFT)
#define QSPI_DMCR_ADSIZE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_ADSIZE_SHIFT)) & QSPI_DMCR_ADSIZE_MASK)

#define QSPI_DMCR_ADMODE_SHIFT                  (10)
#define QSPI_DMCR_ADMODE_MASK                   (0x3U << QSPI_DMCR_ADMODE_SHIFT)
#define QSPI_DMCR_ADMODE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_ADMODE_SHIFT)) & QSPI_DMCR_ADMODE_MASK)

#define QSPI_DMCR_IMODE_SHIFT                   (8)
#define QSPI_DMCR_IMODE_MASK                    (0x3U << QSPI_DMCR_IMODE_SHIFT)
#define QSPI_DMCR_IMODE(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_IMODE_SHIFT)) & QSPI_DMCR_IMODE_MASK)

#define QSPI_DMCR_INST_SHIFT                    (0)
#define QSPI_DMCR_INST_MASK                     (0xFFU << QSPI_DMCR_INST_SHIFT)
#define QSPI_DMCR_INST(x)                       (((uint32_t)(((uint32_t)(x)) << QSPI_DMCR_INST_SHIFT)) & QSPI_DMCR_INST_MASK)

/*!
 * @brief QSPI_IMCR Register Bit Definition
 */

#define QSPI_IMCR_IDMODE_SHIFT                  (30)
#define QSPI_IMCR_IDMODE_MASK                   (0x01U << QSPI_IMCR_IDMODE_SHIFT)
#define QSPI_IMCR_IDMODE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_IDMODE_SHIFT)) & QSPI_IMCR_IDMODE_MASK)

#define QSPI_IMCR_XIPIM_SHIFT                   (29)
#define QSPI_IMCR_XIPIM_MASK                    (0x01U << QSPI_IMCR_XIPIM_SHIFT)
#define QSPI_IMCR_XIPIM(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_XIPIM_SHIFT)) & QSPI_IMCR_XIPIM_MASK)

#define QSPI_IMCR_NUMDC_SHIFT                   (24)
#define QSPI_IMCR_NUMDC_MASK                    (0x1FU << QSPI_IMCR_NUMDC_SHIFT)
#define QSPI_IMCR_NUMDC(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_NUMDC_SHIFT)) & QSPI_IMCR_NUMDC_MASK)

#define QSPI_IMCR_RXDLY_SHIFT                   (22)
#define QSPI_IMCR_RXDLY_MASK                    (0x3U << QSPI_IMCR_RXDLY_SHIFT)
#define QSPI_IMCR_RXDLY(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_RXDLY_SHIFT)) & QSPI_IMCR_RXDLY_MASK)

#define QSPI_IMCR_DSIZE_SHIFT                   (20)
#define QSPI_IMCR_DSIZE_MASK                    (0x3U << QSPI_IMCR_DSIZE_SHIFT)
#define QSPI_IMCR_DSIZE(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_DSIZE_SHIFT)) & QSPI_IMCR_DSIZE_MASK)

#define QSPI_IMCR_DMODE_SHIFT                   (18)
#define QSPI_IMCR_DMODE_MASK                    (0x3U << QSPI_IMCR_DMODE_SHIFT)
#define QSPI_IMCR_DMODE(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_DMODE_SHIFT)) & QSPI_IMCR_DMODE_MASK)

