OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
#define QSPI_IMCR_ABSIZE_SHIFT                  (16)
#define QSPI_IMCR_ABSIZE_MASK                   (0x3U << QSPI_IMCR_ABSIZE_SHIFT)
#define QSPI_IMCR_ABSIZE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_ABSIZE_SHIFT)) & QSPI_IMCR_ABSIZE_MASK)

#define QSPI_IMCR_ABMODE_SHIFT                  (14)
#define QSPI_IMCR_ABMODE_MASK                   (0x3U << QSPI_IMCR_ABMODE_SHIFT)
#define QSPI_IMCR_ABMODE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_ABMODE_SHIFT)) & QSPI_IMCR_ABMODE_MASK)

#define QSPI_IMCR_ADSIZE_SHIFT                  (12)
#define QSPI_IMCR_ADSIZE_MASK                   (0x3U << QSPI_IMCR_ADSIZE_SHIFT)
#define QSPI_IMCR_ADSIZE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_ADSIZE_SHIFT)) & QSPI_IMCR_ADSIZE_MASK)

#define QSPI_IMCR_ADMODE_SHIFT                  (10)
#define QSPI_IMCR_ADMODE_MASK                   (0x3U << QSPI_IMCR_ADMODE_SHIFT)
#define QSPI_IMCR_ADMODE(x)                     (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_ADMODE_SHIFT)) & QSPI_IMCR_ADMODE_MASK)

#define QSPI_IMCR_IMODE_SHIFT                   (8)
#define QSPI_IMCR_IMODE_MASK                    (0x3U << QSPI_IMCR_IMODE_SHIFT)
#define QSPI_IMCR_IMODE(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_IMODE_SHIFT)) & QSPI_IMCR_IMODE_MASK)

#define QSPI_IMCR_INST_SHIFT                    (0)
#define QSPI_IMCR_INST_MASK                     (0xFFU << QSPI_IMCR_INST_SHIFT)
#define QSPI_IMCR_INST(x)                       (((uint32_t)(((uint32_t)(x)) << QSPI_IMCR_INST_SHIFT)) & QSPI_IMCR_INST_MASK)

/*!
 * @brief QSPI_DABR Register Bit Definition
 */

#define QSPI_DABR_DALT_SHIFT                    (0)
#define QSPI_DABR_DALT_MASK                     (0xFFFFFFFFU << QSPI_DABR_DALT_SHIFT)
#define QSPI_DABR_DALT(x)                       (((uint32_t)(((uint32_t)(x)) << QSPI_DABR_DALT_SHIFT)) & QSPI_DABR_DALT_MASK)

/*!
 * @brief QSPI_IABR Register Bit Definition
 */

#define QSPI_IABR_IALT_SHIFT                    (0)
#define QSPI_IABR_IALT_MASK                     (0xFFFFFFFFU << QSPI_IABR_IALT_SHIFT)
#define QSPI_IABR_IALT(x)                       (((uint32_t)(((uint32_t)(x)) << QSPI_IABR_IALT_SHIFT)) & QSPI_IABR_IALT_MASK)

/*!
 * @brief QSPI_IADR Register Bit Definition
 */

#define QSPI_IADR_IADDR_SHIFT                   (0)
#define QSPI_IADR_IADDR_MASK                    (0xFFFFFFFFU << QSPI_IADR_IADDR_SHIFT)
#define QSPI_IADR_IADDR(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IADR_IADDR_SHIFT)) & QSPI_IADR_IADDR_MASK)

/*!
 * @brief QSPI_IDFR Register Bit Definition
 */

#define QSPI_IDFR_IDATA_SHIFT                   (0)
#define QSPI_IDFR_IDATA_MASK                    (0xFFFFFFFFU << QSPI_IDFR_IDATA_SHIFT)
#define QSPI_IDFR_IDATA(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IDFR_IDATA_SHIFT)) & QSPI_IDFR_IDATA_MASK)

/*!
 * @brief QSPI_IDLR Register Bit Definition
 */

#define QSPI_IDLR_IDLEN_SHIFT                   (0)
#define QSPI_IDLR_IDLEN_MASK                    (0xFFFFFU << QSPI_IDLR_IDLEN_SHIFT)
#define QSPI_IDLR_IDLEN(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IDLR_IDLEN_SHIFT)) & QSPI_IDLR_IDLEN_MASK)

/*!
 * @brief QSPI_IWCR Register Bit Definition
 */

#define QSPI_IWCR_IWCNT_SHIFT                   (0)
#define QSPI_IWCR_IWCNT_MASK                    (0x3FFFFFFFU << QSPI_IWCR_IWCNT_SHIFT)
#define QSPI_IWCR_IWCNT(x)                      (((uint32_t)(((uint32_t)(x)) << QSPI_IWCR_IWCNT_SHIFT)) & QSPI_IWCR_IWCNT_MASK)

/*!
 * @brief QSPI_IDER Register Bit Definition
 */

#define QSPI_IDER_FULLDMAEN_SHIFT               (15)
#define QSPI_IDER_FULLDMAEN_MASK                (0x01U << QSPI_IDER_FULLDMAEN_SHIFT)
#define QSPI_IDER_FULLDMAEN(x)                  (((uint32_t)(((uint32_t)(x)) << QSPI_IDER_FULLDMAEN_SHIFT)) & QSPI_IDER_FULLDMAEN_MASK)

#define QSPI_IDER_EMPTYDMAEN_SHIFT              (14)
#define QSPI_IDER_EMPTYDMAEN_MASK               (0x01U << QSPI_IDER_EMPTYDMAEN_SHIFT)
#define QSPI_IDER_EMPTYDMAEN(x)                 (((uint32_t)(((uint32_t)(x)) << QSPI_IDER_EMPTYDMAEN_SHIFT)) & QSPI_IDER_EMPTYDMAEN_MASK)

#define QSPI_IDER_TCFDMAEN_SHIFT                (8)
#define QSPI_IDER_TCFDMAEN_MASK                 (0x01U << QSPI_IDER_TCFDMAEN_SHIFT)
#define QSPI_IDER_TCFDMAEN(x)                   (((uint32_t)(((uint32_t)(x)) << QSPI_IDER_TCFDMAEN_SHIFT)) & QSPI_IDER_TCFDMAEN_MASK)

#define QSPI_IDER_FULLINTEN_SHIFT               (7)
#define QSPI_IDER_FULLINTEN_MASK                (0x01U << QSPI_IDER_FULLINTEN_SHIFT)
#define QSPI_IDER_FULLINTEN(x)                  (((uint32_t)(((uint32_t)(x)) << QSPI_IDER_FULLINTEN_SHIFT)) & QSPI_IDER_FULLINTEN_MASK)

#define QSPI_IDER_EMPTYINTEN_SHIFT              (6)
#define QSPI_IDER_EMPTYINTEN_MASK               (0x01U << QSPI_IDER_EMPTYINTEN_SHIFT)
#define QSPI_IDER_EMPTYINTEN(x)                 (((uint32_t)(((uint32_t)(x)) << QSPI_IDER_EMPTYINTEN_SHIFT)) & QSPI_IDER_EMPTYINTEN_MASK)

#define QSPI_IDER_TCFINTEN_SHIFT                (0)
#define QSPI_IDER_TCFINTEN_MASK                 (0x01U << QSPI_IDER_TCFINTEN_SHIFT)
#define QSPI_IDER_TCFINTEN(x)                   (((uint32_t)(((uint32_t)(x)) << QSPI_IDER_TCFINTEN_SHIFT)) & QSPI_IDER_TCFINTEN_MASK)

/*!
 * @}
 */ /* end of group QSPI_Register_Masks */
/******************************************************************************
 *QSPI Instance
*******************************************************************************/

#define QSPI                 ((QSPI_Type*)QSPI_BASE)

/*!
 * @}
 */ /* end of group QSPI_Peripheral_Access_Layer */


/*!
 * @addtogroup RCC_Peripheral_Access_Layer RCC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * RCC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< clock control register                       offset: 0x00
    __IO uint32_t CFGR;                                                           ///< Clock Configuration Register                 offset: 0x04
    __IO uint32_t CIR;                                                            ///< clock interrupt register                     offset: 0x08
    __IO uint32_t Reserved42[2];                                                   ///< Reserved
    __IO uint32_t AHB1RSTR;                                                       ///< AHB1 Peripheral Reset Register               offset: 0x14
    __IO uint32_t APB2RSTR;                                                       ///< APB2 Peripheral Reset Register               offset: 0x18
    __IO uint32_t APB1RSTR;                                                       ///< APB1 Peripheral Reset Register               offset: 0x1C
    __IO uint32_t Reserved43[2];                                                   ///< Reserved
    __IO uint32_t AHB1ENR;                                                        ///< AHB1 peripheral clock enable register        offset: 0x28
    __IO uint32_t APB2ENR;                                                        ///< APB2 Peripheral Clock Enable Register        offset: 0x2C
    __IO uint32_t APB1ENR;                                                        ///< APB1 Peripheral Clock Enable Register        offset: 0x30
    __IO uint32_t BDCR;                                                           ///< Backup Domain Control Register               offset: 0x34
    __IO uint32_t CSR;                                                            ///< Control Status Register                      offset: 0x38
    __IO uint32_t SYSCFG;                                                         ///< System Configuration Register                offset: 0x3C
    __IO uint32_t CFGR2;                                                          ///< Clock Configuration Register 2               offset: 0x40
    __IO uint32_t Reserved44;                                                          ///< Reserved                                     offset: 0x44
    __IO uint32_t PLL1CFGR;                                                       ///< PLL1 Configuration Register                  offset: 0x48
    __IO uint32_t PLL2CFGR;                                                       ///< PLL2 Configuration Register                  offset: 0x4C
    __IO uint32_t Reserved45[4];                                                   ///< Reserved
    __IO uint32_t ADC1CFGR;                                                       ///< ADC1 Configuration Register                  offset: 0x60
    __IO uint32_t ADC2CFGR;                                                       ///< ADC2 Configuration Register                  offset: 0x64
    __IO uint32_t Reserved46[2];                                                   ///< Reserved
    __IO uint32_t DACCFGR;                                                        ///< DAC Configuration Register                   offset: 0x70
    __IO uint32_t Reserved47[1];                                                   ///< Reserved
    __IO uint32_t FSMCCFGR;                                                       ///< FSMC Configuration Register                  offset: 0x78
    __IO uint32_t TPIUCFGR;                                                       ///< TPIU configuration register                  offset: 0x7C
} RCC_Type;

