OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
/*******************************************************************************
 * SYSCFG Type
 ******************************************************************************/

/*!
 * @addtogroup SYSCFG_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief SYSCFG_CFGR Register Bit Definition
 */

#define SYSCFG_CFGR_FCMODESEL_SHIFT               (29)
#define SYSCFG_CFGR_FCMODESEL_MASK                (0x3U << SYSCFG_CFGR_FCMODESEL_SHIFT)
#define SYSCFG_CFGR_FCMODESEL(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_FCMODESEL_SHIFT)) & SYSCFG_CFGR_FCMODESEL_MASK)

#define SYSCFG_CFGR_FCODATAEN_SHIFT             (28)
#define SYSCFG_CFGR_FCODATAEN_MASK              (0x01U << SYSCFG_CFGR_FCODATAEN_SHIFT)
#define SYSCFG_CFGR_FCODATAEN(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_FCODATAEN_SHIFT)) & SYSCFG_CFGR_FCODATAEN_MASK)

#define SYSCFG_CFGR_CAN2STOP_SHIFT              (21)
#define SYSCFG_CFGR_CAN2STOP_MASK               (0x01U << SYSCFG_CFGR_CAN2STOP_SHIFT)
#define SYSCFG_CFGR_CAN2STOP(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_CAN2STOP_SHIFT)) & SYSCFG_CFGR_CAN2STOP_MASK)

#define SYSCFG_CFGR_CAN2TEST_SHIFT              (20)
#define SYSCFG_CFGR_CAN2TEST_MASK               (0x01U << SYSCFG_CFGR_CAN2TEST_SHIFT)
#define SYSCFG_CFGR_CAN2TEST(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_CAN2TEST_SHIFT)) & SYSCFG_CFGR_CAN2TEST_MASK)

#define SYSCFG_CFGR_CAN2SPV_SHIFT               (19)
#define SYSCFG_CFGR_CAN2SPV_MASK                (0x01U << SYSCFG_CFGR_CAN2SPV_SHIFT)
#define SYSCFG_CFGR_CAN2SPV(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_CAN2SPV_SHIFT)) & SYSCFG_CFGR_CAN2SPV_MASK)

#define SYSCFG_CFGR_CAN1STOP_SHIFT              (18)
#define SYSCFG_CFGR_CAN1STOP_MASK               (0x01U << SYSCFG_CFGR_CAN1STOP_SHIFT)
#define SYSCFG_CFGR_CAN1STOP(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_CAN1STOP_SHIFT)) & SYSCFG_CFGR_CAN1STOP_MASK)

#define SYSCFG_CFGR_CAN1TEST_SHIFT              (17)
#define SYSCFG_CFGR_CAN1TEST_MASK               (0x01U << SYSCFG_CFGR_CAN1TEST_SHIFT)
#define SYSCFG_CFGR_CAN1TEST(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_CAN1TEST_SHIFT)) & SYSCFG_CFGR_CAN1TEST_MASK)

#define SYSCFG_CFGR_CAN1SPV_SHIFT               (16)
#define SYSCFG_CFGR_CAN1SPV_MASK                (0x01U << SYSCFG_CFGR_CAN1SPV_SHIFT)
#define SYSCFG_CFGR_CAN1SPV(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_CAN1SPV_SHIFT)) & SYSCFG_CFGR_CAN1SPV_MASK)

#define SYSCFG_CFGR_USBFSIDORV_SHIFT            (3)
#define SYSCFG_CFGR_USBFSIDORV_MASK             (0x01U << SYSCFG_CFGR_USBFSIDORV_SHIFT)
#define SYSCFG_CFGR_USBFSIDORV(x)               (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_USBFSIDORV_SHIFT)) & SYSCFG_CFGR_USBFSIDORV_MASK)

#define SYSCFG_CFGR_USBFSVBUSORV_SHIFT          (2)
#define SYSCFG_CFGR_USBFSVBUSORV_MASK           (0x01U << SYSCFG_CFGR_USBFSVBUSORV_SHIFT)
#define SYSCFG_CFGR_USBFSVBUSORV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_USBFSVBUSORV_SHIFT)) & SYSCFG_CFGR_USBFSVBUSORV_MASK)

#define SYSCFG_CFGR_USBFSIDOWDIS_SHIFT          (1)
#define SYSCFG_CFGR_USBFSIDOWDIS_MASK           (0x01U << SYSCFG_CFGR_USBFSIDOWDIS_SHIFT)
#define SYSCFG_CFGR_USBFSIDOWDIS(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_USBFSIDOWDIS_SHIFT)) & SYSCFG_CFGR_USBFSIDOWDIS_MASK)

#define SYSCFG_CFGR_USBFSVBUSOWDIS_SHIFT        (0)
#define SYSCFG_CFGR_USBFSVBUSOWDIS_MASK         (0x01U << SYSCFG_CFGR_USBFSVBUSOWDIS_SHIFT)
#define SYSCFG_CFGR_USBFSVBUSOWDIS(x)           (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_USBFSVBUSOWDIS_SHIFT)) & SYSCFG_CFGR_USBFSVBUSOWDIS_MASK)

/*!
 * @brief SYSCFG_EXTICR1 Register Bit Definition
 */

#define SYSCFG_EXTICR1_EXTIX_SHIFT              (0)
#define SYSCFG_EXTICR1_EXTIX_MASK               (0xFFFFU << SYSCFG_EXTICR1_EXTIX_SHIFT)
#define SYSCFG_EXTICR1_EXTIX(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTIX_SHIFT)) & SYSCFG_EXTICR1_EXTIX_MASK)

/*!
 * @brief SYSCFG_EXTICR2 Register Bit Definition
 */

#define SYSCFG_EXTICR2_EXTIX_SHIFT              (0)
#define SYSCFG_EXTICR2_EXTIX_MASK               (0xFFFFU << SYSCFG_EXTICR2_EXTIX_SHIFT)
#define SYSCFG_EXTICR2_EXTIX(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTIX_SHIFT)) & SYSCFG_EXTICR2_EXTIX_MASK)

/*!
 * @brief SYSCFG_EXTICR3 Register Bit Definition
 */

#define SYSCFG_EXTICR3_EXTIX_SHIFT              (0)
#define SYSCFG_EXTICR3_EXTIX_MASK               (0xFFFFU << SYSCFG_EXTICR3_EXTIX_SHIFT)
#define SYSCFG_EXTICR3_EXTIX(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTIX_SHIFT)) & SYSCFG_EXTICR3_EXTIX_MASK)

/*!
 * @brief SYSCFG_EXTICR4 Register Bit Definition
 */

#define SYSCFG_EXTICR4_EXTIX_SHIFT              (0)
#define SYSCFG_EXTICR4_EXTIX_MASK               (0xFFFFU << SYSCFG_EXTICR4_EXTIX_SHIFT)
#define SYSCFG_EXTICR4_EXTIX(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTIX_SHIFT)) & SYSCFG_EXTICR4_EXTIX_MASK)

/*!
 * @brief SYSCFG_CFGR2 Register Bit Definition
 */

#define SYSCFG_CFGR2_QSPIAUTOIDLEEN_SHIFT       (25)
#define SYSCFG_CFGR2_QSPIAUTOIDLEEN_MASK        (0x01U << SYSCFG_CFGR2_QSPIAUTOIDLEEN_SHIFT)
#define SYSCFG_CFGR2_QSPIAUTOIDLEEN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_QSPIAUTOIDLEEN_SHIFT)) & SYSCFG_CFGR2_QSPIAUTOIDLEEN_MASK)

#define SYSCFG_CFGR2_ENETSPDSEL_SHIFT           (21)
#define SYSCFG_CFGR2_ENETSPDSEL_MASK            (0x01U << SYSCFG_CFGR2_ENETSPDSEL_SHIFT)
#define SYSCFG_CFGR2_ENETSPDSEL(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_ENETSPDSEL_SHIFT)) & SYSCFG_CFGR2_ENETSPDSEL_MASK)

#define SYSCFG_CFGR2_ENETMIIRMIISEL_SHIFT       (20)
#define SYSCFG_CFGR2_ENETMIIRMIISEL_MASK        (0x01U << SYSCFG_CFGR2_ENETMIIRMIISEL_SHIFT)
#define SYSCFG_CFGR2_ENETMIIRMIISEL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_ENETMIIRMIISEL_SHIFT)) & SYSCFG_CFGR2_ENETMIIRMIISEL_MASK)

#define SYSCFG_CFGR2_I2C2MODESEL_SHIFT          (17)
#define SYSCFG_CFGR2_I2C2MODESEL_MASK           (0x01U << SYSCFG_CFGR2_I2C2MODESEL_SHIFT)
#define SYSCFG_CFGR2_I2C2MODESEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_I2C2MODESEL_SHIFT)) & SYSCFG_CFGR2_I2C2MODESEL_MASK)

