OpenAtomFoundation/TobudOS/platform/vendor_bsp/MindMotion/MM32F527/mm32f5277e.h
/*******************************************************************************
 * USB Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t Reserved55[4];                                                   ///< Reserved
    __IO uint32_t FSOTGISTAT;                                                     ///< OTG Interrupt Status Register                offset: 0x10
    __IO uint32_t FSOTGICTRL;                                                     ///< OTG Interrupt Control Register               offset: 0x14
    __IO uint32_t FSOTGSTAT;                                                      ///< OTG Status Register                          offset: 0x18
    __IO uint32_t FSOTGCTRL;                                                      ///< OTG Control Register                         offset: 0x1C
    __IO uint32_t Reserved56[24];                                                  ///< Reserved
    __IO uint32_t FSINTSTAT;                                                      ///< Interrupt Status Register                    offset: 0x80
    __IO uint32_t FSINTENB;                                                       ///< Interrupt Enable Register                    offset: 0x84
    __IO uint32_t FSERRSTAT;                                                      ///< Error Interrupt Status Register              offset: 0x88
    __IO uint32_t FSERRENB;                                                       ///< Error Interrupt Enable Register              offset: 0x8C
    __IO uint32_t FSSTAT;                                                         ///< Status Register                              offset: 0x90
    __IO uint32_t FSCTL;                                                          ///< Control Register                             offset: 0x94
    __IO uint32_t FSADDR;                                                         ///< Address Register                             offset: 0x98
    __IO uint32_t FSBDTPAGE1;                                                     ///< BDT Page Register 1                          offset: 0x9C
    __IO uint32_t FSFRMNUML;                                                      ///< Frame Number Register                        offset: 0xA0
    __IO uint32_t FSFRMNUMH;                                                      ///< Frame Number Register                        offset: 0xA4
    __IO uint32_t FSTOKEN;                                                        ///< Token Register                               offset: 0xA8
    __IO uint32_t FSSOFTHLD;                                                      ///< SOF Threshold Register                       offset: 0xAC
    __IO uint32_t FSBDTPAGE2;                                                     ///< BDT Page Register 2                          offset: 0xB0
    __IO uint32_t FSBDTPAGE3;                                                     ///< BDT Page Register 3                          offset: 0xB4
    __IO uint32_t Reserved57[2];                                                   ///< Reserved
    __IO uint32_t FSEPCTL[16];                                                    ///< Endpoint control register 0 ~15            offset: 0xC0
    __IO uint32_t FSUSBCTRL;                                                      ///< USB control register                         offset 0x100
} USB_Type;

/*******************************************************************************
 * USB Type
 ******************************************************************************/

/*!
 * @addtogroup USB_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief USB_FS_OTGISTAT Register Bit Definition
 */

#define USB_FSOTGISTAT_IDCHG_SHIFT              (7)
#define USB_FSOTGISTAT_IDCHG_MASK               (0x01U << USB_FSOTGISTAT_IDCHG_SHIFT)
#define USB_FSOTGISTAT_IDCHG(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_IDCHG_SHIFT)) & USB_FSOTGISTAT_IDCHG_MASK)

#define USB_FSOTGISTAT_1MSEC_SHIFT              (6)
#define USB_FSOTGISTAT_1MSEC_MASK               (0x01U << USB_FSOTGISTAT_1MSEC_SHIFT)
#define USB_FSOTGISTAT_1MSEC(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_1MSEC_SHIFT)) & USB_FSOTGISTAT_1MSEC_MASK)

#define USB_FSOTGISTAT_LINESTATECHG_SHIFT       (5)
#define USB_FSOTGISTAT_LINESTATECHG_MASK        (0x01U << USB_FSOTGISTAT_LINESTATECHG_SHIFT)
#define USB_FSOTGISTAT_LINESTATECHG(x)          (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_LINESTATECHG_SHIFT)) & USB_FSOTGISTAT_LINESTATECHG_MASK)

#define USB_FSOTGISTAT_SESSVLDCHG_SHIFT         (2)
#define USB_FSOTGISTAT_SESSVLDCHG_MASK          (0x01U << USB_FSOTGISTAT_SESSVLDCHG_SHIFT)
#define USB_FSOTGISTAT_SESSVLDCHG(x)            (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_SESSVLDCHG_SHIFT)) & USB_FSOTGISTAT_SESSVLDCHG_MASK)

#define USB_FSOTGISTAT_BSESSENDCHG_SHIFT        (2)
#define USB_FSOTGISTAT_BSESSENDCHG_MASK         (0x01U << USB_FSOTGISTAT_BSESSENDCHG_SHIFT)
#define USB_FSOTGISTAT_BSESSENDCHG(x)           (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_BSESSENDCHG_SHIFT)) & USB_FSOTGISTAT_BSESSENDCHG_MASK)

#define USB_FSOTGISTAT_AVBUSVLDCHG_SHIFT        (0)
#define USB_FSOTGISTAT_AVBUSVLDCHG_MASK         (0x01U << USB_FSOTGISTAT_AVBUSVLDCHG_SHIFT)
#define USB_FSOTGISTAT_AVBUSVLDCHG(x)           (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_AVBUSVLDCHG_SHIFT)) & USB_FSOTGISTAT_AVBUSVLDCHG_MASK)

/*!
 * @brief USB_FS_OTGICTRL Register Bit Definition
 */

#define USB_FSOTGICTRL_IDEN_SHIFT               (7)
#define USB_FSOTGICTRL_IDEN_MASK                (0x01U << USB_FSOTGICTRL_IDEN_SHIFT)
#define USB_FSOTGICTRL_IDEN(x)                  (((uint32_t)(((uint32_t)(x)) << USB_FSOTGICTRL_IDEN_SHIFT)) & USB_FSOTGICTRL_IDEN_MASK)

#define USB_FSOTGICTRL_1MSECEN_SHIFT            (6)
#define USB_FSOTGICTRL_1MSECEN_MASK             (0x01U << USB_FSOTGICTRL_1MSECEN_SHIFT)
#define USB_FSOTGICTRL_1MSECEN(x)               (((uint32_t)(((uint32_t)(x)) << USB_FSOTGICTRL_1MSECEN_SHIFT)) & USB_FSOTGICTRL_1MSECEN_MASK)

#define USB_FSOTGICTRL_LINESTATEEN_SHIFT        (5)
#define USB_FSOTGICTRL_LINESTATEEN_MASK         (0x01U << USB_FSOTGICTRL_LINESTATEEN_SHIFT)
#define USB_FSOTGICTRL_LINESTATEEN(x)           (((uint32_t)(((uint32_t)(x)) << USB_FSOTGICTRL_LINESTATEEN_SHIFT)) & USB_FSOTGICTRL_LINESTATEEN_MASK)

#define USB_FSOTGICTRL_SESSVLDEN_SHIFT          (3)
#define USB_FSOTGICTRL_SESSVLDEN_MASK           (0x01U << USB_FSOTGICTRL_SESSVLDEN_SHIFT)
#define USB_FSOTGICTRL_SESSVLDEN(x)             (((uint32_t)(((uint32_t)(x)) << USB_FSOTGICTRL_SESSVLDEN_SHIFT)) & USB_FSOTGICTRL_SESSVLDEN_MASK)

#define USB_FSOTGICTRL_BSESSENDEN_SHIFT         (2)
#define USB_FSOTGICTRL_BSESSENDEN_MASK          (0x01U << USB_FSOTGICTRL_BSESSENDEN_SHIFT)
#define USB_FSOTGICTRL_BSESSENDEN(x)            (((uint32_t)(((uint32_t)(x)) << USB_FSOTGICTRL_BSESSENDEN_SHIFT)) & USB_FSOTGICTRL_BSESSENDEN_MASK)

#define USB_FSOTGICTRL_AVBUSVLDEN_SHIFT         (0)
#define USB_FSOTGICTRL_AVBUSVLDEN_MASK          (0x01U << USB_FSOTGICTRL_AVBUSVLDEN_SHIFT)
#define USB_FSOTGICTRL_AVBUSVLDEN(x)            (((uint32_t)(((uint32_t)(x)) << USB_FSOTGICTRL_AVBUSVLDEN_SHIFT)) & USB_FSOTGICTRL_AVBUSVLDEN_MASK)

/*!
 * @brief USB_FS_OTGSTAT Register Bit Definition
 */

#define USB_FSOTGSTAT_ID_SHIFT                  (7)
#define USB_FSOTGSTAT_ID_MASK                   (0x01U << USB_FSOTGSTAT_ID_SHIFT)
#define USB_FSOTGSTAT_ID(x)                     (((uint32_t)(((uint32_t)(x)) << USB_FSOTGSTAT_ID_SHIFT)) & USB_FSOTGSTAT_ID_MASK)

